{"id":10030,"date":"2022-02-16T18:22:22","date_gmt":"2022-02-16T12:52:22","guid":{"rendered":"https:\/\/www.cry.org\/?p=10030"},"modified":"2022-07-18T11:13:09","modified_gmt":"2022-07-18T05:43:09","slug":"malini-paves-her-future-to-become-a-doctor-the-first-ever-from-her-village","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/malini-paves-her-future-to-become-a-doctor-the-first-ever-from-her-village\/","title":{"rendered":"Malini Paves Her Future To Become A Doctor &#8211; The First Ever From Her Village"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"800\" height=\"534\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/cry-success-story-malini-first-ever-doctor-from-her-village.jpg\" alt=\"Malini\" class=\"wp-image-10033\"\/><\/figure>\n\n\n\n<p>Malini, an 18-year-old girl lives in a remote village in the Tirunelveli district of Tamil Nadu. The place that doesn&#8217;t even have proper transportation and is deprived of many facilities. Coming from a marginalised background, she resides in a one-room and kitchen setup with her parents and younger sister. She does not even have her personal space and manages to study, tucked in one corner of the room. While her father works as a daily wage labourer under MNREGA, her mother runs a small petty shop selling eatables near the house.<\/p>\n\n\n\n<p>A bold, vibrant and active girl, Malini did not let these problems come her way and was always focused on her goal of becoming a doctor. Right from the beginning, she was never afraid of voicing her own opinion despite facing resistance from her father in the initial years. Going to the village&#8217;s government school, even with the limited resources, she always had the knack of keep learning new things all by herself. Not just the school education but she was also keen to understand the social issues and was a part of the village level children’s collective until 9th grade. She actively participated in all the events and programs organized by CRY’s partner organisation, Human Rights Education and Protection Council (HREPC).<\/p>\n\n\n\n<p>This project was started 10 years ago and is still operational in Tirunelveli and Tenkasi district of Tamil Nadu. Focusing on the health and <a href=\"https:\/\/www.cry.org\/blog\/importance-of-girl-child-education-in-india\/\">education of adolescent girls<\/a>, the project mainly focuses on marginalised children and prepares them to pursue higher education for courses like engineering and medical.<\/p>\n\n\n\n<p>With Malini, the partner team of CRY regularly visited her home and her parents to keep them motivated. They made sure to provide her with all the important study material she required for her preparation, especially during the lockdown. The team also identified teachers from other schools to help Malini understand English since her teachers were only well versed in Tamil. And amongst all this, Malini’s mother stood as a pillar of strength who backed her right from the beginning ensuring that both her daughters complete their education and achieve their goals. Seeing her mother, Malini’s father also started supporting her dreams and goals of becoming a doctor.<\/p>\n\n\n\n<p>Understanding the seriousness of 10th and 12th grade, Malini decided to gather all her focus on her studies and pass her exams with flying colours but still stayed connected with the team. Recognising Malini’s true potential, the partner team regularly visited her house to provide her with all the support and timely guidance. They always motivated her to study well and get good marks for better and higher education opportunities. After scoring 82% in her 10th grade, she opted for Biology and Maths scoring 80% in 12th grade.<\/p>\n\n\n\n<p>For Malini, the biggest challenge that she faced was the language barrier and multiple lockdowns that kept her away from regular and physical coaching. Since her school did not have classes in English medium, she grasped the English language all by herself because her school teachers were unable to do so. Since she was so focused on becoming a doctor, the partner team guided her to pursue NEET coaching because it is extremely difficult to crack the exam without additional teaching support. In her first attempt, she couldn’t clear MBBS but was eligible for BDS; she was ready to give another go to pursue MBBS this time around. Her parents also understood her passion to become a doctor and supported her in every possible way. So much so that they even pledged their belongings to send Malini for the NEET coaching.<\/p>\n\n\n\n<p>But Malini&#8217;s struggles didn’t end here. With India being hit by the second wave and going through multiple lockdowns, the classes were affected too! She tried to manage on her own and extract all kinds of information to study online in every possible way. Her family and the team was always by her side for constant motivation and guidance. Finally, all her struggles and hard work paid off when she secured 83rd Rank under the 7.5% quota for Government school students implemented by the Tamil Nadu state government. Through this, she got admission for MBBS in Tirunelveli Medical College and thanks to her efforts, her village will soon get its very own female doctor!<\/p>\n\n\n\n<p>Malini is now an icon in her community and an amazing example for all the children of how she broke the glass ceiling and all the economic barriers making her parents proud. For girls like her, coming from an underprivileged background, they face challenges which are not just economic but also being a girl child they can easily be pushed into child labour and child marriage. She proved that nothing can come her way and her goals with hard work, diligence and determination. CRY makes sure to reach more girls like Malini, giving them ample opportunities to come closer to their dreams and helping them live the life they wish for.<\/p>\n\n\n\n<p>“I had faced all barriers that every girl child comes across in her life but my focused approach towards succeeding and unwavering mind for pursuing my dream along with my parents’ support brought the success,” says Malini. We wish her luck as she embarks on her journey to become a doctor.<\/p>\n\n\n\n<p>Let us come together to support more girls like Malini who if given the right opportunities can fulfil their dreams. Make a <a href=\"https:\/\/www.cry.org\/donation\/\" target=\"_blank\" rel=\"noreferrer noopener\">donation<\/a> to CRY today and help India’s daughters shine!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Malini, an 18-year-old girl lives in a remote village in the Tirunelveli district of Tamil Nadu. The place that doesn&#8217;t even have proper transportation and is deprived of many facilities. Coming from a marginalised background, she resides in a one-room and kitchen setup with her parents and younger sister. She does not even have her [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3,12],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10030"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=10030"}],"version-history":[{"count":1,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10030\/revisions"}],"predecessor-version":[{"id":10034,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10030\/revisions\/10034"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=10030"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=10030"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=10030"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}