{"id":10085,"date":"2022-02-22T19:00:10","date_gmt":"2022-02-22T13:30:10","guid":{"rendered":"https:\/\/www.cry.org\/?p=10085"},"modified":"2022-07-18T11:12:55","modified_gmt":"2022-07-18T05:42:55","slug":"meet-our-vaccinemitra-shahzada-who-helped-the-entire-village-get-vaccinated-in-kashmir","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/meet-our-vaccinemitra-shahzada-who-helped-the-entire-village-get-vaccinated-in-kashmir\/","title":{"rendered":"Meet Our #VaccineMitra Shahzada, Who Helped the Entire Village Get Vaccinated in Kashmir!"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"800\" height=\"534\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/meet-our-vaccinemitra-shahzada.jpg\" alt=\"Vaccine Mitra\" class=\"wp-image-10086\"\/><\/figure>\n\n\n\n<p>With the ongoing pandemic, ensuring everyone gets both doses of vaccine is important to stay protected from the virus. However, in a country like ours, illiteracy, poverty, lack of resources and awareness, are some of the factors that kept the underserved community away from the vaccination drive. During the second wave, hesitancy due to apprehensions and myths around vaccination had reduced the uptake in such communities thus making them more vulnerable. Also, with a majority of the population living in remote areas, it was a challenge to keep everyone vaccinated and safe. Brinjan in Kashmir was one such village.<\/p>\n\n\n\n<p>CRY works with its partner NGOs to try to reach out to more people making a difference in their lives. When the government started their vaccination campaign, CRY tried to help the people in the farthest areas of the country to get them vaccinated. A lot of health workers, ASHA workers, and teachers joined this campaign. One of them was Shahzada, a teacher working at the Child Activity Centre (CAC) run by a CRY partner in Brinjan, Kashmir. Shahzada, a diligent worker with zeal for bringing a change in society and making a difference in people&#8217;s lives played an important role in vaccinating the people of Brinjan.<\/p>\n\n\n\n<p>In April 2021, when there was a vaccination drive at the nearby Primary Health Centre, located about 2 kilometres from the village, turnout was very low. Due to rumours and misinformation, vaccine hesitancy was high amongst the villagers. At this point, Shahzada, stepped in to encourage the villagers to take the vaccine that will protect them from the virus. To inspire them, Shahzada got all her family members vaccinated first, which went a long way in clearing the misconceptions amongst the villagers.<\/p>\n\n\n\n<p>With the vaccination centre opening up, Shahzada along with the team of government volunteers spared no effort to help the whole village get vaccinated. She went door to door covering 200 families, making them understand the importance of vaccines. She prepared flashcards, banners and posters to disseminate the information to as many people. She even involved the children who came to the CAC centres informing them about the vaccines so that they can pass on the information to their parents. To motivate people, she often went inside paddy fields, orchards, and shops, and as a result, a large number of people showed up at the vaccination centre. She also took health officials along with her for door-to-door and on-site vaccinations.<\/p>\n\n\n\n<p>With her continuous and brave efforts, Shahzada was finally able to vaccinate the entire village population of Brinjan that was above 45 years of age despite the challenging terrain, extreme weather conditions, hostility, fatigue and long working hours.<\/p>\n\n\n\n<p>It’s because of her determination, Shahzada’s hard work paid off and made an impossible task possible,that is to get the whole village vaccinated. While your continuous support has helped us reach so many people, we still have a long way to go. Donate to CRY today to&nbsp;<a href=\"https:\/\/www.cry.org\/ensure-vaccination-of-underserved-communities-nhvd\/\" target=\"_blank\" rel=\"noreferrer noopener\">ensure vaccination for the underserved communities<\/a>, because no one is safe until everyone is safe, including our children!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With the ongoing pandemic, ensuring everyone gets both doses of vaccine is important to stay protected from the virus. However, in a country like ours, illiteracy, poverty, lack of resources and awareness, are some of the factors that kept the underserved community away from the vaccination drive. During the second wave, hesitancy due to apprehensions [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10085"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=10085"}],"version-history":[{"count":2,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10085\/revisions"}],"predecessor-version":[{"id":10089,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10085\/revisions\/10089"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=10085"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=10085"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=10085"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}