{"id":10235,"date":"2022-03-09T13:04:16","date_gmt":"2022-03-09T07:34:16","guid":{"rendered":"https:\/\/www.cry.org\/?p=10235"},"modified":"2022-07-18T11:12:33","modified_gmt":"2022-07-18T05:42:33","slug":"heres-revathis-journey-from-a-small-village-to-working-for-indias-largest-it-company","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/heres-revathis-journey-from-a-small-village-to-working-for-indias-largest-it-company\/","title":{"rendered":"Here’s Revathi’s Journey From A Small Village To Working For India’s Largest IT Company"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"1040\" height=\"780\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/Revathi_PORD_AP.jpg\" alt=\"Revathi\" class=\"wp-image-10236\"\/><\/figure>\n\n\n\n<p>“My dream has always been to get a good education and have my own voice”<\/p>\n\n\n\n<p>Growing up in a marginalised family did not stop Revathi to dream big for herself. Revathi was born in a small village in Andhra Pradesh where her parents are farmers. Though a shy kid, right from the beginning she was a curious and fast learner, trying to get to the crux of everything. When Revathi’s village did not offer secondary education, her parents moved Revathi and her sister to their grandparents’ home in a nearby town to pursue their education. Her parents were always keen to provide a proper education for their children.&nbsp;<\/p>\n\n\n\n<p>Revathi grew up dreaming of creating her own space in the world, achieving her potential, and defining her own identity. Her grandparents’ house was not a safe place for girls and thus she couldn’t go out of the house much. Revathi wanted to step out of the closed space, explore and learn so much. In the initial 2-3 years, her exposure to the external world was very limited, until a regional project of CRY, People’s Organisation of Rural Development (PORD) arrived in her neighbourhood.<\/p>\n\n\n\n<p>The People’s Organisation of Rural Development (PORD) project focuses on ensuring quality life, equal opportunities, health and education protection to the children in the underserved areas. This helps them lead a life with dignity, have a safe childhood and also give them a space to come together and understand their community.&nbsp;<\/p>\n\n\n\n<p>With their door-to-door campaign, the team invited Revathi to be a part of their children’s collective meet taking place in the neighbourhood. Banking on the opportunity, Revathi was happy to be a part of this exciting initiative but experienced resistance from her reluctant grandparents. However, Revathi’s resilience and a little persuasion from the project team paved the way for her to be a part of the children’s collective.&nbsp;<\/p>\n\n\n\n<p>The children’s collective is a space for children to come together to make them aware of the child’s rights and the problems so that they can voice their opinions. This collective also gives children a platform to know their aspirations better and helps them continue with their education.&nbsp;<\/p>\n\n\n\n<p>According to Revathi, she found her calling with the children’s collective. The space gave her endless opportunities to navigate in each direction and be active as much as she can. It gave her the confidence she needed to make a mark in the outside world. She made sure to take part in all discussions and activities that took place in the collectives.&nbsp;<\/p>\n\n\n\n<p>Revathi’s active participation with the PORD project activities brought many children from the neighbourhood together as a community and made childhoods safe for children. The team also encouraged these children to pursue their studies as well so that they have better opportunities in the future, which will also end the cycle of poverty.&nbsp;<\/p>\n\n\n\n<p>The children&#8217;s collective opened up a new world for Revathi and there was no looking back for her! It gave her a great platform to have a voice, and transform into a strong independent woman with high aspirations. While she actively took part in activities and made herself aware of child rights and their violations, the PORD team in recognition of her zeal and enthusiasm, made her the child resource person for the community and trained her to talk and mobilise people about child rights at different forums. She visited different schools where she spoke on child rights. Going further, she even started a conversation on menstrual health in the children’s collective and was made the child rights ambassador. The team always ensured to keep the spark of curiosity in her alive and guided her to study better. They also helped her with future educational opportunities.&nbsp;<\/p>\n\n\n\n<p>After completing her 12th grade, she got a chance to be an Ashoka Youth Venturer with the help of the ongoing CRY project. Seeing the passion and zeal that Revathi had for the Children’s Collective, the CRY project nominated her for the Ashoka Youth Venture Fellowship. CRY informs partners about the fellowship that gives budding talents a chance to be the changemakers who have the potential to bring a transformation to the community. This amazing opportunity was another turning point in Revathi’s life where she had a chance to explore more possibilities to add up to her knowledge on child rights.<\/p>\n\n\n\n<p>Bringing her experience from the project of mobilising children and protecting them from the evil of child marriage and labour, Revathi sought to seek out a new direction for the girls with the help of quality education. Ashoka Fellowship made a lasting impact on Revathi’s life and paved the way towards a brighter future. The fellowship helped in developing soft skills and strengthening her decision-making skills, adding up to the talents of a changemaker. This experience allowed Revathi to seek a new direction for the future and transformed her life where she can voice her own opinion and be the differential factor in society. Going ahead in her journey, Revathi has managed to complete her BTech and with your help and support, today she is a project engineer in one of India&#8217;s largest IT companies.&nbsp;<\/p>\n\n\n\n<p>Girls in India are pushed to further marginalisation due to gender discrimination. Many girls like Revathi need a strong backbone that helps them to have the right opportunities to reach their truest potential. Your support will help us reach more children enabling them to continue their education and make their own space in this big world. <a href=\"https:\/\/www.cry.org\/donation\/\" target=\"_blank\" rel=\"noreferrer noopener\">Donate to CRY<\/a> today and support <a href=\"https:\/\/www.cry.org\/blog\/importance-of-girl-child-education-in-india\/\" target=\"_blank\" rel=\"noreferrer noopener\">girl child education<\/a> to give our girls a tomorrow that is full of possibilities. Help more girls like Revathi shine!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“My dream has always been to get a good education and have my own voice” Growing up in a marginalised family did not stop Revathi to dream big for herself. Revathi was born in a small village in Andhra Pradesh where her parents are farmers. Though a shy kid, right from the beginning she was [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10235"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=10235"}],"version-history":[{"count":2,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10235\/revisions"}],"predecessor-version":[{"id":10238,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10235\/revisions\/10238"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=10235"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=10235"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=10235"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}