{"id":10318,"date":"2022-03-17T20:02:57","date_gmt":"2022-03-17T14:32:57","guid":{"rendered":"https:\/\/www.cry.org\/?p=10318"},"modified":"2022-07-18T11:12:07","modified_gmt":"2022-07-18T05:42:07","slug":"gift-happier-childhoods-to-children-by-helping-them-go-to-school","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/gift-happier-childhoods-to-children-by-helping-them-go-to-school\/","title":{"rendered":"Gift Happier Childhoods To Children By Helping Them Go To School"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"799\" height=\"533\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/34905707972_8a37d03e7b_c.jpg\" alt=\"International Day of Happiness\" class=\"wp-image-10319\"\/><\/figure>\n\n\n\n<p>The International Day of Happiness is celebrated on 20th March to spread awareness regarding the importance of happiness in the lives of people across the world. Happiness is the key to a wholesome life but that is a far-reaching reality with the ongoing crisis, for underprivileged communities, especially children in India.&nbsp;<\/p>\n\n\n\n<p>According to UNICEF, the closure of 1.5 million schools has impacted 247 million children enrolled in elementary and secondary schools in India. Children have been out of school for over more than 600 days. It has robbed them of the chance to realize their true potential, they are battling massive learning deficits. Many children may permanently discontinue their education by dropping out of school and others may never get enrolled if this is not addressed in time. The pandemic has affected children’s ability to cope with their studies and can deteriorate their overall development.&nbsp;<\/p>\n\n\n\n<p>Due to the ongoing scenario, children from underserved communities are highly susceptible to child labour, early marriage, economic exploitation, sexual abuse, and child trafficking. The primary data collected by our on-ground team in 18 states of CRY’s operational areas shows that there has been an appalling 82% increase in child labour already, in last year alone.<\/p>\n\n\n\n<p>We, at CRY, have been working tirelessly to&nbsp;<a href=\"https:\/\/www.cry.org\/why-children\/\">protect children’s rights<\/a> and help address their learning gap with the help of our bridge schools. Bridge classes have been available to provide structured learning to ensure the number of school dropouts does not increase. Children from VI to XII grade are engaged in bridge classes and we’re ensuring the teachers have access to digital aids too.<\/p>\n\n\n\n<p>CRY, India’s most trusted NGO, has also been providing psychosocial support to children. The restricted movements during the lockdown and loss of livelihoods have put children at a greater risk of facing issues of stress, violence, abuse, and neglect. Our ground team is promoting well-being and confidence, building knowledge, and expanding their minds to useful and relevant skills via digital platforms.<\/p>\n\n\n\n<p>This International Day of Happiness,&nbsp;<a href=\"https:\/\/www.cry.org\/donation\/\">donate for children’s education<\/a><strong><a href=\"https:\/\/www.cry.org\/donation\/\">&nbsp;<\/a><\/strong>to gift them happier and safer childhoods. Your contribution to CRY will ensure that India’s children get a proper education and find their true potential. Donate and also avail of a tax deduction under <a href=\"https:\/\/www.cry.org\/blog\/donate-and-avail-deduction-under-section-80g-of-income-tax-act\/\">80 G of the Income Tax Act<\/a> so support now!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The International Day of Happiness is celebrated on 20th March to spread awareness regarding the importance of happiness in the lives of people across the world. Happiness is the key to a wholesome life but that is a far-reaching reality with the ongoing crisis, for underprivileged communities, especially children in India.&nbsp; According to UNICEF, the [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[13],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10318"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=10318"}],"version-history":[{"count":3,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10318\/revisions"}],"predecessor-version":[{"id":11074,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10318\/revisions\/11074"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=10318"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=10318"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=10318"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}