{"id":10436,"date":"2022-04-13T16:45:59","date_gmt":"2022-04-13T11:15:59","guid":{"rendered":"https:\/\/www.cry.org\/?p=10436"},"modified":"2022-07-18T11:11:55","modified_gmt":"2022-07-18T05:41:55","slug":"protect-childhoods-by-addressing-the-issue-of-child-marriage","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/protect-childhoods-by-addressing-the-issue-of-child-marriage\/","title":{"rendered":"Protect Childhoods by Addressing the Issue of Child Marriage"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"800\" height=\"600\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/Child-Marriage-1.jpg\" alt=\"Child Marriage in India\" class=\"wp-image-10437\"\/><\/figure>\n\n\n\n<p>India is home to millions of young girls who hail from marginalized communities. All girls must have access to their basic rights of regular education, safety and protection, healthcare etc. Unfortunately, the girl child is still not welcome in many homes and is considered to be a financial liability in most parts of India. She is prevented from being born and even if she manages to survive, there are several barriers that block the path of young girls to lead a life of equal opportunity. Due to dire poverty in their homes and community at large, young girls are prone to abuse, violence, and neglect. This triggers more stress, vulnerability, and danger for them.<\/p>\n\n\n\n<p>More often than not, such environments lead to the rampant practice of&nbsp;<a href=\"https:\/\/www.cry.org\/blog\/beating-child-marriage-in-covid-times\/\"><u>child marriage in India<\/u><\/a>&nbsp;which is one of the most frequent forms of child abuse. UNICEF 2014 solidifies this harrowing reality by throwing light on the fact that 1 out of 3 child brides in the world is from India. Child marriage is prevalent in many parts of India to varying degrees. Many young girls go through sexual abuse and other forms of exploitation, particularly in the case of girls under the age of 18.&nbsp;<\/p>\n\n\n\n<p>Young girls must go to school instead of becoming child brides as this issue leads to illiteracy and early motherhood. UNICEF further highlights this as 60% of girls, who married before the age of 15, gave birth before turning 18. Girls get married instead of studying or playing with other children of their age. This hampers their adolescent years and denies them their right to learn and grow.<\/p>\n\n\n\n<p>To make matters worse, the COVID-19 pandemic has affected many homes due to the loss of livelihood. Instead of helping reduce the financial burden, child marriage worsens the economic condition across generations, besides being a human rights violation.&nbsp;<\/p>\n\n\n\n<p>At CRY, we have been working hard to protect and honor the rights of young girls. We have also been carrying out online counselling sessions, organizing home visits, and spreading awareness of the ill effects of child marriage in several communities. Your generous donation to CRY can help all of our on-ground teams in reaching more families and ensuring the practice of child marriage is discontinued; it is time for justice, respect and equity for all young girls.&nbsp;<a href=\"https:\/\/www.cry.org\/donation\/\"><u>Donate<\/u><\/a>&nbsp;to CRY, India’s most trusted NGO, to give India’s daughters a more promising future.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>India is home to millions of young girls who hail from marginalized communities. All girls must have access to their basic rights of regular education, safety and protection, healthcare etc. Unfortunately, the girl child is still not welcome in many homes and is considered to be a financial liability in most parts of India. She [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10436"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=10436"}],"version-history":[{"count":1,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10436\/revisions"}],"predecessor-version":[{"id":10438,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10436\/revisions\/10438"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=10436"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=10436"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=10436"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}