{"id":10449,"date":"2022-04-15T15:49:08","date_gmt":"2022-04-15T10:19:08","guid":{"rendered":"https:\/\/www.cry.org\/?p=10449"},"modified":"2022-07-18T11:11:41","modified_gmt":"2022-07-18T05:41:41","slug":"from-a-farm-to-a-football-field-this-is-mamtas-story-of-defying-all-odds-to-become-a-google-woman-icon","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/from-a-farm-to-a-football-field-this-is-mamtas-story-of-defying-all-odds-to-become-a-google-woman-icon\/","title":{"rendered":"From A Farm To A Football Field &#8211; This Is Mamta’s Story Of Defying All Odds To Become A Google Woman Icon!"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"800\" height=\"534\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/Mamta-Blog-Image-min.png\" alt=\"Mamta’s Story\" class=\"wp-image-10450\"\/><\/figure>\n\n\n\n<p>“My dream is to represent India on the international&nbsp;sports&nbsp;stage!”<\/p>\n\n\n\n<p>Mamta Gujjar&nbsp;is&nbsp;a&nbsp;shining&nbsp;amazing example&nbsp;of how sport can change children’s lives.&nbsp;<\/p>\n\n\n\n<p>Mamta belongs to a small village in the Rajasthan and hails from the Gujjar community whose primary livelihood&nbsp;comes from&nbsp;farming and animal rearing.<\/p>\n\n\n\n<p>A few years ago, Mamta was about to drop out of school&nbsp;to help her mother with household chores&nbsp;and support the family’s livelihood.&nbsp;At the tender age of 15, her parents began thinking of getting her married but&nbsp;she somehow persuaded&nbsp;them to let her at least&nbsp;complete her graduation.<\/p>\n\n\n\n<p>That is when she&nbsp;became acquainted with the CRY project&nbsp;Mahila Janadhikar Samiti (MJAS) and their work on children’s rights&nbsp;in&nbsp;her&nbsp;village. Mamta decided to&nbsp;participate&nbsp;in the initial group sessions&nbsp;being conducted&nbsp;for adolescent girls&nbsp;and was encouraged to take up the sport as a part of MJAS’s life skills program.<\/p>\n\n\n\n<p>She went on to form the MJAS girls&#8217; football team and won many accolades&nbsp;across multiple&nbsp;tournaments&nbsp;including&nbsp;the &#8216;Sports for Change&#8217; tournament&nbsp;organized by&nbsp;HCL Foundation&nbsp;as well as&nbsp;the&nbsp;state level sports festival conducted by the Rajasthan Government.<\/p>\n\n\n\n<p>But while her talent in football was earning her recognition, her father wasn’t thrilled with the idea of a girl taking up a male-dominated sport like football. Her community raised concerns&nbsp;about girls playing in shorts&nbsp;and her team was often harassed during practice sessions by those who wanted them to stop playing.<\/p>\n\n\n\n<p>The girls were not deterred. They sought support from their mothers and, led by Mamta and her sister Sapna, continued honing their skills on the football field – determined to show their community that girls could not only play football but also bring pride to their community as sportswomen.<\/p>\n\n\n\n<p>Their efforts and persistence bore fruit – the tournaments they won became a way to break gender stereotypes and their hard work earned them multiple scholarships to continue their education;&nbsp;Mamta herself passed the higher secondary examination with 1st division marks!<\/p>\n\n\n\n<p>Being a part of MJAS’s adolescent girls&#8217; group, she also consistently raises awareness for ensuring that schools have enough teachers and quality education is accessible to all children; including girls. &nbsp;<\/p>\n\n\n\n<p>In 2022, inspired by her story, Google selected her as a Google Women Icon – a milestone that is a testament to everything she has done to change patriarchal norms and enable girls in her community to rise to their truest potential! &nbsp;<\/p>\n\n\n\n<p>As CRY, we dream of a day when more children like Mamta are able to shine bright and make the nation proud. You can help!&nbsp;Support CRY&nbsp;by making a <a href=\"https:\/\/www.cry.org\/donation\/\"><u>donation<\/u><\/a>&nbsp;and helping India’s daughters pave their way to a better future.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“My dream is to represent India on the international&nbsp;sports&nbsp;stage!” Mamta Gujjar&nbsp;is&nbsp;a&nbsp;shining&nbsp;amazing example&nbsp;of how sport can change children’s lives.&nbsp; Mamta belongs to a small village in the Rajasthan and hails from the Gujjar community whose primary livelihood&nbsp;comes from&nbsp;farming and animal rearing. A few years ago, Mamta was about to drop out of school&nbsp;to help her mother [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[2,27],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10449"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=10449"}],"version-history":[{"count":2,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10449\/revisions"}],"predecessor-version":[{"id":10776,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10449\/revisions\/10776"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=10449"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=10449"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=10449"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}