{"id":10488,"date":"2022-04-20T11:52:04","date_gmt":"2022-04-20T06:22:04","guid":{"rendered":"https:\/\/www.cry.org\/?p=10488"},"modified":"2022-07-18T11:11:28","modified_gmt":"2022-07-18T05:41:28","slug":"your-donation-to-cry-can-help-stop-child-labour-in-india","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/your-donation-to-cry-can-help-stop-child-labour-in-india\/","title":{"rendered":"Your Donation To CRY Can Help Stop Child Labour In India"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"1429\" height=\"953\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/stop-child-labour-1.jpg\" alt=\"Stop Child Labour In India\" class=\"wp-image-10489\"\/><\/figure>\n\n\n\n<p>It is the birthright of all children to grow up in a safe and secure environment. Children must have access to their basic rights, including a proper education, health and nutrition, safety and protection, and participation. Children are the building blocks of our nation’s future but the potential of millions of India’s children is getting compromised due to child labour. As clarified by International Labour Organization (ILO), child labour includes children working from a young age where they are required to work for long and tedious hours under hazardous conditions.<\/p>\n\n\n\n<p>Census 2011 shows that there are 33 million working children in India between 0-18 years. As child labourers, they work at tea stalls, factories, construction sites etc. Unfortunately, the impact of this practice is immediate and continues to cause long-term ripple effects that may be irreversible in many cases. Child labour forces children to be away from school and deprive them of quality playtime with other children of their age for healthy development. Working for little or no money at farms, offices, or factories strips them of their dignity and security.&nbsp;&nbsp;<\/p>\n\n\n\n<p>All children must be able to nurture their skills and true potential but those from marginalized communities have considerably lesser chances of being rescued from the vicious cycle of poverty and exploitation, thus they end up facing&nbsp;<a href=\"https:\/\/www.cry.org\/blog\/child-trafficking-abuse-must-be-addressed-in-india\/\" title=\"Your Donation To CRY Can Help Stop Child Labour In India\">child abuse in India<\/a> in the form of child labour.<\/p>\n\n\n\n<p>At CRY, we have been rigorously working to ensure that such children go to school instead of work so that they have a chance at a better future. Our collective efforts with crucial stakeholders like Anganwadi workers, governments at the district and state level, parents, teachers, and the community at large have helped protect many children. The on-ground teams of CRY also involve and sensitize children through awareness sessions with their families to help spread crucial information regarding child labour.<\/p>\n\n\n\n<p>In the past one year,&nbsp;7,582 children in CRY project areas rescued from child labour, child marriage, and child trafficking. Your donation to CRY (Child Rights and You) can help <a href=\"https:\/\/www.cry.org\/blog\/reality-of-the-practice-of-child-labor-in-india\/\">stop child labour<\/a> and ensure that children learn, not earn. Your donation transactions are completely safe and secure and are also tax exempted under 80G of the Indian Income Tax Act. Donate now!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It is the birthright of all children to grow up in a safe and secure environment. Children must have access to their basic rights, including a proper education, health and nutrition, safety and protection, and participation. Children are the building blocks of our nation’s future but the potential of millions of India’s children is getting [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[4],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10488"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=10488"}],"version-history":[{"count":4,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10488\/revisions"}],"predecessor-version":[{"id":11069,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10488\/revisions\/11069"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=10488"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=10488"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=10488"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}