{"id":10620,"date":"2022-05-12T16:41:33","date_gmt":"2022-05-12T11:11:33","guid":{"rendered":"https:\/\/www.cry.org\/?p=10620"},"modified":"2022-07-18T12:26:05","modified_gmt":"2022-07-18T06:56:05","slug":"from-a-child-marriage-survivor-to-a-police-constable-today-heres-abhas-journey","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/from-a-child-marriage-survivor-to-a-police-constable-today-heres-abhas-journey\/","title":{"rendered":"From A Child Marriage Survivor To A Police Constable Today &#8211; Here’s Abha’s Journey!"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"800\" height=\"534\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/Abhas-Blog-Image.png\" alt=\"Abha Kumari\" class=\"wp-image-10707\"\/><\/figure>\n\n\n\n<p>Every day when Abha Kumari dons the police uniform, her parents are nothing but proud of their daughter! Abha, a girl from a small village in Samastipur district is a constable in Bihar Police today. She is a role model and an inspiration for everyone. Especially for those girls who have so many dreams in life but still trying hard to make&nbsp;a&nbsp;way for themselves in this big world.<\/p>\n\n\n\n<p>However, a few years ago, Abha’s life looked nowhere close to this!<\/p>\n\n\n\n<p>Abha with her mother and five siblings stayed in the village while her father, a daily wage labourer living in Kolkata, earned a meagre amount.&nbsp;Even when Abha was in primary school, she dreamed of becoming a police officer, a far-fetched dream for most girls in her position.<\/p>\n\n\n\n<p>Being the eldest&nbsp;she had a lot of responsibilities in managing the house and taking care of her younger siblings. With so many duties to shoulder,&nbsp;it was difficult for her to take out time for her studies.&nbsp;However, Abha knew that education was her way out and set her sights on taking the matriculation exam<\/p>\n\n\n\n<p>But the&nbsp;biggest challenge for her was to&nbsp;convince her family not to marry her off at the age of 15 so they would have fewer mouths to feed.&nbsp;Fortunately, Abha had the opportunity to be a part of the Jawahar Jyoti Bal Vikas Kendra (JJBVK) project, a partner NGO for CRY in Bihar.&nbsp;<\/p>\n\n\n\n<p>This program carries out sessions to empower the children of the entire village and the girls of the area who are vulnerable to&nbsp;<a href=\"https:\/\/www.cry.org\/blog\/beating-child-marriage-in-covid-times\/\">child marriage<\/a>. It works closely with the children&#8217;s groups and their parents for their access to education as a tool for empowerment. Being a part of this project, was a life-changing experience for Abha. She participated in different sessions, sports and other activities organized by them. Even as she pursued her studies, Abha and her friends in the children’s collective motivated other kids in the community to get themselves enrolled in school, stay in touch with books and attend school regularly.&nbsp;<\/p>\n\n\n\n<p>The collective gave Abha the agency&nbsp;to raise the issue&nbsp;with her parents. She negotiated and convinced them to let her continue her education and not marry her off. She explained that it was important for girls to complete their studies and earn a living for themselves – this would help them fight poverty and usher in a better life.<\/p>\n\n\n\n<p>To convince her parents of her seriousness,&nbsp;she even&nbsp;started tuition for children&nbsp;to earn some money. It helped her keep in touch with her education&nbsp;and prepare for the entrance exams for the police force. She studied rigorously for the written exam, cracked it in one shot, and&nbsp;successfully completed the physical training programme,&nbsp;realising her childhood dream!&nbsp;&nbsp;She&nbsp;joined the Bihar police cadre,&nbsp;and her parents who had made the decision to let her study with great trepidation were overjoyed!&nbsp;&nbsp;<\/p>\n\n\n\n<p>Abha’s&nbsp;goal now is to become an inspector and keep moving forward! In a village where girls have no autonomy in their lives and are married off at a tender age, Abha’s story is an excellent example of&nbsp;what girls can achieve if just given the opportunity to realise their potential.&nbsp;She has paved the way for her siblings to get a good education and help the family get out of the cycle of poverty.<\/p>\n\n\n\n<p>Let us support more girls like Abha to complete their education and help them reach their truest potential.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.cry.org\/donation\/\">Donate to CRY<\/a>&nbsp;today and help India’s daughters shine!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every day when Abha Kumari dons the police uniform, her parents are nothing but proud of their daughter! Abha, a girl from a small village in Samastipur district is a constable in Bihar Police today. She is a role model and an inspiration for everyone. Especially for those girls who have so many dreams in [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[5,2,27],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10620"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=10620"}],"version-history":[{"count":6,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10620\/revisions"}],"predecessor-version":[{"id":10774,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10620\/revisions\/10774"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=10620"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=10620"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=10620"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}