{"id":10926,"date":"2022-06-21T18:14:05","date_gmt":"2022-06-21T12:44:05","guid":{"rendered":"https:\/\/www.cry.org\/?p=10926"},"modified":"2022-07-15T12:26:30","modified_gmt":"2022-07-15T06:56:30","slug":"from-being-a-child-labourer-to-now-an-aspiring-ias-officer-heres-pragnyas-story","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/from-being-a-child-labourer-to-now-an-aspiring-ias-officer-heres-pragnyas-story\/","title":{"rendered":"From Being A Child Labourer To Now An Aspiring IAS Officer &#8211; Here&#8217;s Pragnya&#8217;s Story"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"534\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/Pragnyas-blog.jpg\" alt=\"\" class=\"wp-image-10928\"\/><\/figure>\n\n\n\n<p>16-year- old Pragnya, like any other child her age, was a high-spirited girl who loved to dance, hang out with friends, study and was always eager to learn new things. She loved going to school and studying while at the same time helping her mother with the daily chores in the kitchen. She lived a fairly, normal life in a small village in Karnataka and loved it. But life changed for Pragnya and her mother when one fateful day, her father passed away. Pragnya’s mother had to step up ad take up all the responsibilities on her shoulders. Desperate to make ends meet, Pragnya’s mother was forced to have her drop out of school, and take up field work instead. Pragnya was robbed of a chance at education and the school was replaced with hours working in the fields since it was the only way to support her mother.<\/p>\n\n\n\n<p>This was her life for almost a year until a CRY project partner active in the village, during their awareness and community mobilisation drives, met Pragnya. CRY’s project partner in the area works to ensure rights for children like Pragnya, in difficult conditions by sensitising and empowering children, youth, parents, and caring community groups.&nbsp; The project partners invited her to the local children’s collective. When Pragnya first joined the meetings, she was very reserved and barely spoke to any of the other girls while her mother was also fearful about their finances and future.&nbsp;<strong><\/strong><\/p>\n\n\n\n<p>Community organizers from the CRY project regularly visited, counselled and motivated Pragnya’s mother.&nbsp; They discussed with her the future of her daughter’s education and the negative impact of child marriage. With multiple rounds of talks and meetings, the team finally convinced Pragnya and her mother to leave the work in the fields. While the team re-enrolled Pragnya in the school so that she could resume her studies after the gap, they also arranged an MNREGA job card for Pragnya’s mother, so that she could earn enough to support her family without having to work in the fields or seek Pragnya’s help.<strong><\/strong><\/p>\n\n\n\n<p>The team also conducted special study sessions for adolescent girls in the village, wherein they ensured Pragnya attended and participated actively in these sessions. She is now a regular at her school and her performance in class is improving remarkably. Pragnya has also taken it upon herself to be involved in the collective and inspire every child to go to school and get an education.&nbsp;<strong><\/strong><\/p>\n\n\n\n<p>“Every girl in the village should be able to read, write and become literate.” Says Pragnya who aspires to be an IAS officer to strengthen the education system. She wants to focus on girls&#8217; education in rural areas by ensuring basic infrastructure and transportation facilities so that girls can continue their studies.<strong><\/strong><\/p>\n\n\n\n<p>A lot of children like Pragnya in our country lose their precious childhood to child labour and end up working in an unsafe environment, making them vulnerable to abuse and exploitation. Help us&nbsp;protect these children from <a href=\"https:\/\/www.cry.org\/blog\/reality-of-the-practice-of-child-labor-in-india\/\">child labour&nbsp;in India<\/a> and gift them a future of endless opportunities to fulfil their dreams because they deserve every chance, they can get to build a better life.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>16-year- old Pragnya, like any other child her age, was a high-spirited girl who loved to dance, hang out with friends, study and was always eager to learn new things. She loved going to school and studying while at the same time helping her mother with the daily chores in the kitchen. She lived a [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[4,3],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10926"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=10926"}],"version-history":[{"count":3,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10926\/revisions"}],"predecessor-version":[{"id":11063,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10926\/revisions\/11063"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=10926"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=10926"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=10926"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}