{"id":10979,"date":"2022-07-06T17:32:28","date_gmt":"2022-07-06T12:02:28","guid":{"rendered":"https:\/\/www.cry.org\/?p=10979"},"modified":"2022-07-18T11:08:58","modified_gmt":"2022-07-18T05:38:58","slug":"invisibles-a-day-in-my-life-peeking-through-the-lives-in-an-urban-slum-in-lucknow-uttar-pradesh","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/invisibles-a-day-in-my-life-peeking-through-the-lives-in-an-urban-slum-in-lucknow-uttar-pradesh\/","title":{"rendered":"Invisibles: A Day In My Life Peeking Through The Lives In An Urban Slum In Lucknow, Uttar Pradesh"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"534\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/invisibles-a-day-in-my-life-peeking-through-the-lives-in-an-urban-slum-in-lucknow-uttar-pradesh.jpg\" alt=\"\" class=\"wp-image-11050\"\/><\/figure>\n\n\n\n<p>Cities are symbolic of hope. Cities offer access to multitudes of earning opportunities, possibilities to make a higher income, and a chance at a better life. It is in this pursuit of a good life that thousands of migrants from India’s villages come to the cities every year. They live and work amongst us the city dwellers, providing us with the most essential support, crucial for our daily survival. We see them around us, working as the building watchmen, our domestic help, the cab drivers, the local vegetable vendors, the plumber, the electrician, and the likes. People without whom our lives may be non-functional. But do we ever wonder who these people are? Where do they live? What are their stories? What are their struggles for a living?<\/p>\n\n\n\n<p>The city keeps on moving and so are we in pursuit of progress, reaching new milestones, oblivious to the lives of these people, the urban poor, who have a significant contribution in building our cities. But they remain unseen and unheard, living in temporary settlements by the roadside or in urban slums.<\/p>\n\n\n\n<p>Vinayakpuram slum in the heart of the Lucknow city is one such ignored space, lacking in all aspects of development. Through this photo essay, I would like to take the readers through the invisible hardships and the struggles of the slum dwellers while they continue to build our cities.<\/p>\n\n\n\n<p>It was early morning, as soon as we entered the Vinayakpuram slum in Lucknow, I got excited to see this bunch of young boys huddled together. All between the age of 8 to 10 years, intrigued in discussion between themselves, full of energy and enthusiasm. I tried initiating a conversation but was met with stiff resistance and sceptical little eyes. Until the youngest one in the group melted a bit and shared that they were playing a game of cards. Each player was supposed to invest 10 rupees and whoever won treated others with a packet of Tedhe Medhe (Kurkure) or a samosa. Their tobacco-stained teeth however suggested otherwise.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"1200\" height=\"628\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/2.jpg\" alt=\"slum in lucknow\" class=\"wp-image-10996\"\/><\/figure>\n\n\n\n<p>As we walked through the slum it was gut-wrenching to see the inhuman conditions in which the slum dwellers were living. Most of them lived in houses made of impermanent structures like bricks and bamboo sticks bereft of basic necessities like water and sanitation facilities. The residents are dependent on this filthy water both for drinking purposes as well as for washing their utensils and clothes. Without a proper drainage system and garbage all around, the slum is a breeding ground for mosquitoes and flies. Lack of adequate sanitation facilities, gives birth to life-threatening diseases especially making children susceptible to serious illnesses.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"1200\" height=\"628\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/3.jpg\" alt=\"sanitation facilities\" class=\"wp-image-10997\"\/><\/figure>\n\n\n\n<p>Living through a global pandemic, we have realised the need and importance of living in well-ventilated houses as well as ensuring enough social distancing as our armour against this dreaded infectious virus. However, experiencing a day in a slum like Vinayakpuram leaves one appalled. A dingy cramped one-room is what the slum dwellers have in the name of a home. With no window for light to enter and no ventilation facilities, it is the sole space where on an average 5 to 6 people live, eat, sleep and breathe on a day-to-day basis. Their motley belongings are dumped in one corner of the same room, wherein the television is perhaps the tranquilizer to escape the harsh realities of life.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"1200\" height=\"650\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/4.jpg\" alt=\"working children\" class=\"wp-image-10998\"\/><\/figure>\n\n\n\n<p>‘On good days I make around Rs.250. I am the sole earning member of the family. It is barely enough to put food in the mouths of my seven-member family.’ shared one of the slum dwellers who is a rickshaw puller by profession. It is a hand-to-mouth existence for nearly all the families here. As a scapegoat of poverty, childhood is sacrificed since little children are pushed into labour to be the extra earning hand for the family. They are also often thrust with familial responsibilities like managing household chores or taking care of younger siblings as the guardians migrate to nearby towns or the far end of the city in search of better livelihood opportunities.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"1200\" height=\"628\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/5.jpg\" alt=\"Children activity\" class=\"wp-image-10999\"\/><\/figure>\n\n\n\n<p>In a corner of the slum, two little children were busy playing a game of their own. Content with their toy which happens to be a pair of forsaken clothes and a handful of sand. A self-invented game that has no rules. Born and brought up in extreme poverty and deprivation, it is so heart-warming to see the power of imagination intact in children and them eking out moments of joy in a life filled with hardships.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"1200\" height=\"1000\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/6.jpg\" alt=\"poverty \" class=\"wp-image-11000\"\/><\/figure>\n\n\n\n<p>It didn’t take much longer to find acceptance amongst the children of the Vinayakpuram slum. As we immersed ourselves in conversation, both sides made genuine attempts to know about each other’s whereabouts and about day-to-day living. Though it felt gloomy looking at the melancholic living conditions of the slum dwellers but those moments of interaction with the little ones, gave me hope. Their voices brimming with joy and dreams.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"1200\" height=\"628\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/8-1.jpg\" alt=\"Children studying in the child activity centre\" class=\"wp-image-11001\"\/><\/figure>\n\n\n\n<p>Children studying in the child activity centre set up by CRY in the slum. Children love coming to the centre. A space that not only accepts them but also gives them a chance to express themselves. Besides imparting joyful learning to the children through theatre and art at the centre, life skill education is also an integral part, the purpose of which is to build the confidence of the children, enable them to speak up against any kind of child rights violations.<\/p>\n\n\n\n<p>The larger outcome and impact is focused on improving educational status to ensure equal opportunities, break the intergenerational cycle of deprivation, illiteracy, and poverty; and promote equality and social justice.<\/p>\n\n\n\n<p>The early days are already showing positive signs as the children love coming to this space where they can just be themselves. While the community is warming up to the belief that educating their children could be the path to a better and dignified life.<\/p>\n\n\n\n<p>CRY stands on the belief of our founder Mr.Rippan Kapur, ‘What We Can Do, We Must Do’. And with this belief over the last 43 years, we have been working with the most marginalised of communities, with children at the core of all our intervention strategies. Our attempt is to create a just society standing on the foundation of happy &amp; healthy childhoods.<\/p>\n\n\n\n<p>Written By:<\/p>\n\n\n\n<p>Soha Moitra<\/p>\n\n\n\n<p>Regional Director,CRY<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Cities are symbolic of hope. Cities offer access to multitudes of earning opportunities, possibilities to make a higher income, and a chance at a better life. It is in this pursuit of a good life that thousands of migrants from India’s villages come to the cities every year. They live and work amongst us the [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[13],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10979"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=10979"}],"version-history":[{"count":6,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10979\/revisions"}],"predecessor-version":[{"id":11053,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/10979\/revisions\/11053"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=10979"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=10979"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=10979"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}