{"id":11031,"date":"2022-07-13T12:20:54","date_gmt":"2022-07-13T06:50:54","guid":{"rendered":"https:\/\/www.cry.org\/?p=11031"},"modified":"2022-07-18T11:08:44","modified_gmt":"2022-07-18T05:38:44","slug":"lets-join-hands-to-discontinue-the-practice-of-child-marriage-in-india","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/lets-join-hands-to-discontinue-the-practice-of-child-marriage-in-india\/","title":{"rendered":"Let&#8217;s Join Hands To Discontinue The Practice Of Child Marriage In India"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"534\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/lets-join-hands-to-discontinue-the-practice-of-child-marriage-in-india.jpg\" alt=\"\" class=\"wp-image-11051\"\/><\/figure>\n\n\n\n<p>According to UNICEF 2014, 1 of 3 child brides in the world is from India. One of the most common types of exploitation and sexual abuse is child marriage, especially in the case of girls under the age of 18. In varying degrees, this practice can be seen in all Indian states but Rajasthan, Madhya Pradesh, Bihar, Uttar Pradesh, Jharkhand, Haryana, Karnataka, Andhra Pradesh, and Tamil Nadu have more severe numbers of such cases. The goal of CRY, India’s most trusted NGO, is to work with the community to eradicate the practice as well as ensure children attend school rather than get married off or bear children of their own too soon.<\/p>\n\n\n\n<p>Millions of young girls from marginalised communities have had their goals derailed due to the deep-rooted issue of child marriage and early motherhood. These two social evils continue to be practised across the country in both urban and rural areas. This issue is only getting worse as more young girls are married off at an early age to lessen the financial burden on the family. <a href=\"https:\/\/www.cry.org\/blog\/beating-child-marriage-in-covid-times\/\"><u>Child marriage in India<\/u><\/a>&nbsp;is practised more aggressively in recent years due to the loss of livelihoods throughout the ongoing crisis of the pandemic.<\/p>\n\n\n\n<p>According to Census 2011, India has over 12 million married children, out of which 70% are girls. Children who marry young are denied their fundamental rights, like good health and nutrition, access to regular education, and freedom from abuse and exploitation. This is a gross violation of their birthright which makes them even more vulnerable. Many underprivileged children continue to be trapped in the vicious cycle of poverty which adversely hinders their wholesome development. From the current generations to the future ones, all children are attacked due to this illegal practice but it is time we<a href=\"https:\/\/www.cry.org\/why-children\/\"><u>&nbsp;protect children’s rights<\/u><\/a>.<\/p>\n\n\n\n<p>At CRY, we have been working to address this social evil by carrying out online counselling sessions with adolescent girls, connecting parents with MNREGA job opportunities, planning home visits to high-risk homes, raising awareness of the negative effects of child marriage among Panchayat leaders and VCPC members, tracking potential cases of impending child marriages and getting help from the police to stop them, ensuring that girls can return to school after the lockdown, and more. In 2021-22, CRY protected 58,427 adolescent girls, between 11-18 years in CRY project areas, from child marriage.<\/p>\n\n\n\n<p>With your generous support, this serious issue can be given more resources and much-needed intervention. Donate to CRY, the&nbsp;<a href=\"https:\/\/www.cry.org\/\"><u>best NGO in India<\/u><\/a>, to help prevent child marriage among disadvantaged girls. Your contribution can give India&#8217;s daughters a chance for a better future. Donate to CRY now!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>According to UNICEF 2014, 1 of 3 child brides in the world is from India. One of the most common types of exploitation and sexual abuse is child marriage, especially in the case of girls under the age of 18. In varying degrees, this practice can be seen in all Indian states but Rajasthan, Madhya [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11031"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=11031"}],"version-history":[{"count":4,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11031\/revisions"}],"predecessor-version":[{"id":11052,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11031\/revisions\/11052"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=11031"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=11031"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=11031"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}