{"id":11325,"date":"2022-08-31T18:51:49","date_gmt":"2022-08-31T13:21:49","guid":{"rendered":"https:\/\/www.cry.org\/?p=11325"},"modified":"2022-09-15T12:22:22","modified_gmt":"2022-09-15T06:52:22","slug":"your-donation-can-protect-indias-children-from-child-marriage","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/your-donation-can-protect-indias-children-from-child-marriage\/","title":{"rendered":"Your Donation Can Protect India&#8217;s Children From Child Marriage"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full\"><img width=\"1200\" height=\"628\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/Protect-Indias-Children-From-Child-Marriage.jpg\" alt=\"Protect India's Children From Child Marriage\" class=\"wp-image-11326\"\/><\/figure>\n\n\n\n<p>India has about 12 million married children, 70% of whom are girls, according to Census 2011. For many generations,&nbsp;<a href=\"https:\/\/www.cry.org\/blog\/beating-child-marriage-in-covid-times\/\"><u>child marriage in India<\/u><\/a>&nbsp;has been a common practice. It is a widespread problem that is still present in many communities in both urban and rural areas. Children who marry young are denied their fundamental rights, such as good health and nutrition, access to regular education, and freedom from abuse and exploitation. It is a flagrant breach of their rights, thus swift action is the need of the hour, now more than ever.<\/p>\n\n\n\n<p>This societal evil is illegal, but it has persisted for many generations. Innumerable girls from marginalised communities are prevented from achieving their ambitions due to challenges like child marriage and early motherhood. It is a severe and unfathomable loss of not only their childhood but also their chances for a positive and prosperous future. Child marriage has long-lasting repercussions on a person&#8217;s health, educational opportunities, and varied other prospects in life. Child marriage has deep-rooted, intergenerational effects that worsen in impoverished environments; putting future generations at risk in addition to the direct victims.<\/p>\n\n\n\n<p>We, at CRY, have been working tirelessly to address the issue by connecting parents with MNREGA job opportunities, conducting online counselling sessions with adolescent girls, and planning home visits to high-risk homes. CRY&#8217;s on-ground teams have also been raising awareness of the negative effects of child marriage among Panchayat leaders and VCPC members, tracking potential cases of impending child marriages, and getting help from the police to stop them. Our continuous aim is to ensure girls are able to go to school and receive a quality education.<\/p>\n\n\n\n<p>But without your help, NGO CRY can&#8217;t accomplish this. Donate to CRY to help prevent child marriage among disadvantaged girls. We must join hands as a nation to ensure girls attend school instead of becoming child brides and shouldering early motherhood. Let’s give India&#8217;s daughters a chance for a better by making a generous donation to CRY, the most trusted NGO in India, for their overall development and welfare. You can also avail of an&nbsp;<a href=\"https:\/\/www.cry.org\/blog\/invest-in-the-future-of-indias-children-and-avail-income-tax-exemption\/\"><u>income tax exemption<\/u><\/a>&nbsp;under Section 80G of the Income Tax Act. Donate to CRY now!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>India has about 12 million married children, 70% of whom are girls, according to Census 2011. For many generations,&nbsp;child marriage in India&nbsp;has been a common practice. It is a widespread problem that is still present in many communities in both urban and rural areas. Children who marry young are denied their fundamental rights, such as [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11325"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=11325"}],"version-history":[{"count":2,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11325\/revisions"}],"predecessor-version":[{"id":11421,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11325\/revisions\/11421"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=11325"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=11325"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=11325"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}