{"id":11386,"date":"2022-09-12T18:07:37","date_gmt":"2022-09-12T12:37:37","guid":{"rendered":"https:\/\/www.cry.org\/?p=11386"},"modified":"2022-09-15T12:21:53","modified_gmt":"2022-09-15T06:51:53","slug":"heres-chandinis-journey-of-becoming-a-paramilitary-cadet","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/heres-chandinis-journey-of-becoming-a-paramilitary-cadet\/","title":{"rendered":"Here&#8217;s Chandini&#8217;s Journey Of Becoming A Paramilitary Cadet"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"534\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/Chandinis-blog.jpg\" alt=\"Chandini\" class=\"wp-image-11387\"\/><\/figure>\n\n\n\n<p>“I have grown up with a lot of dreams in my eyes &#8211; the most important one being standing on my own feet and earning respect for my family.”<\/p>\n\n\n\n<p>Hailing from a small village in Rajgarh (Madhya Pradesh), Chandni belongs to the Bedia community – a community that encourages its women to take up the sex trade to support their family’s income. The sex trade is a century-old practice in this community; one that initially started as a means of survival. However even today, estimates suggest that over 70% of families in this community continue to survive solely on income from commercial sex work.&nbsp;Young girls in such families are groomed to take this profession on during childhood itself and are pushed into it as soon as they reach puberty. The men remain unemployed; assuming the role of pimps instead.<\/p>\n\n\n\n<p>Chandni’s family was no different. With many mouths to feed, her three aunts as well as her elder sister had also been compelled to get into the sex trade. A fate Chandni dreaded; because her dream was to complete her education and become someone her family could be proud of one day. She was good at studies but with no one to help her with her lessons at home, she started to fall behind. CRY project Samvedna became aware of her situation and immediately decided to intervene. The project staff counselled her parents for over a month, making several home visits to try and convince them to continue her education. Finally, Chandni was enrolled in CRY’s remedial classes that not only helped her catch up with her studies but also groomed her to pass her 10th-grade exams with flying colours!<\/p>\n\n\n\n<p>Even though her village didn’t have a senior secondary school, Chandni was enrolled in a school with hostel facilities in Bhopal in a bid to allow her to continue her higher education. When she was studying in 12th standard, she was introduced to a government scheme, by one of her teachers, that ensured a 30% reservation for girls in India’s paramilitary forces. She immediately signed up to give the physical and written examinations – it was truly a moment of pride for her parents when she cleared both!<\/p>\n\n\n\n<p>Today, Chandni is pursuing her training and moving towards becoming a paramilitary officer – the first girl in her village to do so. A small example of what India’s children are truly capable of if given the right opportunity at the right time!<\/p>\n\n\n\n<p>Let us come together to&nbsp;<a href=\"https:\/\/www.cry.org\/blog\/importance-of-girl-child-education-in-india\/\">help India&#8217;s girls continue their education<\/a>&nbsp;and pave their way to a brighter future.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/www.cry.org\/donation\/\">Donate to CRY<\/a> today.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“I have grown up with a lot of dreams in my eyes &#8211; the most important one being standing on my own feet and earning respect for my family.” Hailing from a small village in Rajgarh (Madhya Pradesh), Chandni belongs to the Bedia community – a community that encourages its women to take up the [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[27],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11386"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=11386"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11386\/revisions"}],"predecessor-version":[{"id":11420,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11386\/revisions\/11420"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=11386"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=11386"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=11386"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}