{"id":11398,"date":"2022-09-14T14:19:23","date_gmt":"2022-09-14T08:49:23","guid":{"rendered":"https:\/\/www.cry.org\/?p=11398"},"modified":"2022-09-15T12:23:33","modified_gmt":"2022-09-15T06:53:33","slug":"support-crys-effort-to-end-period-shame-and-help-indias-girls-live-freely","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/support-crys-effort-to-end-period-shame-and-help-indias-girls-live-freely\/","title":{"rendered":"Support CRY’s Effort To End Period Shame And Help India’s Girls Live Freely"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"534\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/Help-Indias-Girls.png\" alt=\"Help India’s Girls\" class=\"wp-image-11399\"\/><\/figure>\n\n\n\n<p>In our society, shame, stigma, and false knowledge regarding periods prevent young girls and women from discussing it openly, leaving them subject to gender discrimination, marginalisation, and health problems. It is time we end the silence around this topic and start discussing it more openly.<\/p>\n\n\n\n<p>Below are some of the questions that must be raised and addressed to help break the taboo surrounding periods:<\/p>\n\n\n\n<p><strong>What is period shame?<\/strong><strong><\/strong><\/p>\n\n\n\n<p>52% of girls are unaware of menstruation until they get it themselves* (*Source:&nbsp;ncbi.nlm.nih.gov). This is because there isn&#8217;t enough awareness around menstruation which is a perfectly normal body function and unrelated to shame. According to a BMJ Article, 24% of girls miss one or more school days due to their periods. This is due to a variety of factors, including physical discomfort, a lack of water, and hygiene facilities in school restrooms, the expectation to adhere to stringent social norms, fear of staining etc. Young girls shouldn&#8217;t be held back because of the prejudice and exclusion associated with menstruation that persists in our culture. To lessen the stigma associated with periods, we must build stronger support systems for girls across the country.<\/p>\n\n\n\n<p><strong>Why do we need to break the silence around periods?<\/strong><strong><\/strong><\/p>\n\n\n\n<p>We need to break the silence around periods because a lack of facilities routinely pushes young girls to miss their classes and eventually stop going to school, thus putting an indefinite stop to their education. Once they quit, the girls are frequently pressured into marriage at a young age, which results in a lifelong loss of potential. And with increased dropouts, women&#8217;s participation in the workplace reduces. Particularly in terms of the psychological impact, shame, and exclusion due to the taboo, girls are pushed toward silence and suppression.<\/p>\n\n\n\n<p><strong>How we can start the conversation around periods?<\/strong><strong><\/strong><\/p>\n\n\n\n<p>It is important to have open discussions on this far-reaching topic. To address the stigma and myths associated with menstruation, open discussions on menstrual health with children and parents must be carried out in classrooms. Also, speaking up is one way to challenge social norms.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"850\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/Lets-talk-about-periods.png\" alt=\"Let’s about periods\" class=\"wp-image-11400\"\/><\/figure>\n\n\n\n<p>At CRY, we have been ensuring that schools provide vital supplies like water and toilets, and other such resources so that girls feel comfortable and supported during periods. CRY’s on-ground teams are also focusing on collaborations with schools to develop period-friendly policies and initiatives that educate people about menstruation hygiene and provide girls with a safe environment. We must raise our voices against the misconceptions and regressive ways of thinking around periods that hold the&nbsp;<a href=\"https:\/\/www.cry.org\/blog\/importance-of-girl-child-education-in-india\/\"><u>girl child in India<\/u><\/a>&nbsp;from living their lives to the fullest. Now more than ever, it is integral to identify and address social norms.<\/p>\n\n\n\n<p>To help create change, let’s <a href=\"https:\/\/www.cry.org\/lets-talk-about-periods\/\"><u>take a pledge to move past period shame<\/u><\/a>&nbsp;and all things associated with the taboo surrounding it. This may include not hiding period products and carrying them without any shame, using the word “period” instead of other code words etc. Such small yet significant steps will help us improve as a society.<\/p>\n\n\n\n<p>Your donation will enable them to realise their full potential and make a real difference in their lives. #LetsTalkAboutPeriods today and save tax on your donation by availing a 50% tax exemption on your contribution to CRY under Section&nbsp;<a href=\"https:\/\/www.cry.org\/blog\/donate-and-avail-deduction-under-section-80g-of-income-tax-act\/\"><u>80G of the Income Tax<\/u><\/a>&nbsp;Act!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In our society, shame, stigma, and false knowledge regarding periods prevent young girls and women from discussing it openly, leaving them subject to gender discrimination, marginalisation, and health problems. It is time we end the silence around this topic and start discussing it more openly. Below are some of the questions that must be raised [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[33],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11398"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=11398"}],"version-history":[{"count":2,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11398\/revisions"}],"predecessor-version":[{"id":11403,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11398\/revisions\/11403"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=11398"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=11398"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=11398"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}