{"id":11404,"date":"2022-09-14T15:06:59","date_gmt":"2022-09-14T09:36:59","guid":{"rendered":"https:\/\/www.cry.org\/?p=11404"},"modified":"2022-09-15T12:21:19","modified_gmt":"2022-09-15T06:51:19","slug":"topper-girl-kashishs-journey-from-being-a-school-dropout-to-topping-her-class","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/topper-girl-kashishs-journey-from-being-a-school-dropout-to-topping-her-class\/","title":{"rendered":"Topper Girl &#8211; Kashish&#8217;s Journey From Being A School Dropout To Topping Her Class"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full\"><img width=\"1280\" height=\"877\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/Kashish.jpg\" alt=\"Kashish\" class=\"wp-image-11405\"\/><\/figure>\n\n\n\n<p>“One of my favourite things is to sit by the window and to wait for the aeroplane to fly by. I love watching aeroplanes, how beautiful it must be that they get to see so many new places and meet so many new people. One day I will also travel to new cities. I will make lots of new friends and will have so many stories to tell. I am now staying in Tigri with my parents and my brother and sister. Our house is very small, we have only one room, where we eat, sleep, play and also study. My father is a daily wage earner and my mother works as a domestic helper in nearby houses. I often see mummy and papa sitting sadly in the house. They are always worried about money. We often do not get to eat three meals a day.<\/p>\n\n\n\n<p>I love studying. I, my brother and sister, all three of us study in the nearby Government school. But there was a time when I was irregular at school. My parents would send me to my native village to care for my ailing grandmother. I would miss school for many months and then when I would go back to attending classes, I couldn’t understand anything that the teacher would teach. I used to feel demotivated in class and eventually stopped going to school.<\/p>\n\n\n\n<p>However, meeting Urmila didi changed everything. She manages a study centre for children like me in Tigri itself. When she got to know about my situation, she first met my parents and spoke to them about the importance of education and the need to continue my studies. Initially, my parents were reluctant but after several home visits and counselling sessions with my parents, they agreed and I started going to the study centre of Urmila didi. Her team also got me enrolled at 2nd standard in the nearby Government school. I started attending the remedial classes given by Urmila didi and her team. It helped me immensely and I started performing very well in school. Even though for a few more years till my grandmother was alive, I had to miss classes for months as I had to take responsibility for her caregiving. But even then I did not fall behind in my studies due to the support provided through the remedial classes.<\/p>\n\n\n\n<p>Life continued like that for some more years, but since my grandmother passed away, I no longer have to go to my native village. I now regularly go to school and am investing wholeheartedly in my studies. I am one of the top scorers and you will find my name amongst the top ten rank holders in the class. I am in the seventh standard now and this year I came third in my class. Seeing me shine, my parents have also started taking a keen interest in not only mine but my siblings’ education as well. I have lots of dreams. I want to do something big and become someone of repute. And the best part is that my aspirations have also rubbed on to my siblings and some of my friends as well. We are all dreamers now.” – Kashish.<\/p>\n\n\n\n<p>Kashish hails from one of the slum areas of Tigri in Delhi. Kashish and her family migrated from Rajasthan years ago with hopes of better employment opportunities. The Child Activity Centre (CAC) run by CRY partner organisation Swati for underprivileged children has played a critical role in Kashish’s evolution and progress in school. Swati&#8217;s team through constant tracking of the child not only made sure that she doesn’t become a dropout but also created an enabling environment for her at the CAC centre. The joyful learning methods and the teachers helped the child pick up her studies at her own pace. Transformation of Kashish reminds us how every child has the potential to grow and flourish – all they need is the right kind of nurturing which can help them realise their dreams and become trailblazers in their capacities.<\/p>\n\n\n\n<p>Let us together support more girls like Kashish to complete their education and give them&nbsp;ample opportunities to live the life they wish for.&nbsp;<a href=\"https:\/\/www.cry.org\/donation\/\">Donate to CRY<\/a> today!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“One of my favourite things is to sit by the window and to wait for the aeroplane to fly by. I love watching aeroplanes, how beautiful it must be that they get to see so many new places and meet so many new people. One day I will also travel to new cities. I will [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[12,27],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11404"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=11404"}],"version-history":[{"count":7,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11404\/revisions"}],"predecessor-version":[{"id":11412,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11404\/revisions\/11412"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=11404"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=11404"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=11404"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}