{"id":11413,"date":"2022-09-15T12:25:09","date_gmt":"2022-09-15T06:55:09","guid":{"rendered":"https:\/\/www.cry.org\/?p=11413"},"modified":"2022-09-15T12:50:49","modified_gmt":"2022-09-15T07:20:49","slug":"lets-help-indias-children-go-back-to-school","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/lets-help-indias-children-go-back-to-school\/","title":{"rendered":"Let’s Help India’s Children Go Back To School"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full\"><img width=\"1200\" height=\"628\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/Help-Indias-Children-Go-Back-To-School.jpg\" alt=\"\" class=\"wp-image-11419\"\/><\/figure>\n\n\n\n<p>All schools were shut during the overwhelmingly difficult pandemic. But after many months of struggle, formal learning has finally resumed in schools. Unfortunately, many children who were enrolled in schools prior to the lockdown are unable to continue their education. This is because many of them dropped out during the gap when the schools were shut. As classrooms shifted to online mode, many underprivileged children could not continue learning as they didn’t have access to digital devices. Some children from marginalised communities dropped out to support their families to stay afloat during the unforeseeable effects of the pandemic. And several others were married off early to ease the financial burden, thus making it impossible for them to return to their studies.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"534\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/Indias-Children-Go-Back-To-School.png\" alt=\"\" class=\"wp-image-11417\"\/><\/figure>\n\n\n\n<p>The long gap in structured learning has made students lose interest in their studies. This is why the years to come are even more crucial to preserve and&nbsp;<a href=\"https:\/\/www.cry.org\/why-children\/\"><u>protect child rights<\/u><\/a>. It&#8217;s critical to provide integral tools and resources to get underprivileged children ready for classroom learning. This will go a long way in assisting them in continuing their education and offer them the opportunity to learn and develop many important life skills.<\/p>\n\n\n\n<p>At CRY, we are working hard to ensure that every child returns to school and reconnects with their school education to give them the necessary confidence to go #BackToSchool:<\/p>\n\n\n\n<p>• Conducting study sessions to supplement classroom learning for students using digital tablets under the supervision of qualified teachers<\/p>\n\n\n\n<p>• Besides ensuring&nbsp;<a href=\"https:\/\/www.cry.org\/blog\/non-profit-organization-that-helps-in-educating-underprivileged-children-in-india\/\"><u>child-centred education<\/u><\/a>, assisting children in expanding their minds through exposure to pertinent and useful skills and content through digital platforms<\/p>\n\n\n\n<p>• Aiding enrollment initiatives in villages to get the children in school and support their ongoing education<\/p>\n\n\n\n<p>• Carrying out creative and interactive activities like story-telling, singing, and dancing, among others, to help improve the cognitive abilities of children<\/p>\n\n\n\n<p>• Holding awareness campaigns for the parents and discussing the negative implications of dropping out of school, child marriage, child labour, and trafficking<\/p>\n\n\n\n<p>• Preventing school dropouts by ensuring that the facilities at the schools are maintained<\/p>\n\n\n\n<p>• Celebrating important days like World Environment Day, World Yoga Day etc to create awareness of different causes.<\/p>\n\n\n\n<p>• Providing guidance and career counselling to class X and XII pass-outs.<\/p>\n\n\n\n<p>Through the Bridge Learning initiative, CRY has reached 24,800 children. But we still have a long way to go to provide support classes and ensure 1,00,000 children stay in school and reimagine their future.<\/p>\n\n\n\n<p>India’s underprivileged children need our attention urgently. Your generous contribution to CRY can help them fulfil their dreams and reach their truest potential. <a href=\"https:\/\/www.cry.org\/donation\/\">Donate<\/a> for children’s education in India and give underprivileged children a chance at a brighter future!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>All schools were shut during the overwhelmingly difficult pandemic. But after many months of struggle, formal learning has finally resumed in schools. Unfortunately, many children who were enrolled in schools prior to the lockdown are unable to continue their education. This is because many of them dropped out during the gap when the schools were [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11413"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=11413"}],"version-history":[{"count":3,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11413\/revisions"}],"predecessor-version":[{"id":11425,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11413\/revisions\/11425"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=11413"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=11413"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=11413"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}