{"id":11442,"date":"2022-09-20T18:08:16","date_gmt":"2022-09-20T12:38:16","guid":{"rendered":"https:\/\/www.cry.org\/?p=11442"},"modified":"2022-09-20T18:18:13","modified_gmt":"2022-09-20T12:48:13","slug":"breaking-the-menstrual-taboo-meet-the-changemaker-lalithamma","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/breaking-the-menstrual-taboo-meet-the-changemaker-lalithamma\/","title":{"rendered":"Breaking The Menstrual Taboo. Meet The Changemaker – Lalithamma"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"534\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/Blog-Image-Lalithamma.jpg\" alt=\"Lalithamma\" class=\"wp-image-11443\"\/><\/figure>\n\n\n\n<p>Lalithamma, the founder of PORD (People’s Organization For Rural Development), has dedicated her life to spreading awareness of and eradicating issues faced by underprivileged children. One of the key areas of focus has always been menstrual hygiene and awareness. It was Lalithamma&#8217;s personal journey that prompted her to address a subject that had been taboo for many years.<\/p>\n\n\n\n<p>When Lalithamma got her first period at age 15, her initial thought was that she must be dying. Scared to bring it up with her mother, she approached her sister who assured her that she was not dying but in fact had become a ‘woman’.&nbsp;“For nine days I was asked not to participate in any of the household chores. I was barred from entering the kitchen and instead made to spend all my time in the corner of a dark room with my own utensils, a cup and plate for water and food. My bedding and clothes were also placed separately in the corner of the room”. It was an isolating experience and left Lalithamma feeling unclean and dirty.<\/p>\n\n\n\n<p>Her village followed other age-old practices; crossing a graveyard was forbidden during menstruation, as was entering a temple or mixing with family members or friends.&nbsp;&nbsp;The biggest issue the girls faced in the village was the lack of bathrooms in their school, which meant that for five or more days every girl who had reached puberty had to miss class.&nbsp;&nbsp;As a result, every pubescent girl missed almost a month and a half of school each year.<\/p>\n\n\n\n<p>Lalithamma&#8217;s personal experience made her believe menstruation needed to be discussed and that old myths and taboos need to be broken.&nbsp;With CRY’s help, Lalithamma began educating communities and girls on menstruation.&nbsp;<\/p>\n\n\n\n<p>Lalithamma and CRY successfully formed 110 children collectives in the operational areas. The child collective was trained on issues such as child marriage, child labour, menstrual hygiene and other child rights issues.&nbsp;By engaging children in local concerns close to their hearts, Lalithamma and CRY initiated door-to-door campaigns and empowered change at the grassroots level.&nbsp;<\/p>\n\n\n\n<p>As a result of the campaigns, conversations on menstruation were initiated in communities and myths and taboos were addressed, so much so that most practices are now discontinued. The girls were educated about menstrual hygiene, and Lalithamma worked with local schools to build girls&#8217; restrooms so they would not miss out on school.<\/p>\n\n\n\n<p>Lalithamma believes that the “change process” initiated at the community level needs to be sustainable so that children continue to enjoy their rights.&nbsp;&nbsp;&nbsp;<\/p>\n\n\n\n<p>Lalithamma has received the&nbsp;Bharathiya Dalith Sahithya Academy-Dr. B.R Ambhedhkar National fellowship award (2014 &amp;2015), State Best Citizen Award by Andhra Pradesh state cultural awareness society (2015) and Andhra Ratna Award by Andhra Pradesh State Cultural Awareness Society (2016). She continues to tirelessly work on child rights issues and is one of the many partners we are proud to be associated with; making a real and significant difference in the lives of children.<\/p>\n\n\n\n<p>As CRY, we hope to make sure that the lack of awareness around periods does not become a barrier to the education and learning of girls everywhere. Support CRY by making a <a href=\"https:\/\/www.cry.org\/donation\/\">donation<\/a> and helping girls and Lalithamma pave the way to a better future. <\/p>\n\n\n\n<p><a href=\"https:\/\/www.cry.org\/help-end-period-shame\/\" target=\"_blank\" rel=\"noreferrer noopener\">Let&#8217;s talk about periods<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Lalithamma, the founder of PORD (People’s Organization For Rural Development), has dedicated her life to spreading awareness of and eradicating issues faced by underprivileged children. One of the key areas of focus has always been menstrual hygiene and awareness. It was Lalithamma&#8217;s personal journey that prompted her to address a subject that had been taboo for [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[33],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11442"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=11442"}],"version-history":[{"count":2,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11442\/revisions"}],"predecessor-version":[{"id":11446,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/11442\/revisions\/11446"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=11442"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=11442"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=11442"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}