{"id":1204,"date":"2020-09-01T14:52:58","date_gmt":"2020-09-01T14:52:58","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1204"},"modified":"2022-07-18T13:05:10","modified_gmt":"2022-07-18T07:35:10","slug":"vardha-stands-against-child-marriage-during-the-pandemic","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/vardha-stands-against-child-marriage-during-the-pandemic\/","title":{"rendered":"Vardha stands against child marriage during the pandemic"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/vardha-stands-against-child-marriage-during-the-pandemic.jpg\" alt=\"Vardha From Stands Against Child Marriage\" class=\"wp-image-1530\"\/><\/figure>\n\n\n\n<p>The Coronavirus pandemic has wreaked havoc within the nation and some of the most hard-hit areas are the pockets where CRY work.<\/p>\n\n\n\n<p>Experience says that, in any disaster, the poor and the marginalized are most vulnerable; with women and children at increased risk. This pandemic has restricted our movement within our operational areas and it has been a challenge to address rising cases of child marriage and child labour that are stemming from the loss of livelihoods during the lockdown.<\/p>\n\n\n\n<p>One such case is that of Vardha*, a 17-year-old 12th grader in Chinamaroor village, Wanarpathy who was forced to drop out of school last year and join her mother in daily wage labour. When CRY was made aware of this, they counselled Vardha’s mother and spoke to the Village Child Protection Committee (VCPC) to send her back to school. She graduated in March 2020 – that’s when the COVID outbreak hit and all educational institutions shut down. Putting her plans of applying for college on hold, Vardha stayed home and helped out with household chores. <\/p>\n\n\n\n<p>When the family’s financial constraints increased, with Vardha’s mother unable to earn as much as she did before, she decided that the best thing to ease the pressure on the family was to get Vardha married. The family selected a groom and decided to conduct a small engagement ceremony at home. <\/p>\n\n\n\n<p>Vardha, who has been a part of CRY project SVK’s children’s collectives, knew exactly what she had to do. She reached out to the local Anganwadi teacher and informed her about the situation at home. The teacher, who is also a member of the VCPC, got in touch with the rest of the committee. The members then gathered at Vardha’s house on the day of the engagement and counselled both sets of families on the health and legal issues involved in child marriage. Having convinced them of the ill-effects, the wedding has now been postponed until both children are of age. <\/p>\n\n\n\n<p>The Nedan Foundation filed a Public Interest Litigation in Guwahati High Court to ensure that the anti-human trafficking unit of the police should be operationalized. This went on to become a movement for prevention, rescue and rehabilitation of trafficked children, especially girls. The foundation also runs a children’s home for girls who don’t have families, and the girls are supported till their graduation. They are also offered jobs with the foundation if they show interest in becoming community mobilisers. <\/p>\n\n\n\n<p>Making child protection systems institutionalised in relief camps was the biggest challenge faced by the foundation in their endeavour. Only relentless advocacy was a strategy that worked. “It took nearly 10 years to mobilise compensation for trafficked victims” he says. “We are also mobilizing for every district to have a children’s home funded by the state”. <\/p>\n\n\n\n<p>Today, Nedan Foundation is a well-reputed child protection organization that works in more than 600+ villages against child trafficking, mostly displaced forest villages of tribal communities. “The NCRRF Fellowship gave our work a massive push,” says Digambar. <\/p>\n\n\n\n<p>VCPCs are a special provision created by the government for the protection of child rights at the village level. In 2017, during interactions with the various communities that CRY works with, we realized that these mechanisms were barely functional and most members were unaware of what their roles and responsibilities were. The project team then took it upon themselves to create proactive and functional VCPCs. Initially, the team played a vital role in conducting regular meetings, explaining the roles and responsibilities of each committee member and ensuring that the VCPC were working efficiently in the village. Once activated, CRY staff then created awareness about the VCPCs within the community and also involved two active children from each of the children’s collectives who could relay the issues faced by children themselves to the committee regularly. <\/p>\n\n\n\n<p>46 VCPCs have been activated in Wanarpathy, Telangana with 552 members; of which 92 are members of CRY children’s collectives. In such difficult times, when mobility from one village to another is restricted, VCPCs play a very important role in safeguarding the rights of children in their communities.<\/p>\n\n\n\n<p><strong>If you’d like to contribute towards our efforts in ensuring children survive and thrive in a COVID world, just make a <a href=\"\/donation\/\">donation to CRY<\/a>.<\/strong><\/p>\n\n\n\n<p>*name changed to protect the child&#8217;s identity<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Coronavirus pandemic has wreaked havoc within the nation and some of the most hard-hit areas are the pockets where CRY work. Experience says that, in any disaster, the poor and the marginalized are most vulnerable; with women and children at increased risk. This pandemic has restricted our movement within our operational areas and it [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1204"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1204"}],"version-history":[{"count":10,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1204\/revisions"}],"predecessor-version":[{"id":3541,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1204\/revisions\/3541"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1204"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1204"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1204"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}