{"id":1209,"date":"2020-09-01T15:48:36","date_gmt":"2020-09-01T15:48:36","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1209"},"modified":"2022-07-18T13:04:56","modified_gmt":"2022-07-18T07:34:56","slug":"beating-child-marriage-in-covid-times","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/beating-child-marriage-in-covid-times\/","title":{"rendered":"Beating Child Marriage in India in COVID Times"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/beating-child-marriage-in-covid-times.jpg\" alt=\"child marriage in India\" class=\"wp-image-1526\"\/><\/figure>\n\n\n\n<p>When 14-year-old Viji* returned home from the welfare hostel she would stay at to be able to attend school, she was overjoyed at the thought of spending time with her mother. The country was in the midst of a pandemic but to Viji, it was an opportunity to be with her family. But when she reached her home in Bathinaiah Colony in Chittoor, things took a sharp turn.<\/p>\n\n\n\n<p>Having lost her father a couple of years ago, Viji’s mother worked as a daily wage laborer to make ends meet. But when the government imposed the nationwide lockdown, she only got 4 days of work as opposed to the usual 20 days; which left the family penniless. That’s when a relative suggested that she get Viji married to a 26-year-old man who was mentally challenged – owing to which, the man’s family was ready to forego the common practice of dowry and also foot all the wedding expenses. When she resisted the proposal, the relative reminded her that at least Viji would be “settled”. Unable to think of any other solution, she obliged and they began preparations for the wedding.<\/p>\n\n\n\n<p>When Viji came to know of this, she vehemently opposed the idea her pleas fell on deaf ears. Around the same time, an Anganwadi worker in the village noticed her mother having discussions with the groom’s family and conducting small shopping trips to the nearby town. It aroused her suspicion and she secretly got in touch with Viji who confirmed that she was to get married. An active member of the CRY children’s collective, Viji was well aware that what was happening with her was illegal and could be stopped with the right support. She requested that Anganwadi worker to get in touch with the team at CRY project Pragathi.<\/p>\n\n\n\n<p>As soon as they came to know of Viji’s plight, the project team traveled to her village, mobilized the police and community-based organization (CBO) members and counseled her mother about the consequences of her actions and took a written agreement from her which stated that she would not attempt to get Viji married till she attained legal age. They also contacted the groom’s family and threatened them with stringent actions as per the Prohibition of Child Marriage Act.<\/p>\n\n\n\n<p>Viji is extremely relieved at the turn of events. “Being a member of the CRY children’s collective, I know my rights and the consequences of child marriage. I, therefore, rejected the marriage proposal but my mother and relatives were forcing me into it. When I reached out to CRY, the project team didn’t fail me”.<\/p>\n\n\n\n<p>Says Bharathi, a police constable who was involved in the intervention, “People are taking advantage of the lockdown restrictions. They think that the officers of the concerned department may not reach them since they are preoccupied with pandemic control. During the lockdown, parents don’t need to invite many relatives or arrange the wedding in public places such as temples and halls. So, what they do is solemnize the marriage within the four walls of their house and this intervention is the perfect example of how even in these tough times, we can still work toward preventing such violations.”<\/p>\n\n\n\n<p><strong>If you’d like to contribute towards our efforts in ensuring children survive and thrive in a COVID world, just make a <a href=\"https:\/\/www.cry.org\/donation\/\">donation<\/a> to CRY.<\/strong><\/p>\n\n\n\n<p>*name changed to protect the child&#8217;s identity<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When 14-year-old Viji* returned home from the welfare hostel she would stay at to be able to attend school, she was overjoyed at the thought of spending time with her mother. The country was in the midst of a pandemic but to Viji, it was an opportunity to be with her family. But when she [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[5,17],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1209"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1209"}],"version-history":[{"count":9,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1209\/revisions"}],"predecessor-version":[{"id":8531,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1209\/revisions\/8531"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1209"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1209"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1209"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}