{"id":1221,"date":"2020-09-02T06:20:15","date_gmt":"2020-09-02T06:20:15","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1221"},"modified":"2022-07-18T11:23:35","modified_gmt":"2022-07-18T05:53:35","slug":"underprivileged-childrens-health-at-higher-risk-due-to-the-pandemic","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/underprivileged-childrens-health-at-higher-risk-due-to-the-pandemic\/","title":{"rendered":"Underprivileged children’s health at higher risk due to the pandemic"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/underprivileged-childrens-health-at-higher-risk-due-to-pandemic.jpg\" alt=\"Underprivileged children’s health\" class=\"wp-image-1520\"\/><\/figure>\n\n\n\n<p>Underprivileged children in India are the unseen victims of the Coronavirus pandemic. They are bearing the brunt of the immediate as well as the long-term damage that COVID-19 is causing. The closure of government healthcare centres, suspension of the school midday meal scheme, loss of family income during the lockdown has exacerbated the problem of malnutrition in India.<\/p>\n\n\n\n<p>At 48.2 million*, India had the highest number of malnourished children in the world even before the crisis. This number is likely to increase over the next few months. A recent study shows that 3 lakh* children may die of malnutrition in the next 6 months. (*Source: UNICEF)<\/p>\n\n\n\n<p>All children deserve a healthy childhood where they receive timely immunizations, access to healthcare facilities, adequate nutrition and proper monitoring and care. But the lack of such resources results in children suffering from recurring diseases, stunted growth, and in extreme cases, even death. In the current situation, lowered immunity is a serious area of concern among underprivileged children as they face an acute shortage of necessary utilities and hygiene supplies.<\/p>\n\n\n\n<p>We, at CRY, have jumped into action to ensure that the communities we serve receive the integral resources they need and stay protected. We have been ensuring that regular vaccinations are provided to children to avoid their susceptibility to other deadly diseases. We have been providing timely care to lactating and pregnant mothers. We’ve been addressing menstrual hygiene and anaemia amongst adolescent girls and particularly been tackling the severe issue of malnutrition as well to reduce the rate of infant\/child mortality. We have also been distributing dry rations (salt, potatoes, soy chunks, cereal, dal, sugar, oil etc) and hygiene kits (face masks, sanitizers, gloves, sanitary napkins, soaps etc) to several underprivileged children and their families, in addition to providing protective gear and disinfectant supplies to government healthcare workers.<\/p>\n\n\n\n<p><strong>You can also help making a donation to CRY, recognized as <a href=\"\/\">India’s Most Trusted NGO<\/a>. Make a difference today!<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Underprivileged children in India are the unseen victims of the Coronavirus pandemic. They are bearing the brunt of the immediate as well as the long-term damage that COVID-19 is causing. The closure of government healthcare centres, suspension of the school midday meal scheme, loss of family income during the lockdown has exacerbated the problem of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[15],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1221"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1221"}],"version-history":[{"count":6,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1221\/revisions"}],"predecessor-version":[{"id":3539,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1221\/revisions\/3539"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1221"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1221"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1221"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}