{"id":1223,"date":"2020-09-02T06:54:24","date_gmt":"2020-09-02T06:54:24","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1223"},"modified":"2022-07-18T12:34:38","modified_gmt":"2022-07-18T07:04:38","slug":"crys-response-to-the-coronavirus-crisis-in-india","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/crys-response-to-the-coronavirus-crisis-in-india\/","title":{"rendered":"CRY’s response to the Coronavirus crisis in India"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/crys-response-to-the-coronavirus-crisis-in-india.jpg\" alt=\"CRY’s response to the Coronavirus crisis\" class=\"wp-image-1518\"\/><\/figure>\n\n\n\n<p>Dear CRY Supporters,<\/p>\n\n\n\n<p>We hope that you and your families are staying home and staying safe from COVID-19.<\/p>\n\n\n\n<p>As a public health emergency of international concern, the Coronavirus outbreak is posing a serious challenge for India’s citizens and CRY has taken stringent measures (as per mandated government advisories) to reduce the risk of spreading the infection. This includes remote working protocols for employees, advising proper hygiene measures, postponing all upcoming events indefinitely and strongly discouraging the dissemination of unverified rumours on social media. <\/p>\n\n\n\n<p>Our leadership team will closely monitor the situation, take informed decisions based on updated advisories shared by the World Health Organization (WHO) and the Ministry of Health and Family Welfare (MoHFW) and ensure that all employees, partners and volunteers are kept abreast of the same. Any dissemination of public health information on the subject or promotion of best hygiene practices will be based solely on guidelines shared by WHO and MoHFW.<\/p>\n\n\n\n<p>However, our bigger focus continues to be on the marginalized communities we serve. We’ve been working with vulnerable children and communities for over 4 decades and are currently trying to do everything we can to keep them safe from this pandemic.<\/p>\n\n\n\n<p>We’ve put together a hygiene kit that’ll be given to the families of over 3.5 lakh children in villages across India. This kit includes hand wash soaps, cotton scarves to serve as face masks and information brochures that explain preventive measures against COVID-19. With social distancing protocols in place, we’ve also included some toys to help children stay engaged while quarantined at home.<\/p>\n\n\n\n<p>Since the on-going nationwide lockdown has severely affected the livelihoods of these marginalized communities, we will also be providing a packet of dry rations to over 1.76 lakh underprivileged households across India. This will include cereal, dal, oil, sugar, soy chunks and peanuts that will last them a month to help ensure basic nutrition for the children and their family members. <\/p>\n\n\n\n<p>In addition to this, we’ll be spreading awareness amongst our communities on the importance of hand washing practices along with other necessary precautions and information about available medical facilities. Everything will be in accordance with the government protocols and with all necessary permissions.<\/p>\n\n\n\n<p>In such time of crisis, we need your help now more than ever. If you can contribute to support our efforts to protect the children who need it the most, please <a href=\"\/keep-underprivileged-children-safe\/\">click here to donate<\/a>. If you’ve already donated and have not received a receipt – please bear with us; our backend operations have been impacted and there may be a delay in processing donations and sending receipts.<\/p>\n\n\n\n<p>May these challenging times come to an end soon and may we rise together as a community that has taken care of each other.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dear CRY Supporters, We hope that you and your families are staying home and staying safe from COVID-19. As a public health emergency of international concern, the Coronavirus outbreak is posing a serious challenge for India’s citizens and CRY has taken stringent measures (as per mandated government advisories) to reduce the risk of spreading the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[15,13],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1223"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1223"}],"version-history":[{"count":7,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1223\/revisions"}],"predecessor-version":[{"id":11082,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1223\/revisions\/11082"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1223"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1223"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1223"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}