{"id":1225,"date":"2020-09-02T07:50:02","date_gmt":"2020-09-02T07:50:02","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1225"},"modified":"2022-07-18T13:04:04","modified_gmt":"2022-07-18T07:34:04","slug":"have-questions-about-the-coronavirus-outbreak","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/have-questions-about-the-coronavirus-outbreak\/","title":{"rendered":"Have questions about the Coronavirus outbreak?"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/crys-response-to-the-coronavirus-crisis-in-india.jpg\" alt=\"Coronavirus outbreak\" class=\"wp-image-1518\"\/><\/figure>\n\n\n\n<p>As the world struggles with the COVID-19 outbreak, also known as Coronavirus, many of us have questions on how to stay safe and how we can prevent the spread of the disease.  Children, in particular, need extra care and attention during such difficult times to understand the situation and act more responsibly. Read on to know more about some frequently asked questions regarding the pandemic and how you can protect children during such times of crisis.<\/p>\n\n\n\n<p><strong>Is it safe for my child to go out in public spaces and\/or use public transportation?<\/strong><\/p>\n\n\n\n<p>No – it’s not safe to either visit public spaces or use public transportation so please ensure that they stay at home.<\/p>\n\n\n\n<p>Encourage your child to respect the lockdown and maintain social distancing for their safety as well as the safety of others. In case they need to venture outside, ask them to maintain a safe distance of at least 3 feet from other people.<\/p>\n\n\n\n<p><strong>What are the signs and symptoms of a COVID-19 infection? How will I know my child has been infected with the coronavirus and not just the ordinary flu?<\/strong><\/p>\n\n\n\n<p>The most common symptoms of COVID-19 are fever, tiredness, body ache and a dry cough. Some patients may also suffer from nasal congestion, sore throat and diarrhoea. All these symptoms are very similar to the ordinary flu so if your child develops one or more of these, inform public healthcare officials immediately by calling the Government of India’s 24×7 helpline at 011-23978046.<\/p>\n\n\n\n<p><strong>What should I do if I suspect that my child has been infected with COVID-19?<\/strong><\/p>\n\n\n\n<p>Please do not panic and contact the Government of India’s 24×7 helpline at 011-23978046. The helpline service will note down your contact details and get in touch with you to explain the testing protocols for COVID-19. If your child qualifies as a case for testing as per the protocol, they will be tested at a government-approved lab only.<\/p>\n\n\n\n<p><strong>Will regular antibiotics help protect my child from the COVID-19 virus?<\/strong><\/p>\n\n\n\n<p>No – antibiotics are used to treat bacterial infections only. They cannot be used to treat or prevent COVID-19 since it’s a viral infection. So do not self-prescribe them to your child before getting them tested and without a doctor’s advice.<\/p>\n\n\n\n<p><strong>Will home remedies help prevent my child from getting infected with COVID-19?<\/strong><\/p>\n\n\n\n<p>While many home remedies can help boost immunity, there is no scientific evidence that they can help in curing the infection. Please rely on a doctor’s advice only.<\/p>\n\n\n\n<p><strong>What is the cure for COVID-19?<\/strong><\/p>\n\n\n\n<p>There is no cure or vaccine against the Coronavirus yet. However, scientists around the world are working round the clock to find a preventative vaccine as well as a cure – WHO will keep providing updates. In the meantime, prevention is the best cure. Encourage your child to wash their hands frequently for at least 20-40 seconds, cover their mouth when they sneeze or cough, stay at home and maintain a distance of at least 3 feet from other people at all times.<\/p>\n\n\n\n<p><strong>Can my child catch the infection from our pet?<\/strong><\/p>\n\n\n\n<p>There is no concrete evidence yet of animals, including pets like dogs, either being infected or being carriers of the coronavirus. COVID-19 is mainly spread through infected droplets produced when an infected person coughs, sneezes, or speaks. However, to stay safe since this information is still evolving, avoid direct contact with stray animals as much as possible. If you’re a non-vegetarian, handle raw meat, eggs and milk with care and avoid consuming raw or undercooked animal products.<\/p>\n\n\n\n<p><strong>Would bathing my child with hot water help prevent infection?<\/strong><\/p>\n\n\n\n<p>While regular bathing is good for hygiene, extreme hot or cold temperatures do not kill the COVID-19 virus and so, neither prevent nor cure the infection. In fact, taking a bath with extremely hot water can burn your child. The best way to protect them against COVID-19 is by encouraging them to maintain good hygiene.<\/p>\n\n\n\n<p><strong>Will a face mask help keep my child safe from the virus?<\/strong><\/p>\n\n\n\n<p>Wearing a face mask helps prevent the spread of the virus but it is not a fool proof method. Ensure that your child regularly washes their hands for at least 20-40 seconds at regular intervals and avoids touching their face unnecessarily. If using masks, ensure that your child washes their hands before putting it on and does not reuse single-use masks. To remove the mask, ensure that they do so from behind (without touching the front of the mask), discard it immediately in a closed bin and then wash their hands.<\/p>\n\n\n\n<p><strong>Is COVID-19 fatal?<\/strong><\/p>\n\n\n\n<p>COVID-19 could be fatal, if not identified and treated in time but the information available so far suggests that about 80% of those infected recover from the disease without needing intensive treatment. The infection is generally mild for children and young adults. Older people and those with underlying medical problems like high blood pressure, heart problems or diabetes are more likely to develop the infection as a serious illness. But that’s not to say that children are immune to infection so ensure that they take all precautions to stay safe.<\/p>\n\n\n\n<p><strong>How do I keep my child informed about the situation without alarming them?<\/strong><\/p>\n\n\n\n<p>Children will have questions about the outbreak. Explain what is going on, share facts in an easy-to-understand manner and give them clear information about how to keep themselves safe from the infection. Be reassuring at all times!<\/p>\n\n\n\n<p><strong>How should I respond if my child is feeling anxious about falling sick?<\/strong><\/p>\n\n\n\n<p>Children respond to stress in different ways. They can become clingy, anxious, irritable and angry. Be supportive, listen to them, speak to them kindly and reassure them that everything will be okay. Stick to a routine as much as possible for studying, playing and relaxation. This will help instil a sense of security in your child. Communicating with children and helping them cope with the difficult times is the need of the hour. With love and patience, children can be heard and reassured delicately, to guide them and look after them in the best possible manner.<\/p>\n\n\n\n<p>*Adapted from WHO guidelines<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As the world struggles with the COVID-19 outbreak, also known as Coronavirus, many of us have questions on how to stay safe and how we can prevent the spread of the disease. Children, in particular, need extra care and attention during such difficult times to understand the situation and act more responsibly. Read on to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[13],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1225"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1225"}],"version-history":[{"count":10,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1225\/revisions"}],"predecessor-version":[{"id":3522,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1225\/revisions\/3522"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1225"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1225"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1225"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}