{"id":1271,"date":"2020-09-02T17:15:20","date_gmt":"2020-09-02T17:15:20","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1271"},"modified":"2022-07-18T13:02:13","modified_gmt":"2022-07-18T07:32:13","slug":"becoming-a-champion-for-childrens-rights","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/becoming-a-champion-for-childrens-rights\/","title":{"rendered":"Becoming a champion for children&#8217;s rights!"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"1032\" height=\"477\" src=\"\/wp-content\/uploads\/becoming-a-champion-for-childrens-rights.jpeg\" alt=\"Champion For Children’s Rights\" class=\"wp-image-3010\"\/><\/figure>\n\n\n\n<p>For the other children in his community, 15-year-old Vishnu is a superhero. Hailing from an orthodox family in Madanapalle (Andhra Pradesh), Vishnu dreamt of joining the Indian army but struggled with his confidence as he wasn’t allowed to socialize with his peers after school. The team at CRY project PORD took note of his situation and immediately spoke to his parents to convince them to let him join CRY’s children’s collective.<\/p>\n\n\n\n<p>At the collective, he was encouraged to be a part of multiple awareness programs which helped build his confidence. The project staff soon noticed that Vishnu had begun to develop a keen interest in children’s rights and that he was alerting the collective on child rights violations in the community. Children standing up for other children is a powerful thing and so, they began taking him along for their counseling sessions with families of child laborers and school dropouts. Vishnu also accompanied them to government offices, such as the Department of Women and Child Development to get a better understanding of the governance systems that work for children. Today, Vishnu is the president of his children’s collective and is an ambassador for children’s rights in his community. A firm believer in gender equality, he not only helps CRY identify incidences of child labor and child marriage but also monitors all the other children to make sure they’re going to school regularly. Even though he is still a child himself, Vishnu keeps a tab on social welfare hostels in his community to ensure they provide quality facilities, keeps a track of existing government schemes, and works with the community to ensure that they’re able to avail the benefits. This is what true agency looks like – when children are empowered to bring the change they want to see. As CRY, we hope to see a day when every child’s voice would be heard and considered – what a world that’d be!<\/p>\n\n\n\n<p><strong>You can give more children like Vishnu the chance at a brighter future. Donate to CRY by <a href=\"\/donation\/\">clicking here.<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>For the other children in his community, 15-year-old Vishnu is a superhero. Hailing from an orthodox family in Madanapalle (Andhra Pradesh), Vishnu dreamt of joining the Indian army but struggled with his confidence as he wasn’t allowed to socialize with his peers after school. The team at CRY project PORD took note of his situation [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[8],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1271"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1271"}],"version-history":[{"count":9,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1271\/revisions"}],"predecessor-version":[{"id":4373,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1271\/revisions\/4373"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1271"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1271"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1271"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}