{"id":1292,"date":"2020-09-02T17:53:12","date_gmt":"2020-09-02T17:53:12","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1292"},"modified":"2022-07-18T12:59:50","modified_gmt":"2022-07-18T07:29:50","slug":"amir-dreams-of-becoming-a-big-man","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/amir-dreams-of-becoming-a-big-man\/","title":{"rendered":"Amir dreams of becoming a big man!"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/amir-dreams-of-becoming-a-big-man.jpg\" alt=\"Amir dreams of becoming a big man\" class=\"wp-image-1293\"\/><\/figure>\n\n\n\n<p>“I have heard that Pashmina travels around the world. I am very curious to know what the world looks like because I’ve never got a chance to set foot outside my village in Baramulla, Kashmir. We are a family of 7 and Abba is the only one who earns for us by making pashmina. It is very beautiful!<\/p>\n\n\n\n<p>I used to enjoy going to school but within a few days, I realized that I took more time to learn my lessons than most others in my class. I would be bullied and I’d always have tears in my eyes on my way back home from school. Ammi and Abba did not like seeing me cry every day and so, one day, Abba suggested that I learn weaving instead of studying at school. I thought it’d be an escape from all the embarrassment and agreed to drop out of school.<\/p>\n\n\n\n<p>I started helping Abba but I also missed school. I wondered if I’ll ever become a big man and see the world now that I had become just a weaver – the thought made me very sad. That’s when some very nice people from CRY heard about me and made it possible for me to dream big again. They spoke to my parents and started visiting our home every day &#8211; just to motivate me to join back. They told me how I could learn better and faster and reassured me that my learning speed was just another challenge that I could easily overcome. So I returned to school and, to my surprise, the teachers there were so helpful!<\/p>\n\n\n\n<p>With the help of the people from CRY, they ensured that none of the other children made fun of me anymore and I slowly gained back my confidence. I cleared all my tests and I started enjoying going to school again. I learned so much there. I can now learn anything and everything that comes my way &#8211; I want to learn so much and become a big man. I want to travel the whole world but first I want to set foot outside my village!” &#8211; Amir, Baramulla<\/p>\n\n\n\n<p><strong>You can give more children like Amir the chance at a brighter future. Donate to CRY by <a href=\"\/donation\/\">clicking here.<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>“I have heard that Pashmina travels around the world. I am very curious to know what the world looks like because I’ve never got a chance to set foot outside my village in Baramulla, Kashmir. We are a family of 7 and Abba is the only one who earns for us by making pashmina. It [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1292"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1292"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1292\/revisions"}],"predecessor-version":[{"id":2783,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1292\/revisions\/2783"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1292"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1292"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1292"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}