{"id":1312,"date":"2020-09-03T04:48:15","date_gmt":"2020-09-03T04:48:15","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1312"},"modified":"2022-07-18T12:59:11","modified_gmt":"2022-07-18T07:29:11","slug":"you-put-sahana-on-the-path-of-financial-freedom","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/you-put-sahana-on-the-path-of-financial-freedom\/","title":{"rendered":"You put Sahana on the path of financial freedom!"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/you-put-sahana-on-the-path-of-financial-freedom.jpg\" alt=\"Sahana On The Path Of Financial Freedom\" class=\"wp-image-1313\"\/><\/figure>\n\n\n\n<p>When Sahana* tells her story, it’s hard to believe. What she endured is so out of the ordinary and how she overcame her trials is just as remarkable.<\/p>\n\n\n\n<p>Sahana is from a remote village in West Bengal where her father worked as a daily wage laborer to support their family of 9. From a young age, she dreamed of being financially independent and did everything in her power to find her way out of poverty through education. However, when she finally attempted to get a job, a series of events unfolded which turned her life upside down.<\/p>\n\n\n\n<p>A neighbor first promised to help her get a job in the government in exchange for some financial help. She did so, but in return, the job never materialized and she lost all her savings. Still determined to secure a government job, she applied to many places and eventually got an interview. Little did she know that this would turn out to be a cruel trap.<\/p>\n\n\n\n<p>Instead of an interview, the man she met held her hostage and raped her. This continued for 20 days. It only ended when Sahana found a way to escape and run back home. However, more bad news awaited her there. She found out that both her father and elder brother had suddenly passed away. In addition to having to deal with this loss and the trauma from her ordeal, Sahana now had to find a way to support herself and her family since her brother and father were their main breadwinners. It was at this juncture that she met a field worker from the CRY project from Sanlaap.<\/p>\n\n\n\n<p>The project staff member counseled Sahana and encouraged her to attend Sanlaap’s life-skills sessions. The sessions turned out to be a positive influence in her life – they boosted her self-confidence and helped her develop a new perspective. They also helped connect Sahana to a program that prepared her for a career in law; that is when she decided to become a lawyer and fight for justice – for herself as well as for other survivors of violence.<\/p>\n\n\n\n<p>Today, Sahana is a second-year student of law! She hopes to make a difference through her career and is looking forward to a chance to fulfill her dreams of financial independence!<\/p>\n\n\n\n<p><strong>You can give more children like Sahana the chance at a brighter future. Donate to CRY by <a href=\"\/donation\/\">clicking here.<\/a><\/strong><\/p>\n\n\n\n<p>*name changed to protect the child&#8217;s identity<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When Sahana* tells her story, it’s hard to believe. What she endured is so out of the ordinary and how she overcame her trials is just as remarkable. Sahana is from a remote village in West Bengal where her father worked as a daily wage laborer to support their family of 9. From a young [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[9],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1312"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1312"}],"version-history":[{"count":7,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1312\/revisions"}],"predecessor-version":[{"id":3544,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1312\/revisions\/3544"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1312"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1312"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1312"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}