{"id":1346,"date":"2020-09-03T05:54:17","date_gmt":"2020-09-03T05:54:17","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1346"},"modified":"2022-07-18T12:58:12","modified_gmt":"2022-07-18T07:28:12","slug":"no-dream-is-too-distant","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/no-dream-is-too-distant\/","title":{"rendered":"No dream is too distant!"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/no-dream-is-too-distant.jpg\" alt=\"No dream is too distant\" class=\"wp-image-1347\"\/><\/figure>\n\n\n\n<p>We often take education for granted. However, for a lot of girls in India, education is a distant dream. For a host of different reasons, girls across the country are forced to drop out of school. But when allowed to pursue education, girls can bring about a cycle of positive change. Not only do they stay away from early marriages and child labor, they also go on to become strong and independent members of society. As they grow, they make better choices for themselves. Choices that not only help them transform and secure their lives but also grow up to become empowered women who are capable of influencing their communities for the better.<\/p>\n\n\n\n<p>Arti’s* story is a live testimony to that.<\/p>\n\n\n\n<p>Arti belongs to one of the 40 Dalit families in the village of Peepardi Gaon near Rajkot. Being a very traditional community, the population of this village firmly believed that only their sons should study and not their daughters. Hailing from one of the poorer families, Arti could only study till class 8 as the village school did not have higher classes. But Arti loved studying and was very good at it too! She was very keen to study further but the conditions in her family and village were not allowing her to do so. The next school was in Rajkot and traveling to and fro was not a feasible option. Her parents also did not see any option and told her to give up. They were skeptical as until then, no girl from their village traveled outside the village alone to get educated further.<\/p>\n\n\n\n<p>When CRY project BST got to know about this situation, they immediately intervened. The members had a meeting with Arti’s parents. They told them about her wishes and that there are options if they supported her decision. They informed them about a residential school in Rajkot, a reputed place where her stay and food would be taken care of, while they would help her with the admission process. It took a lot of convincing before her parents finally agreed.<\/p>\n\n\n\n<p>Members from the community accompanied the project staff and Arti’s parents for her admission. This was a huge step – not only for her but for the entire community!<\/p>\n\n\n\n<p>Here, she completed her studies from 9th to 12th standard. Highly inspired by BST’s efforts, Arti too wanted to give back to her community. With this dream, she completed her Bachelor’s degree in Social Work from another college in Rajkot. Distance again became an obstacle as the college was far. But this time, she had her parents to support her. They did not give up on her dream.<\/p>\n\n\n\n<p>Today, Arti is looking forward to getting a Master’s degree in Social Work and going on to helping girls like her who want to study further!<\/p>\n\n\n\n<p><strong>You can give more children like Arti the chance at a brighter future. Donate to CRY by <a href=\"\/donation\/\">clicking here.<\/a><\/strong><\/p>\n\n\n\n<p>*name changed to protect the child&#8217;s identity<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We often take education for granted. However, for a lot of girls in India, education is a distant dream. For a host of different reasons, girls across the country are forced to drop out of school. But when allowed to pursue education, girls can bring about a cycle of positive change. Not only do they [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1346"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1346"}],"version-history":[{"count":8,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1346\/revisions"}],"predecessor-version":[{"id":3531,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1346\/revisions\/3531"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1346"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1346"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1346"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}