{"id":1355,"date":"2020-09-03T06:07:45","date_gmt":"2020-09-03T06:07:45","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1355"},"modified":"2022-07-18T12:57:53","modified_gmt":"2022-07-18T07:27:53","slug":"thimma-reddy-is-a-force-to-be-reckoned-with","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/thimma-reddy-is-a-force-to-be-reckoned-with\/","title":{"rendered":"Thimma Reddy is a force to reckon with!"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/thimma-reddy-is-a-force-to-be-reckoned-with.jpg\" alt=\"Thimma Reddy Is A Force To Be Reckoned With\" class=\"wp-image-1357\"\/><\/figure>\n\n\n\n<p>17-year-old Thimma Reddy is quickly emerging as a role model for the children in Manvi, Raichur. Together with the other members from the CRY children&#8217;s collective in their village, he goes to the panchayat to get information on critical issues and disseminates it within the community.<\/p>\n\n\n\n<p>When questioned by his mother on why he engages with the community and stakeholders rather than taking up a part-time job and adding to the family income, he tells her how he likes helping the children in his community and wants to see them become successful in life. “We are taking our rights, what is rightfully ours, not grabbing that of others,&#8221; he says.<\/p>\n\n\n\n<p>Three years ago, when Thimma was in the 9th grade, he went to collect firewood for cooking. Unfortunately, he got electrocuted due to an unattended live wire, and the accident left him with severe 80% burns. His family had to sell whatever little land that they had for the treatment that lasted six months and made him miss half of his academic year.<\/p>\n\n\n\n<p>As Thimma slowly recovered, CRY project SSS gave him constant motivation and counseling. He showed courage and confidence to pursue his education and wrote his final exams despite the pain and difficulty posed by his burns. Thimma Reddy passed his SSLC examination and is currently studying in the 12th grade at Baiyapur College in Manvi town.<\/p>\n\n\n\n<p>Thimma Reddy’s enthusiasm has not wavered over the years. Hailing from a poor background himself, he understood the hardships that each family in his village went through. To ensure that children did not have to bear the brunt of the financial responsibilities that their families face, Thimma convinced the village panchayat to make provisions for scholarships for students who passed their SSLC exams. Thanks to his efforts, the panchayat agreed to provide financial aid to over 300 students!<\/p>\n\n\n\n<p>Thimma also continues to do everything he can to aid the movement for children&#8217;s rights in his village. From working with the children’s collective to getting light bulbs and the electricity connection in the local primary school, and even monitoring the food services in the Anganwadi, Thimma Reddy is on top of it all. Thimma also goes to the Anganwadi and checks on the children, the premises, and the quality of food. He takes it upon himself to ensure that all of the children in his village go to school. When he heard about three children who were irregular in school and a child who had dropped out, he went to their houses and convinced their guardians to allow them to go back to school regularly.<\/p>\n\n\n\n<p>Today, Thimma Reddy is an Ashoka Youth Venturer who aims to alleviate child rights issues in his village and its neighboring areas.<\/p>\n\n\n\n<p>“I want to see children from our villages living healthy and happy lives and pursuing their dreams through education. I want to end caste and gender-based discrimination in schools and villages. I dream of better policies from our government so that the rights of children and marginalized communities are ensured!”<\/p>\n\n\n\n<p><strong>You can give more children like Thimma Reddy the chance at a brighter future. Donate to CRY by <a href=\"\/donation\/\">clicking here.<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>17-year-old Thimma Reddy is quickly emerging as a role model for the children in Manvi, Raichur. Together with the other members from the CRY children&#8217;s collective in their village, he goes to the panchayat to get information on critical issues and disseminates it within the community. When questioned by his mother on why he engages [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1355"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1355"}],"version-history":[{"count":7,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1355\/revisions"}],"predecessor-version":[{"id":2771,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1355\/revisions\/2771"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1355"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1355"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1355"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}