{"id":1367,"date":"2020-09-03T06:34:39","date_gmt":"2020-09-03T06:34:39","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1367"},"modified":"2022-07-18T12:57:10","modified_gmt":"2022-07-18T07:27:10","slug":"importance-of-girl-child-education-in-india","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/importance-of-girl-child-education-in-india\/","title":{"rendered":"Importance of Girl Child Education in India"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/importance-of-girl-child-education-in-india.jpg\" alt=\"girl child education in India\" class=\"wp-image-1964\"\/><\/figure>\n\n\n\n<p>India is still far from achieving gender equality and its skewed sex ratio of 940 females per 1000 males bears witness to this fact. A girl child in India is often seen as a liability, a ‘burden’ to pass on. Given the prevailing influence of patriarchal values, right from their birth, a lot many girls bear the brunt of gender inequality, gender stereotypes and are treated inferiorly, as compared to boys.<\/p>\n\n\n\n<p>No matter how talented and ambitious she is, the girl child often receives the shorter end of the stick. In fear of exploitation and abuse, many girls are not sent to school and kept at home only to be married off early. And even if she is not married off, the young girl is still denied a deserving education, quality healthcare, employment opportunities and equal rights that a boy easily gets. While some girls manage to ‘escape’ from the shackles and try to build a bright future, most resign to their ill fate.<\/p>\n\n\n\n<p>How can we hope for India to progress when half of our society remains under the shadow of discrimination? To find answers, we must first understand the key difficulties that a girl child faces.<\/p>\n\n\n\n<p><strong>Survival as the first challenge<\/strong><\/p>\n\n\n\n<p>While there are laws that ban sex-determination of a foetus and selective abortion, this practice continues in the shadows. This not only negatively impacts the number of girls born, but also affect the health and safety of the mother. Consecutive pregnancies with the hope of a boy take a toll on the physical as well as mental health as it is the woman who gets blamed for the sex of the baby. Stricter implementation and monitoring of laws, and better awareness, is essential to help the girl child survive.<\/p>\n\n\n\n<p><strong>Hurdles in receiving quality education<\/strong><\/p>\n\n\n\n<p>Recent national data reveals that the dropout rate for girls at the elementary level are 4.10% which rises to 16.88% at the secondary level, with the figures being substantially higher for girls from vulnerable groups (19.05% for SC and 24.4% for ST groups) (U-DISE 2015-16). The retention rate of girls at the elementary level is 70.6% which drops to secondary level is 55.5% (U-DISE 2016-17). Due to existing attitudes regarding girls’ education, safety concerns, distance between home and school, lack of affordable sanitary napkins, absence of separate and functional toilets, and poor school infrastructure, several teenage girls tend to become irregular in attending schools or drop out before completing their schooling. Only one in every three girls in India completes school education age-appropriately (U-DISE 2016-17).<\/p>\n\n\n\n<p><strong>Child marriage<\/strong><\/p>\n\n\n\n<p>Out of the 12.15 million children married in India, 8.9 million are girls, and married girls are three times the boys. As per Census 2011, there are about 3 million children below age 14 that are married. Rural girls constitute 55% of married children. Child marriage robs girls of their childhood as they step into adult roles that they are unprepared for – be it managing households, bearing children, making decisions and so on. It not only hampers her schooling but also pushes young girls into early pregnancy which harms the health and nutrition of the teenage mother as well as her child.<\/p>\n\n\n\n<p><strong>Abuse and violence\/safety concerns<\/strong><\/p>\n\n\n\n<p>A girl child is an easy target and is usually at the receiving end of abuse and domestic violence, which more often than not goes unreported. In rural areas, parents are reluctant to send their daughters to school fearing their safety. Latest data released by the National Crime Records Bureau also reveals that kidnapping, abduction and sexual offenses against children were among the top two crimes committed against children. 28% of all rape victims were girls under age 18 and out of the total number of children that went missing in the year 2018, 70% were girls.<\/p>\n\n\n\n<p><strong>Ill-equipped schools<\/strong><\/p>\n\n\n\n<p>Due to extreme taboos, lack of affordable sanitary napkins, lack of decent functioning toilets, and inadequate school infrastructure, several teenage girls of menstrual age lag in schooling.<\/p>\n\n\n\n<p><strong>Why is the education of the girl child important?<\/strong><\/p>\n\n\n\n<p>In our country, many people are unaware of how the education of the girl child can transform lives for the better. It is a sad state of affairs when people across socio-economic strata think that investing in a girl child’s education is a waste of money. The fact that they would rather justify spending on their daughter’s marriage expenses or dowry instead of their education is even more disheartening. Early education can be instrumental in shaping the society towards progress. When a girl is educated, she is empowered. She can make decisions for herself, raise the standard of living for her family and children, generate more employment options and reform the society as a whole. Therefore, a change in the mindset towards girl child education in India is the need of the hour. Every girl child must be treated equally with love and respect.<\/p>\n\n\n\n<p>The government has been making persistent efforts to raise the status of the girl child in the society as well as incentivize her education through various schemes and programs. These have surely contributed to girls’ education to an extent yet a lot more needs to be done for girls to be truly treated as equal to boys.<\/p>\n\n\n\n<p><strong>How is CRY making a difference?<\/strong><\/p>\n\n\n\n<p>CRY is committed to empowering girl children through its various projects. About 1,74,163 children between the ages of 6-18 years were enrolled in schools via concentrated efforts. <strong><a href=\"\/donate-for-the-girl-child\/\">Donate today<\/a> and aid CRY’s efforts in ensuring every girl child in India gets a deserving education.<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>India is still far from achieving gender equality and its skewed sex ratio of 940 females per 1000 males bears witness to this fact. A girl child in India is often seen as a liability, a ‘burden’ to pass on. Given the prevailing influence of patriarchal values, right from their birth, a lot many girls [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3,12],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1367"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1367"}],"version-history":[{"count":7,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1367\/revisions"}],"predecessor-version":[{"id":10032,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1367\/revisions\/10032"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1367"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1367"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1367"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}