{"id":1370,"date":"2020-09-03T06:39:11","date_gmt":"2020-09-03T06:39:11","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1370"},"modified":"2022-07-18T12:55:11","modified_gmt":"2022-07-18T07:25:11","slug":"reality-of-the-practice-of-child-labor-in-india","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/reality-of-the-practice-of-child-labor-in-india\/","title":{"rendered":"The Reality Of The Practice Of Child Labour In India"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/the-reality-of-the-practice-of-child-labour-in-india.jpg\" alt=\"Stop Child Labour In India\" class=\"wp-image-1967\"\/><\/figure>\n\n\n\n<p>Did you know that according to the National Census 2011, there are over 33 million children engaged in child labor in India in the age group of 6 to 18 years? An estimated 80% of child laborers are concentrated in rural areas. The Census study paints a grim picture of the situation, stating that 1 in 11 working individuals in India is a child in the age group of 5-18 years.<\/p>\n\n\n\n<p><strong>What is the meaning of child labor?<\/strong><\/p>\n\n\n\n<p>International labor Organization (ILO) defines child labor as ‘work that deprives children of their childhood, their potential and their dignity, and that is harmful to physical and mental development’. It refers to work that is mentally, physically, socially or morally dangerous and harmful to children; and interferes with their schooling. According to the Indian legislation, ‘child’ is anyone who has not completed 14 years of age and ‘adolescent’ is anyone who has completed their 14th year of age but is below 18 years. This law divides work into hazardous and non-hazardous categories as identified by the Technical Advisory Committee constituted under the Act. The Schedule to the Act enlists 38 occupations and processes as ‘hazardous’ and 69 others which are non-hazardous.<\/p>\n\n\n\n<p><strong>Is child labor illegal in India?<\/strong><\/p>\n\n\n\n<p>In 1992, when India ratified the United Nations Convention on the Rights of the Child (UNCRC), a reservation was made in Article 32, wherein the Government of India articulated that it would progressively ban all forms of child labor. After nearly three decades since the child labor law came into force, India has the opportunity to amend the law in favour of its children. Since India’s legal system gives basis to the assumption that children can work and still get an education, the new Child Labor Act allows children under the age of 14 to work in family occupations after school hours. However, when only 49% of working children between the ages of 5-14 and 17% between 15-18 years parallelly attend school – the numbers completely contradict the above assumption and leave a glaring gap in the prohibition of child labor.<\/p>\n\n\n\n<p><strong>How does child labor affect the nation?<\/strong><\/p>\n\n\n\n<p>Children engaged in child labor are robbed off of a happy childhood as well as the fun, learning experiences in their formative years. A majority of child laborers leave behind the path of education and compromise on becoming a literate individual. Leaving school behind, they become fully absorbed in the practice, so much so that they are unable to develop new skills and qualifications that are required to get into gainful employment roles. This way, India is losing out on an educated and skilled workforce that is required to propel our country’s economic growth and progress to greater heights. Not only do these children miss out on a childhood and an education but also suffer from numerous health issues by engaging in hazardous occupations. This socially unacceptable practice also dents our country’s socio-economic standing.<\/p>\n\n\n\n<p><strong>How can child labor be stopped?<\/strong><\/p>\n\n\n\n<p>Our society has, somehow, accepted and tolerated child labor as a social norm. It is only when we as a society adopt a zero-tolerance attitude towards this exploitative and abusive practice can we put an end to it. Rescuing these children is not the only solution. It requires a multi-pronged approach, one employed by NGOs like CRY.<\/p>\n\n\n\n<p>CRY’s efforts to stop child labour have already made inroads by freeing 149 Indian villages from this exploitative and abusive practice. <strong><a href=\"\/donation\/\">Donate now<\/a> to help child labourers go to school instead of work.<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Did you know that according to the National Census 2011, there are over 33 million children engaged in child labor in India in the age group of 6 to 18 years? An estimated 80% of child laborers are concentrated in rural areas. The Census study paints a grim picture of the situation, stating that 1 [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[4],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1370"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1370"}],"version-history":[{"count":9,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1370\/revisions"}],"predecessor-version":[{"id":10619,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1370\/revisions\/10619"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1370"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1370"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1370"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}