{"id":1397,"date":"2020-09-03T08:43:35","date_gmt":"2020-09-03T08:43:35","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1397"},"modified":"2022-07-18T11:16:03","modified_gmt":"2022-07-18T05:46:03","slug":"partner-with-cry-and-implement-csr-in-your-organization","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/partner-with-cry-and-implement-csr-in-your-organization\/","title":{"rendered":"Partner with CRY and implement your organization&#8217;s CSR goals"},"content":{"rendered":"\n<p>The term ‘Corporate Social Responsibility’ refers to the guideline set by the Government of India that mandates corporations in the country to contribute to the economic and social development of the society. This endeavour is aimed at a collective effort to empower the development sector and uplift the underprivileged of the country.<\/p>\n\n\n\n<p>Many corporates are on the lookout to actively participate in CSR, particularly in the areas of education and poverty in India. On the other hand, several non-profit organizations resolutely undertake the responsibility of carrying out productive CSR projects to ensure that the participation of corporates is utilized to the fullest. CRY, a renowned non-profit organization, has been partnering with corporates to carry out high-yielding work to support underprivileged children in India. Following are some of the ways that a corporate can collaborate with CRY and join the fight against child marriage, child trafficking, and child labour in India.<\/p>\n\n\n\n<p><strong>Support individual projects run by CRY<\/strong><\/p>\n\n\n\n<p>102 local projects are currently being implemented by CRY where the NGO works as a link between the corporate and the respective project. Functional across 19 states, CRY runs these initiatives for various areas of intervention, including education, health and safety. The corporate may adopt one or more of these projects, keeping in mind the geographical location and their area of interest. CRY offers direction, technical support and communications, among others, and periodically shares project impact reports with the respective organization.<\/p>\n\n\n\n<p><strong>Donate monetarily to support CRY initiatives<\/strong><\/p>\n\n\n\n<p>Corporates can even support the programs run by CRY by making a lump sum donation to support more underprivileged children in India. From malnutrition to gender inequality, CRY runs multiple impact-oriented programs in various parts of the country, and corporates can sponsor these to create a long-term change in the lives of the affected children.<\/p>\n\n\n\n<p><strong>Incorporate cause related marketing<\/strong><\/p>\n\n\n\n<p>Corporates zealously market their brands. They can also carry out cause-related marketing to integrate CRY’s work in their promotion plans to spread the word and build goodwill.<\/p>\n\n\n\n<p><strong>Encourage employee participation, engagement &amp; volunteering<\/strong><\/p>\n\n\n\n<p>Engaging employees in doing more social work by participating in an employee engagement program is an effective step. From skill-based volunteering to payroll donations, employees can choose to contribute to CRY in one way or the other.<\/p>\n\n\n\n<p><br \/>Implementing CSR is a great way for corporates to give back to society and provide financial aid to NGOs to continue their extensive work in the development sector. <strong><a href=\"\/contact\/?type=corporate\">Connect with CRY and initiate a CSR partnership right away.<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The term ‘Corporate Social Responsibility’ refers to the guideline set by the Government of India that mandates corporations in the country to contribute to the economic and social development of the society. This endeavour is aimed at a collective effort to empower the development sector and uplift the underprivileged of the country. Many corporates are [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[13],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1397"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1397"}],"version-history":[{"count":2,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1397\/revisions"}],"predecessor-version":[{"id":4237,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1397\/revisions\/4237"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1397"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1397"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1397"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}