{"id":1408,"date":"2020-09-03T09:11:14","date_gmt":"2020-09-03T09:11:14","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1408"},"modified":"2022-07-18T12:54:22","modified_gmt":"2022-07-18T07:24:22","slug":"a-happy-cry","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/a-happy-cry\/","title":{"rendered":"A Happy CRY"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/a-happy-cry.jpg\" alt=\"Child Rights and You\" class=\"wp-image-1410\"\/><\/figure>\n\n\n\n<p>Rippan and I were in the same drama class at the age of nine and became great friends. As we grew up together, he was also broke most of the time. Often I would buy him a vada pav but before I knew it, it was given away to a lurking hungry kid close by. CRY was what he wanted to create since he was in school.<\/p>\n\n\n\n<p>When Rippan became the head of the Interact Club, he started a campaign of collecting old newspapers and aluminum milk bottle caps that fetched him a lot of money from rag pickers. With that money and during our vacations, we started a tiny school in a hut near to where Rippan lived. Someone donated a hut and we donated some time. Sometimes the schooling was in the hut and at other times, Rippan would take the kids to the Worli sea wall. The ever-enterprising Rippan also got the women in the slum trained in mirror work and then bullied my mom and friends to buy it. After a few months, he started a dispensary in the slum, and again someone donated a room. The young visiting medical students treated minor illnesses or small wounds, and if the problem wasn’t their domain or experience, the patient was referred to the more experienced doctors.<\/p>\n\n\n\n<p>I remember the bus ride to college when Rippan told me he wanted to name his organization ‘CRY’, I argued that it wasn’t a positive word but he insisted it could be. A convinced Rippan asked a friend’s sister Rukmani Abreu to design him a logo, and the rest is history. Here it is, a happy CRY. I remember discouraging him over several matters but I am glad he never let that come in the way. Rippan could charm people into doing anything. I remember once there was a set of CRY cards that didn’t sell. Rippan who was flying to Rome (the Air India job) that week said not to worry, he would get them blessed by the Pope, and by god he did! And they sold! One would think he was going too far, but to him, it was the obvious thing to do.<\/p>\n\n\n\n<p>Many years later when for Circus Magic he asked a strait-laced and strict NCPA to install an old red sports car on the stage, they agreed. The crowds cheered as the clowns went berserk all over the auditorium. Even if he had friends who were not interested in children or the cause, he would get them to lend him their bike or ask for a ride in the name of CRY. He got them involved even if they were not interested.<\/p>\n\n\n\n<p>Rohinton Mistry‘s concert, Instant Karma, was the first fundraiser for CRY in which he sang Bob Dylan style with a mouth organ and guitar. At that time, we knew him as a musician, but later, he also became an author. We also sold the Buy-a-Brick and greeting cards at my former school, JB Petit, because my principal was very supportive of the cause. All I can remember from that time is being at the printers&#8217; late at night. At home, we’d work on the dining table, sometimes under it. Soon we took over his mom’s house and bunked college ever-so-often to work with CRY. We would carry food to the slums and at times, not even leave food at home.<\/p>\n\n\n\n<p>As friends, we of course had a million fights but we remained close. When I got married and had children, he was amazing with my kids (who even volunteered with CRY). Rippan also had strong integrity. I remember at ART for CRY, there was a particular painting of a then-upcoming artist Anju Dodiya and I wanted it, but he wouldn’t let me have it without a formal bid. I continued to be a part of CRY, albeit informally, until the day Rippan died. In retrospect, I think when a goal is so clean and clear, everything falls into place, as it did for Rippan and his CRY.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Rippan and I were in the same drama class at the age of nine and became great friends. As we grew up together, he was also broke most of the time. Often I would buy him a vada pav but before I knew it, it was given away to a lurking hungry kid close by. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1408"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1408"}],"version-history":[{"count":8,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1408\/revisions"}],"predecessor-version":[{"id":2840,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1408\/revisions\/2840"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1408"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1408"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1408"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}