{"id":1416,"date":"2020-09-03T09:19:30","date_gmt":"2020-09-03T09:19:30","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1416"},"modified":"2021-07-19T19:52:30","modified_gmt":"2021-07-19T14:22:30","slug":"the-simplest-ideas-in-the-world","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/the-simplest-ideas-in-the-world\/","title":{"rendered":"The simplest ideas in the world"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/the-simplest-ideas-in-the-world.jpg\" alt=\"The simplest ideas in the world\" class=\"wp-image-1418\"\/><\/figure>\n\n\n\n<p>Memory Contributors: Mohammed Khan, Pervin Varma<\/p>\n\n\n\n<p>Mohammed Khan: Rippan’s sister and my ex-wife went to school together and that is how I got to know him. He was a quiet, shy, retiring type of guy, with a full-time job with Air India. One evening, he told me that he wanted to start this organization called CRY and what his vision was, and what he wanted it to be. I was amazed at how he had thought about every little aspect and detail to set it up. I sat there fascinated with Rippan while he spoke about his plans for about an hour. He also wanted to have this big show with some clowns he had met with, in England, I think, and organize a huge parade on Marine Drive with them in Mumbai.<\/p>\n\n\n\n<p>He asked me – “What do you think?” I said, “It’s a great idea but who is going to do it?”, “I am going to do it!” “But how are you going to do it, you are not even in the country half the time!?” Rippan sat there with a quiet knowing smile. I was, of course, very cynical and had met my share of people with magnificent dreams and no action. I said to myself that Rippan’s big plans were never going to happen. About a year later, I actually went and saw this parade, Circus Magic. The clowns, the stilts, the buzz, the crowds, and every single thing he had talked about was happening in front of my eyes. My god! I stood corrected and how. I was stumped and impressed with Rippan’s determination.<\/p>\n\n\n\n<p>Over the next few months, Rippan and I began chatting more and I offered my help in any which way I could, at no cost. I was greatly honored when he requested that I handle the advertising for CRY. One doesn’t meet too many people who have the gumption and the determination to do things when no money is involved or they have to give up something for someone else. It was his sincerity, purity, and commitment that really touched me. I decided that it would be an account run under my personal supervision. People called it one of “Mohammed’s Accounts” which were only a few. Rippan also invited me to become a Trustee at CRY.<\/p>\n\n\n\n<p>At Enterprise, we had some really amazing accounts, and our philosophy on advertising was ‘big impact’. Yet, here was CRY, with very little money to pay for publishing ads. It wasn’t a glamourous account with big budgets, nonetheless, it became one of the greatest accounts to work with. CRY became THE thing to work on and involved every single art director and writer in the office. I am not joking when I say that people would kill to work on this account. No other account until then or had since caused this kind of internal joy and competitiveness, and everyone got a shot at it. After all, everyone wanted to be a part of something good. A large number of people worked on the CRY account, including me, and we are proud that our agency gave its best and we felt very good about what we did. At Enterprise, we didn’t work for a client’s products, we worked for good people. There was so much mutual trust that we shared.<\/p>\n\n\n\n<p>I am not too sure who wrote the now-iconic ‘Raju Ad’. I think it was written by Rajen Nair. It was a very interesting ad because the moment we ran the ad, the money began pouring into CRY. We had done some other good ads too but nothing compared to the results that this particular ad brought in.<\/p>\n\n\n\n<p>A few years later, as Enterprise grew as an agency, I began to feel that we were not being able to give CRY the time and focus it needed. CRY was also growing in its own right and it was time to part ways. While Rippan was happy with our services, it didn’t feel the same way for me. It is never okay for me to not do justice to a client. About a year after we stopped working with CRY, Rippan called and said that he wanted a big favor and wondered if he could run the Raju Ad again. The ad didn’t belong to us, and I insisted that he must use it as much as he likes. He said, “That ad has done better for us than anything else we have done.” A few weeks later, he called again to say that the Raju ad was indeed magical. Each time they ran it, the money would start pouring in. They did work with some other agencies after.<\/p>\n\n\n\n<p>I remember we also tried to analyze why the ad worked so well. It had a great line, it was very well written, it succinctly made a proposition to change a child’s life, and a reasonable ask of Rs. 20 per month made ordinary people feel that they could play a part in some goodness. I think I can say now that it was the most successful ad we have ever produced.<\/p>\n\n\n\n<p>Pervin Varma: The Raju ad was really an iconic ad for CRY. Even now, people remember the child with bricks on his head. CRY’s only source of income until then was greeting cards. Only after we ran the Raju Ad did we develop a second source of income – Donations. Towards the latter part of the 1980s, the government declared that we could not sell cards for charity and any sales will be taxed. Hence, raising funds via donations had to emerge.<\/p>\n\n\n\n<p>To release the ads over time, we got some sponsors and well-wishers. The media at the time was also much more generous so we received some discounts or free media space. I remember it was also an interesting-looking ad – A long strip so the newspapers and publications didn’t have a choice but to place it at the edge of the page which made it hard to miss. A significant amount of money was raised from the ad and we used its power for years.<\/p>\n\n\n\n<p>Around the same time, we had also gone to NORAD to ask them for money to run the campaign. They gave us the money but also cautioned us that ads would gradually produce only diminishing returns. They instead recommended that we must also look at Direct Mail. They gave us the funds and the expertise to set it up. We and HelpAge India became the first two not-for-profits to set up a robust Direct Mail operation.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Memory Contributors: Mohammed Khan, Pervin Varma Mohammed Khan: Rippan’s sister and my ex-wife went to school together and that is how I got to know him. He was a quiet, shy, retiring type of guy, with a full-time job with Air India. One evening, he told me that he wanted to start this organization called [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1416"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1416"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1416\/revisions"}],"predecessor-version":[{"id":2763,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1416\/revisions\/2763"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1416"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1416"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1416"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}