{"id":1421,"date":"2020-09-03T09:26:52","date_gmt":"2020-09-03T09:26:52","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1421"},"modified":"2022-07-18T12:54:07","modified_gmt":"2022-07-18T07:24:07","slug":"25-years-of-cry","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/25-years-of-cry\/","title":{"rendered":"25 years of CRY"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/25-years-of-a-celebration.jpg\" alt=\"25 years of CRY\" class=\"wp-image-1422\"\/><\/figure>\n\n\n\n<p>Memory Contributors: Pervin Varma, Yogita Verma, Ingrid Srinath<\/p>\n\n\n\n<p>Pervin Varma: On the occasion of 25 years, the whole office came to Mumbai and we spent two days together. It was seriously two of the most amazing days of my life. Our staff, partners, trustees, friends, as well as alumni, came together for the first time, many of whom hadn’t met each other before.<\/p>\n\n\n\n<p>Apart from all the unforgettable emotional and fun exchanges, we also consolidated all our conversations about the move to advocacy as a strategic shift within the organization. Later that year, we formally changed our name to what we had come to become, an organization that works on Child Rights – from &#8216;Child Relief and You&#8217; we became &#8216;Child Rights and You&#8217;.<\/p>\n\n\n\n<p>Yogita Verma: In 2004, we completed 25 years of CRY since its inception in 1979. 2004 was also the year when we were working on an Election Advocacy campaign (Child Rights) around the upcoming National General Elections. We wanted to get people to think about the parties they were going to vote for and to consider if child rights was a priority for their party. We got people to sign around 100,000 petitions, organized meetings with party representatives, and even managed to get their manifestos changed to support child rights. Two and a half decades of CRY demanded that we have a simple yet powerful statement to make on child rights.<\/p>\n\n\n\n<p>The Pinwheel, as a chosen symbol, had movement – it was childlike and was universally understood. To build an influential symbolism around our chosen metaphor, someone suggested we show ‘fields of pinwheels’. They had seen an Australian campaign to support aboriginal tribes with a field full of waving hands, so we decided to do something similar. Almost 5 lakh paper pinwheels were manufactured in silver and yellow. I remember having the two pinwheel manufacturers on speed dial to make more orders on demand. Everyone who signed the Child Rights Advocacy campaign across towns, villages, and cities bought a pinwheel and we planted it across their locations as well as on Aksa Beach to show their support. We also organized a Telethon for 7 hours on TV and even got really good media coverage.<\/p>\n\n\n\n<p>To celebrate 25 years of CRY that year, all the partners and employees of CRY were invited to Mumbai and I remember we didn’t sleep a wink all night. We danced, laughed, wept, and reminisced about old times; we heard inspiring and powerful stories of each other’s work at CRY. I remember Pervin Varma was anchoring the show and since she was leaving CRY, everyone was crying a lot. It was a highly emotionally-charged time. I could never, in my life, forget that day.<\/p>\n\n\n\n<p>Ingrid Srinath: The 25th year celebrations were coming up and we couldn’t do something that may be seen as self-indulgent. It had to be a symbol that anybody could relate to, and we could market to support our cause. If we went to the donors, it needed to be a symbol that had a substantial story. It had to symbolize change, childhood, and the joy of freedom. It also needed to work across every language and culture in India. The communication was not going to be designed for the urban middle class &#8211; it was going to be taken to the tribal communities, the north-east, and the south.<\/p>\n\n\n\n<p>I remember the agency struggled with it for months. They kept coming up with over-thought and over-analytical stuff. One evening when everyone was just frustrated and about to give up, an account executive, Ketan from Grey Worldwide, who was not even a copywriter or an art director, mumbled something about a pinwheel. I remember there was complete silence in the room, and suddenly everybody together exclaimed, “Yes”! The &#8216;silver and the yellow pinwheel&#8217; became the symbol of everything we wanted to say, and it got used in myriad ways.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Memory Contributors: Pervin Varma, Yogita Verma, Ingrid Srinath Pervin Varma: On the occasion of 25 years, the whole office came to Mumbai and we spent two days together. It was seriously two of the most amazing days of my life. Our staff, partners, trustees, friends, as well as alumni, came together for the first time, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1421"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1421"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1421\/revisions"}],"predecessor-version":[{"id":2838,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1421\/revisions\/2838"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1421"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1421"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1421"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}