{"id":1429,"date":"2020-09-03T09:34:54","date_gmt":"2020-09-03T09:34:54","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1429"},"modified":"2022-07-18T12:53:44","modified_gmt":"2022-07-18T07:23:44","slug":"volunteers-are-the-backbone-of-cry-america","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/volunteers-are-the-backbone-of-cry-america\/","title":{"rendered":"“Volunteers are the backbone of CRY America”"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/volunteers-are-the-backbone-of-cry-america.jpg\" alt=\"backbone of CRY America\" class=\"wp-image-1430\"\/><\/figure>\n\n\n\n<p>Memory Contributor – Shefali Sunderla and Rajesh Munshi<\/p>\n\n\n\n<p>Shefali Sunderlal: I began to be involved with CRY Inc (America) when it had begun to fall apart. Essentially, our engagement with our extension in the USA was not working out and it wasn’t very pleasant. I was then sent to do a recce to see what could be salvaged of it. Pervin Varma, Anand Bhatt, and I worked on that. Very soon, CRY India decided to sever ties with the then management at CRY Inc and start afresh.<\/p>\n\n\n\n<p>Due to severing our ties, consequentially, we lost all our donor and volunteer bases. CRY Inc also went its separate way and morphed into Vibha and we had to start again from scratch in 2003. At the time, I was handling everything from Bengaluru (formerly Bangalore) because there was no money to pay the American status salaries. Additionally, it took us a while to understand what kind of US legalities we had to adhere to, and the board we wanted. We finally got out clearance from the US government to start our fundraising activities in November 2003. I reached out to the old volunteers to see if anyone wanted to return to the new CRY America fold, and began with three chapters – Seattle, Richmond, and Boston. Three people – Rajesh Munshi, Vinod George, and Anand Mehta were instrumental in helping me set up a new region again. Slowly, we began to build it up from scratch and founded ourselves a really good new board. I would travel a lot to where we could set up an office. In 2005, I moved to the new CRY office in Boston, Massachusetts.<\/p>\n\n\n\n<p>Over the next few years, we built new volunteer chapters (17 now), mailers, a website with a robust payment gateway. With hardly any employees, the website helped raise a lot of money. We ensured that the site was constantly updated and was in tandem with the latest technologies. We built a basic resource generation, hired a solid American accounting firm, and invested a lot of effort in creating a buzz about CRY in America. We organized media and fundraising dinners in New York as well as media conferences. By 2007, we were doing very well raising amounts to $1 million. In 2008, however, the economy crashed and the next three years looked bleak. Several NGOs in the USA went under, and there was a lot of insecurity. We were very lucky that we were just about afloat and hadn’t taken a hit in terms of revenue.<\/p>\n\n\n\n<p>Currently, while we have several channels to raise revenues, almost $500,000 comes with the efforts of volunteers. Our volunteers are the backbone of CRY America and they do everything on their own. They spread the word around families, to their friends, and companies, as well as get new volunteers who come to the USA to study. CRY Walk is our signature event and that has helped us raise almost $350,000 this year. CRY Holi and CRY Cricket are also popular events. This year, CRY cricket had 16 teams playing in NY and it raised 10,000 dollars from one event. The Seattle Holi event experienced nearly 4000 people. I am in awe of the work the volunteers do. I feel grateful and inspired by what they do.<\/p>\n\n\n\n<p>In 13 years, we now have a database of 21,000 donors and 2,000 volunteers in the USA. Because of them, we have been able to fund 70 projects that support 600,000 children in 2,700 villages in India. Still, a lot of work remains to be done and I feel more people in the USA should know about CRY.<\/p>\n\n\n\n<p>Rajesh Munshi: At the age of 22, I moved to the USA to pursue a Master&#8217;s degree from Stony Brook University, NY. I had heard about several NGOs in India, including CRY, and was interested in the cause of helping children; when an online &#8216;Call for Volunteers to join the American action center of CRY&#8217; came my way, I readily offered myself to it.<\/p>\n\n\n\n<p>It was the 1990s, the Internet was just coming up and websites were becoming the hub for publicity &amp; information. Considering there were only three of us volunteers, and Namita Abreu as the (now Former) Director in all of the USA, with hardly any funds, our first project was to establish a web presence to have a wider and quicker reach across America. We also began gathering and preparing a lot of literature on CRY. To build a database of donors and volunteers, we wrote several emails to online newsgroups and universities. There were a lot of Indian students coming in and there was a lot of interest in helping things to get better back home. It was the perfect time for CRY to launch. In 1993, we became an official non-profit organization with a US 501 C3 status.<\/p>\n\n\n\n<p>We didn’t have a big presence in the USA and so we focused on nation-wide initiatives and drove them through online newsgroups. Our next step at CRY Inc (re-established in 2003 as CRY America) was to increase awareness about CRY via events on a national level. One of the first initiatives was a collaboration with AT&amp;T (American Telecommunications), where one could nominate a charity of their choice and AT&amp;T would donate a percentage of their invoice to CRY. In addition to that, we led several Penny Collection and Donation drives and soon raised $80,000 of the $100,000 goal. With the funds, we supported seven fellows and five projects in India such as the SKCV Children’s Trust in Vijaywada, and Apnalaya project in Mumbai. For almost five years since the inception of CRY’s presence, many of us volunteers didn’t even meet. We worked every week but only via email and phone calls. It’s hard to believe that we worked so well together to have an impactful presence, without ever knowing them offline.<\/p>\n\n\n\n<p>In 1995, after my graduation, I took on a role at Microsoft in Seattle but continued to work with CRY as a volunteer. I was first made the national coordinator between all the action centers, then on the management committee, and also began to head the Seattle Action Center, and it was time to increase our scope. We decided to establish more action centers in the USA, and by 1997, we had seven action centers and a robust volunteer network. I also got a lot of people from Microsoft involved in our efforts and soon the company too began to support the cause of CRY. Every October, Microsoft encourages its employees to support charities of their choice, and CRY is one of them. We also have the availability of Microsoft’s facilities and recently organized a CRY Fundraiser – a Dandiya Event with 3,000 guests on the Microsoft campus.<\/p>\n\n\n\n<p>Soon we also began to work on being thorough professionals &#8211; we organized and had solid documentation of all the work we were doing. We also included all the great stories of impact that the donors had contributed to – it was a great way to honor and thank our donors.<\/p>\n\n\n\n<p>The CRY Walk is our largest recurring event. It was designed as an early fundraising idea that worked across all local action centers and yet had an exciting impact nationally. The first CRY Walk took place in New York and soon it became a huge movement. That idea continues to be a huge success till today. With these walks, we began to receive good coverage in the press and raised our goal funds of that year. In some of the CRY Walk events, we also partnered with local organizations that helped disabled children. It was amazing to see these kids participating in our walks, to help underprivileged children in India. The last run we organized was the first time where we had more non-Indians participate on the run.<\/p>\n\n\n\n<p>Uphaar is our second biggest recurring event that began 12 years ago in Seattle. We organize a big formal dinner for our top donors and project partners – the event includes esteemed guests &amp; speakers, art exhibitions, auctions, a presentation on the donors’ impact, and the future projects we want to support. In addition to being a great networking opportunity for everyone, an Uphaar event can raise up to $200,000 for CRY in just one evening.<\/p>\n\n\n\n<p>Most of us volunteers have full-time jobs and so we work during weekends or evenings. In Seattle, we meet every Monday evening at Microsoft (about 45 times a year). We are very serious about the work we do, and it needs a lot of discipline. We don’t want a situation where promissory funding to a project couldn’t be met. In Seattle, the biggest action center, we have raised close to $8 million in the last 18 years and each year we raise close to half a million. The young volunteers have new technology on their side so they can get the word across faster than we used to have at our disposal. Currently, we have close to 1000 volunteers and more than 30 action centers in the USA.<\/p>\n\n\n\n<p>The work I do with CRY is satisfying so often that I am committed to it for life. I am very glad I came across that post to recruit volunteers when I was only 23 years old.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Memory Contributor – Shefali Sunderla and Rajesh Munshi Shefali Sunderlal: I began to be involved with CRY Inc (America) when it had begun to fall apart. Essentially, our engagement with our extension in the USA was not working out and it wasn’t very pleasant. I was then sent to do a recce to see what [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1429"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1429"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1429\/revisions"}],"predecessor-version":[{"id":2837,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1429\/revisions\/2837"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1429"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1429"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1429"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}