{"id":1433,"date":"2020-09-03T09:38:16","date_gmt":"2020-09-03T09:38:16","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1433"},"modified":"2022-07-18T12:53:34","modified_gmt":"2022-07-18T07:23:34","slug":"click-rights","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/click-rights\/","title":{"rendered":"Click Rights"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/click-rights.jpg\" alt=\"story of Click Rights\" class=\"wp-image-1435\"\/><\/figure>\n\n\n\n<p>Memory Contributors: Soha Moitra, Yogita Verma, and Regina Thomas<\/p>\n\n\n\n<p>Regina Thomas: The history of Click Rights begins with the formation of the Volunteer Action Group in 1990 and I was heading it. We had organized a Street Theatre festival and wanted to execute it nationally though, for some reason, it worked only in Bangalore (now Bengaluru) and Bombay (now Mumbai). At the time, the IT Industry was just about coming up in Bangalore and many young IT people began to move to Bangalore. In need of volunteers to help with the Theatre Festival, CRY announced a call in IT companies for volunteers and received 80 applicants. These were people who belonged to all kinds of backgrounds. They took the festival to all kinds of areas of Bangalore. It was incredible! I remember we did get all the permissions from the police but because of the crowds, we still got arrested.<\/p>\n\n\n\n<p>The volunteers who had now tasted the joys of really impactful work came back to us and said, “We can’t stop now and you have to do something.” We encouraged them to come up with ideas that they would love to be involved in. One idea that did well was a corporate quiz called FACT (Free A Child Today) &#8211; it became a big event. The volunteers even managed a collaboration with the Karnataka State Quiz Association and soon it became a national event. From then on, there was no stopping the volunteer action. We formalized the volunteer function and they were called Friends of CRY. Click Rights is nothing but a product of the volunteers who have helped build it into such a grand event.<\/p>\n\n\n\n<p>Soha Moitra: Once not so long ago, we had a division called the Youth Wing. It was about children so I am not sure why it was called &#8216;youth&#8217;, nonetheless, it was the only space in CRY that approached and encouraged privileged children to understand and discuss issues on child rights via different mediums. These were the children who had it all – we wanted to involve them in the work we were doing, and to inculcate sensitivity as well as an understanding of the issues their not-so-privileged counterparts suffer. When encouraged to volunteer, they came up with many cute ideas, some of which we helped them implement. Soon their parents, friends, and families began to approach CRY to volunteer with the cause, but at the time we didn’t have a department who handled adult stakeholders, and so it was all managed by the Youth wing. Adults could now contribute their skills, time, energy, and efforts to CRY, and very soon the wing expanded. Having said that, we needed more structure and precise skill sets to work with adults.<\/p>\n\n\n\n<p>In 2004-2005, a strategic document for Volunteer Action came into place, and they took it very seriously. Once we moved on from Relief to Rights, we defined a volunteer action to citizen action and asked them to take charge of their surroundings and focus on the state of children around their immediate geographies.<\/p>\n\n\n\n<p>Gradually they came to be called The CAG (Citizen Action Groups), now they are called PAG (Public Action Groups). They can be called the watchdogs for their areas. They watch out for any violations around them. They check that the schools around them are functioning as they must. Some even design their programs that bring more value to CRY because even we, as an organization, need refreshing insights into what is happening with the children and youth these days, and how do they perceive and negotiate the paradigm of rights. They know how to take a small thing and make it big with limited resources. It is a reminder of how CRY began in the first place.<\/p>\n\n\n\n<p>By the late 2000s, we wanted to do something around photography because a lot of youngsters who came to CRY as volunteers had an urge to go beyond the normal subjects. Also needed was a campaign with a long-term intervention impact to talk and discuss issues about communities and children. We decided to do something with photography as it allowed us to connect to many different kinds of people and age groups. Click Rights was a good name &#8211; it was short, crisp, and said it all.<\/p>\n\n\n\n<p>Yogita Verma: When the volunteers began to pour in to do whatever they could, it began to feel like a bit of a Mom &amp; Pop store. We used to tell them to do whatever they could and that was good enough. But soon we realized that we wanted specific skill sets to work with the idea of &#8216;rights&#8217; and decided to put some serious structure in the action groups. We got people to check on the Anganwadis and the food that they served, the kids who dropped out of school, and helped them re-enroll. It was sturdier but it was also restrictive because one can’t get too many people in forms of efforts that focus on rights.<\/p>\n\n\n\n<p>To get our efforts to a grander scale that served our purpose as well as the many more volunteers, we decided that maybe CLICK Rights could be made bigger with the Volunteers Action Group. Click Rights began with the Public Action Groups in Bombay and Calcutta. Many volunteers were people who were enthusiastic about photography and we got some photographers to mentor them, they’d take photographs of children on the streets and organize small exhibitions. To make the idea even bigger, we then invited a well-known photographer, Prashant Panjiar to help us out. We decided on a theme – Girl Child (Iccha) and he got his team in to train volunteers on photography, go out, and photograph the streets on the theme. He also got several photographers like Dinesh Khanna, Amit Pasricha, and Raghu Rai to donate their works to CRY. We then organized a big exhibition, with blown-up prints (on vinyl) at the India Habitat Center &#8211; had a huge press conference and displayed the works across several malls. Suddenly everyone at CRY sat up and said this can be a game-changer! We then instituted an online microsite and encouraged people to photograph issue-specific images and upload them.<\/p>\n\n\n\n<p>Now we have several established photographers who mentor volunteers with Child Labour as a theme. Vicky Roy, a young and incredible photographer, and his photo library organization, RANG, became the resource in Delhi to curate the show on Click Rights. Every year, we receive at least a 1000 stories and photographs, and it shines some great insights and light on matters that must be addressed.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Memory Contributors: Soha Moitra, Yogita Verma, and Regina Thomas Regina Thomas: The history of Click Rights begins with the formation of the Volunteer Action Group in 1990 and I was heading it. We had organized a Street Theatre festival and wanted to execute it nationally though, for some reason, it worked only in Bangalore (now [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1433"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1433"}],"version-history":[{"count":6,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1433\/revisions"}],"predecessor-version":[{"id":2836,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1433\/revisions\/2836"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1433"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1433"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1433"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}