{"id":1438,"date":"2020-09-03T09:44:11","date_gmt":"2020-09-03T09:44:11","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1438"},"modified":"2022-07-18T12:53:26","modified_gmt":"2022-07-18T07:23:26","slug":"circus-magic-as-crys-first-national-public-event","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/circus-magic-as-crys-first-national-public-event\/","title":{"rendered":"Circus Magic as CRY’s first national public event"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/circus-magic-as-crys-first-national-public-event.jpg\" alt=\"CRY’s first national public event\" class=\"wp-image-1439\"\/><\/figure>\n\n\n\n<p>Memory Contributor: Amita Kapur (with inputs from Vippan Kapur)<\/p>\n\n\n\n<p>I think in 1982, Rippan met these British clowns on stilts in London. There was Roby, David, and a third person whose name we can’t remember. Fascinated by their skills and expertise, Rippan who always thought bigger than anyone we know decided to bring them to India. It was to be CRY’s first national public event and it was going to be spectacular. We decided to do the event in three cities – Bombay, Delhi, and Calcutta.<\/p>\n\n\n\n<p>In Bombay (now Mumbai), the performers got off the airplane in stilts and walked across the airfield on stilts. There was a lot of press that Rippan had managed to organize because it was a first-of-a-kind event. People had seen nothing like it. I remember there was a lot of coverage in the Bombay press.<\/p>\n\n\n\n<p>In Delhi, I remember it was winter and I had organized everything – from Press to Police permissions, and scores of volunteers. The spectacle was no doubt planned for impact and the press was invited to the train station to witness it. The moment the performers got off the train on stilts, it was like joy had stood up ten feet tall in the air. It was just amazing! The visit to Delhi began at Balbhavan where the performers conducted a workshop for underprivileged children. They had the children sketch, draw, make masks, paint each other’s faces, learn the basics of pantomime, and some even learned how to walk in smaller stilts.<\/p>\n\n\n\n<p>After the workshop – I think the next day there was a walk, with crowds of people walking with the performers in fascination. The walk began from Janpath and culminated at India Gate. People on the roads were shell shocked in awe and simply gaped while the performers were quite friendly and fun, standing ten feet tall they would now and then bend to shake hands and the crowds cheered in joy.<\/p>\n\n\n\n<p>CRY, of course, at the time, did not have enough funds to offer them formal accommodation and food. While Rippan did manage to get a sponsorship from Air India to fly them to India and back, they stayed at our small 400 sq ft <em>barsati<\/em> home in Lajpat Nagar. I remember that there were so many people at home; it seemed our home was taken over by awestruck young volunteers and fascinated friends &amp; families. The next morning, we had to make breakfast and we recollect mounds of porridge being cooked.<\/p>\n\n\n\n<p>We got quite a bit of newspaper coverage even in Delhi. In Calcutta, they stayed at my mother’s home. And for the rest of the funds, I think ITC was the sponsor. It was a crazy spectacle and we will never forget it. I don’t think anyone who was a part of the event has.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Memory Contributor: Amita Kapur (with inputs from Vippan Kapur) I think in 1982, Rippan met these British clowns on stilts in London. There was Roby, David, and a third person whose name we can’t remember. Fascinated by their skills and expertise, Rippan who always thought bigger than anyone we know decided to bring them to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1438"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1438"}],"version-history":[{"count":6,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1438\/revisions"}],"predecessor-version":[{"id":3028,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1438\/revisions\/3028"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1438"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1438"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1438"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}