{"id":1442,"date":"2020-09-03T09:59:35","date_gmt":"2020-09-03T09:59:35","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1442"},"modified":"2022-07-18T12:53:17","modified_gmt":"2022-07-18T07:23:17","slug":"a-turning-point-for-cry-and-perhaps-the-most-crucial","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/a-turning-point-for-cry-and-perhaps-the-most-crucial\/","title":{"rendered":"A turning point for CRY and perhaps the most crucial"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/a-turning-point-for-cry-and-perhaps-the-most-crucial.jpg\" alt=\"Crucial Turning Point In CRY’s History\" class=\"wp-image-1443\"\/><\/figure>\n\n\n\n<p>Memory Contributor: Pervin Varma, Ratan J. Batliboi, Nandan Maluste, Indira Pant, Mohammed Khan<\/p>\n\n\n\n<p>Picture caption: (L to R Standing) Jyoti Paswan, Indira Pant, Rippan Kapur, Sheena Hamid, Khurshid Dabdi, Carol Nazareth, Sandra, Selma Abreo, Leslie, Manorama, Savio D’Souza, Rajashri Bansiwar, Gawde. (L to R Sitting) Shaila Malik, Anna, Kiran Mestry, Chinnam Gopinath, Srilatha Batliwala, Anupa Suvarna. Bombay 1990<\/p>\n\n\n\n<p>Pervin Varma: I find this photograph particularly evocative because it was taken just before I joined CRY and these were the first set of people I met and the first CRY office I walked into in 1990. I had spent 3 years in advertising; in Bombay, Bangalore, and Calcutta, and got married to a colleague in Lintas. Ethically, we both couldn’t work in the same place so I quit. Moreover, I had begun to feel quite uninterested in the profession, it didn’t matter to me much.<\/p>\n\n\n\n<p>I sort of knew that I wanted to work in the social sector but didn’t know what exactly I wanted to do. I experimented with working with the hearing-disabled but ran away from it. I was beginning to get very restless too because not doing anything in Bombay is hard. One evening at a Lintas party, I met a woman called Shaila, whose husband and mine were colleagues. Now when I think about it, she saved me from the party and that confused juncture in my life. Shaila was working in the communications department at CRY which Jyoti had setup. Hearing her speak, I toyed with the idea of working for children but it terrified me. Nonetheless, I was intrigued and wondered if there was a place for me in the communications cell at CRY. Soon, I found myself going to meet Jyoti at CRY and then met with Rippan for an interview. I remember Rippan proceeded to impart a long lecture on how they spend time a lot of time orienting people and if that would be something I can handle. Long story cut short, I got the job and to my amusement, I discovered I was going to be working on developing an orientation program.<\/p>\n\n\n\n<p>This photograph represents transition and embodies a crucial change that CRY went through. Up until this time, CRY had been functioning out of homes, godowns, mills, small rooms, and garages. But Rippan had a vision of an organization. He knew he needed professionals, a good infrastructure, and a proper office for CRY to grow. But buying a property in Anand Estate caused a lot of conflict within the organization, one because we didn’t have resources, and two, it wasn’t a done thing for an NGO to invest in their premises. A couple of trustees even left because of the disagreement. Their idea was that all money should go to the benefit of children, and the idea of creating long-term change to build a sustainable organization, was alien.<\/p>\n\n\n\n<p>CRY bought the space and received two donated computers. Now the accounts could get done and Carol was our first IT person. Rippan also realized that we needed more expertise in marketing and development. To recruit and pay for the expertise, we approached the Ford Foundation for a 2-year salary grant. Ford was simply incredible, for after seeing our proposal, they instead offered a 3-year salary grant. Normally, people cut the NGOs down but Ford was more than generous on their own.<\/p>\n\n\n\n<p>This was the turning point for CRY and perhaps the most crucial. Rippan’s decision to buy a place worked in our favor. It was loaded with well-thought strategic intent and direction. We now had the fundamental requirements in place to grow – Space, Infrastructure, and People.<\/p>\n\n\n\n<p>Ratan J. Batliboi: Rippan and I were in the same school and he was about 2-3 batches senior to me. We would often meet at the Interact Club, introduced in schools by the Rotary Club. The club included several extra-curricular as well as social activities, including doing things for the underprivileged – reading to the blind, visiting hospitals etc, and we were both active in that arena. After school, we used to bump into each other with common friends. He used to live just up the road from my home.<\/p>\n\n\n\n<p>The concept of CRY began in school when he felt that we should do something. We understood that we were all brought up feeling privileged. Anyone can feel more privileged than another, and everyone is underprivileged under someone else.<\/p>\n\n\n\n<p>One day, he came around the house and said, “I want you to become a trustee of the organization I am starting.” I said, ”Okay, what do you want me to do?” “Nothing, just become a trustee.” I agreed and that is how I became a trustee for CRY.<\/p>\n\n\n\n<p>I would help out a bit on gathering volunteers, or sourcing an image or finding other forms of resources.<\/p>\n\n\n\n<p>Rippan always wanted to be of service to something bigger. He was restless, a bachelor, had a decent income and had the time. He also made friends easily and knew people from different walks of life – from the slums to the wealthy. He traveled a lot and was aware of a lot of stuff in the world. The foreign travels influenced him with the value of clean and professional communications to get messages across. So he simply got on with it. Though I don’t think he imagined that CRY would become such a grand institution as it is now.<\/p>\n\n\n\n<p>Soon from an informal structure, we progressed to a formal structure and it all happened instinctively. When the name CRY was decided, it was correct because the name hit you between the eyes; it had a story to tell. The forces within the organization grew. A lot of fallouts from the advertising space came and joined CRY, and that helped with the clear messaged Rippan wanted to get across to the world. Most people at CRY were women; firstly, because at the time, they were second earners in their families, and secondly, they each wanted to do something spectacular with their time. The job was best handled with the help of professionals. We were becoming a national brand and soon rose to become one of the four leaders in the development space. We were becoming an institution and we needed to feel like one.<\/p>\n\n\n\n<p>At some point, we moved to a bigger space and we bought the Anand estate. No one ever imagined that we will have our own office, but we did. Soon, we bought more spaces around the compound and made it cheerful at low costs. But it took us a while before it got a robust infrastructure. It took us 20 years to get the office air-conditioned because many felt guilty about the expenditure. I believe that a sturdier institution is necessary to do good work. As usual, there were much-appreciated and interesting arguments for and against.<\/p>\n\n\n\n<p>Anand estate used to be an industrial gala, then it got gentrified – someone paved the road and someone painted the walls. People from this area used to mention ‘near Arthur Road jail’ as a landmark, now they say ‘near the CRY office’.<\/p>\n\n\n\n<p>When you become a landmark, you know you have done something great.<\/p>\n\n\n\n<p>Nandan Maluste: In 1988, when CRY had put together the ART for CRY event, Rajiv Gandhi came along for the event and promised Rippan that CRY will be declared an institute of national importance. It also entailed tax exemption under Section 35AC. Rippan got very excited and at the same time was worried if he had enough expertise to build and grow CRY. He put out the word to his friends to get more expertise and one day, I got a phone call from Namita Kundandas inviting me to work with CRY. Up until then, I had worked with Lintas Advertising as a finance director, then in Delhi, I was working as a consultant with the Ministry of Environment and the Indian Institute of Public Administration. Namita insisted I meet Rippan and I did.<\/p>\n\n\n\n<p>I, of course, was at the time a young man with multiple aims and ambitions in my head and one of which was doing work that had a social service context. Others included a corporate career and entrepreneurial ventures. I had only recently established a startup in Pune and wasn’t sure I could work with CRY full-time. I told Rippan my interest was Environment and not kids to which he replied profoundly, “Whatever dreams you have for India or the world has to benefit kids. So if you want to improve the world, you should do it through CRY. We have an open canvas, and we will do whatever it takes.” I wasn’t expecting that at all. I had been dealing with charities before the &#8216;NGO&#8217; word even became popular and most NGO entrepreneurs want to do things only their way, but here was this guy who was offering a place to do things my way as well. My next move of resistance was, I said, “You can’t afford me anyway, and I can’t work full-time with a daughter to support.” To which he said that they had a Ford Foundation Salary Grant and I shouldn’t worry about that. I had to move to Mumbai for the Pune venture that was on shaky ground and so I began spending some time at CRY and looking at the accounts.<\/p>\n\n\n\n<p>The first thing I did to get things in order was that we changed the auditor. If we are going to be an institution of national importance and with tax exemptions, we also need a reputable auditor. I had the misfortune of telling the existing auditor, a very nice man, that we were instead going to appoint Lovelock &amp; Lewes who later became a part of the Price Waterhouse network. CRY accounts were not too bad, but the systems were chronically out of date. Rippan and CRY were both stingy because we had little money. The office in which Rippan sat was a 300 sq ft rented space that was later purchased. But there was no fixed place for anything. The accounts department, for instance, worked out of a borrowed space at Warden Road. A lady, Mrs. Vacha had kindly allowed the accounts to function out of her home, from a dining table, on the condition that we couldn’t work before 10 am and after 5 pm. We were given the dining table for the books, and her garage to store our inventory. Come evening, we had to pack up and with all the files tucked away and it looked like CRY didn’t exist. She was a lovely lady and as generous as she could be, it was getting harder to function like that. Meanwhile, Rippan invited me to join the board and I became the Honorary Treasurer.<\/p>\n\n\n\n<p>Soon, Rippan in his usual resourceful way stumbled upon Anand Estate. In 1990, it looked nothing like what it does now. It was a messy rundown mill, literally as well as legally. But then I hadn’t yet discovered what a big legal mess Aakash Ganga was. I said to Rippan that if we are going to buy property in Anand Estate, we needed a solid lawyer and recommended Anand Bhatt. Anand Bhatt was one of the sharpest lawyers I had met. He had worked with HDFC and was well abreast of property matters. Once Anand got involved, things sailed smoothly. It was a complex transaction and if not for Anand Bhai, I don’t think I would have gotten involved. Having said that – Finally, from working out of homes and dining tables, scattered around Mumbai, we now had all our people in one place. The CRY office had come to life.<\/p>\n\n\n\n<p>Indira Pant: Until 1989, I worked as the Executive Assistant to Ratan Tata. Although I loved my work and was happy in that environment, I struggled to find meaning in my work. Maximizing shareholder returns did not inspire me in the slightest. Through a series of chance encounters, I met Rippan who asked if I would join CRY. I was wary – there was a child, not a faceless shareholder, at the other end of this job and I could not afford to mess it up. Rippan had a way of making you feel you were born to do this work, so I took the plunge.<\/p>\n\n\n\n<p>When I started with CRY, we occupied a tiny office in Aakash Ganga that was donated by the well-wishers of Rippan. The stench from the adjacent community toilet was unbearable. We also had storage cabinets mounted over our desks on which we’d routinely and painfully bump our heads. Through it all, we were truly grateful for this “donated” roof over our heads but we worried about how we’d cope if we had to leave. Over time, we realized that we had to have a more sustainable operation. We needed a secure home. Too many projects and too many children now depended on CRY. Rippan kept a tight rein on administrative costs, watching them like a hawk. He simply would not hear of diverting CRY’s funds to pay for premises. So we set up a Premises Fund that would draw in fresh donations to pay for a new office.<\/p>\n\n\n\n<p>Following the Great Bombay Textile Strike of 1982, several mills fell into disrepair and their cash-strapped owners began selling their properties at a huge discount. After wandering through several such mills and warehouses, we chanced upon a reasonably-sized first-floor space at Anand Estate in Lower Parel. Anand Bhatt, CRY’s friend, and lawyer negotiated the deal and we were able to raise the money to pay for it. However, just days before the deal was to be closed, Rippan excitedly announced that the owners had offered CRY an enormous room on the ground floor of the same building – and he’d accepted! There remained the small matter of paying for it. I can safely say that every one of us on the Premises Fund team was hysterical. But even though it was a harrowing few months, it was yet another example of Rippan’s immense foresight. The space allowed us to grow – both in terms of revenues as well as the support we could extend to our projects.<\/p>\n\n\n\n<p>After weeks of hard work and sleepless nights, we managed to raise all the money to buy the premises. However, the space required extensive renovation and we needed furniture as well. Rippan flatly refused to let us spend money on refurbishing the space. Fortunately, he was as resourceful as he was stubborn – he approached Sunita Namjoshi, a friend of CRY and a well-known exporter of home linen, for several hundred meters of colorful Madras Check fabric. From a builder, who was also a CRY supporter, he got high-quality plastic emulsion paint and Ratan Batliboi, yet another CRY well-wisher, organized carpenters and handymen. Soon all the walls were painted white and the furniture was painted in bright primary colors. Each section of CRY got a different color. The fabric from Sunita was pasted on to the fronts of the cupboards. Jute blinds that kept the sun out but let the breeze through completed the transformation. Within a few weeks, we had a cheerful and well-planned open office. We were finally all together under one roof and most importantly, the roof was our own!<\/p>\n\n\n\n<p>Rippan chose a table for himself strategically placed in a corner of the large ground floor space where he could keep a watchful eye on everything. From this vantage point, he would dream his next wild and wonderful (well, most of the time!) schemes for CRY or then play pranks on just about everyone. It was an exhausting and exhilarating ride – and I will forever remain grateful that Rippan took me on it!<\/p>\n\n\n\n<p>Mohammed Khan: Way before Anand Estate happened to CRY, there was Aakash Ganga. CRY, for a while, had been operating out of homes and dining tables and they realized that they needed an office.<\/p>\n\n\n\n<p>I remember Rippan came to meet me and said he needed to raise money to buy an office. “Oh O” was my reaction, this was going to be a tough one because people were not about to give money to buy offices. He said he needed about a couple of lakhs and asked if I could create an ad for it. He wondered if the Raju Ad &#8216;ask for 20 bucks&#8217; idea had worked so well, maybe we could do the same thing. I was not so sure. My gut feeling was that it was easier to get two lakhs from one person than 20,000 people. Rippan agreed to try it out. We did an ad and I don’t remember what it was but it was something along the lines of saying that if anyone had spare space, here was a great cause to offer it to. The next day after the ad was released, an old gentleman picked up the phone and gave him an office space at Akash Ganga. I remember Rippan was over the moon and I must say, it gave me a great deal of satisfaction.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Memory Contributor: Pervin Varma, Ratan J. Batliboi, Nandan Maluste, Indira Pant, Mohammed Khan Picture caption: (L to R Standing) Jyoti Paswan, Indira Pant, Rippan Kapur, Sheena Hamid, Khurshid Dabdi, Carol Nazareth, Sandra, Selma Abreo, Leslie, Manorama, Savio D’Souza, Rajashri Bansiwar, Gawde. (L to R Sitting) Shaila Malik, Anna, Kiran Mestry, Chinnam Gopinath, Srilatha Batliwala, Anupa [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1442"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1442"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1442\/revisions"}],"predecessor-version":[{"id":2833,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1442\/revisions\/2833"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1442"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1442"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1442"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}