{"id":1446,"date":"2020-09-03T10:04:49","date_gmt":"2020-09-03T10:04:49","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1446"},"modified":"2022-07-18T12:52:59","modified_gmt":"2022-07-18T07:22:59","slug":"art-for-cry","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/art-for-cry\/","title":{"rendered":"ART for CRY"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/art-for-cry.jpg\" alt=\"ART for CRY\" class=\"wp-image-1447\"\/><\/figure>\n\n\n\n<p>Memory Contributors: Sheree Carlos, Gitanjali Khanna, Regina Thomas, Pervin Varma, Bondona Dutta<\/p>\n\n\n\n<p>Picture Caption: Rajiv Gandhi and Rippan Kapur at the ART for CRY event. Jehangir Art Gallery, Bombay, 1988<\/p>\n\n\n\n<p>Sheree Carlos: In this photograph, I remember I was right there behind the then Prime Minister of India, Rajiv Gandhi. It was a very hectic day. The show opened on a Friday and then we were told that Rajiv Gandhi was coming. That news resulted in complete excitement but also the realization that we had to close the show for the day to the rest of the public. The gallery was shut down and security systems were put in place with barricades, and then the army came in. We also wore silly color-coded badges made of cardboard with a color system that was conjured up for security reasons. We all might look very calm and peaceful here but there was a lot of pushing around and people were all over the place. We, of course, leveraged the arrival as much as we could, with dignity. When the news made it to Doordarshan, we knew we had achieved our vision of reaching millions of people.<\/p>\n\n\n\n<p>The core funding for ART for CRY of Rs. 5 lakh came entirely from the TATAs, but it was a lot of work. We had to figure out the logistics for four cities. Each one of us handled a functional portfolio voluntarily: the artists, their artworks, catalogs, telephone books, mementos, taxes, and accounts. To ship the artworks was another huge task. It was the era of one airline – Indian Airlines and we had no budget for the freight. It was Rekha, who swung it with sheer persistence. We all believed in what we were doing and conveyed our ideas all across – like magic it all worked out. This was an event that had us feeling completely empowered and charged to do more.<\/p>\n\n\n\n<p>Gitanjali Khanna: Rippan was very clear that he wanted to have a huge impact and wanted to make CRY relevant to everyone. We couldn’t afford spending years on a project like Art for CRY and had only a few people see it. The idea was simple yet ambitious, and it had to be a high-quality show. We had to book the gallery, organize security, print brochures, and catalogs. We also hired more people to help us out with the show. When Rajiv Gandhi, the then Prime Minister of India, agreed to come for the show in Bombay (now Mumbai), it was a truly amazing moment.<\/p>\n\n\n\n<p>I remember the show opened on a Friday and Mr. Gandhi was to arrive the next day, a Saturday, so the traffic was less. We were briefed on his arrival, security, and the roads he would take to come to the Jehangir Art Gallery, but the plan turned out to be the exact opposite. That is how efficient the security was. The roads were closed and there were snipers placed in buildings near the gallery for his protection. It was all quite overwhelming. I dressed up in one of my best sarees.<\/p>\n\n\n\n<p>When Rajiv Gandhi was about to walk in, I pretended to be all blazé – “So what if the Prime Minister is coming?” But when he shook my hand, I remember my knees melting. He was a most charming man, he spoke well and gave a superb talk about the cause for children. Each one of us was given an art section in the show to brief him about. But he had so many hangers-on that it was tough to get his ear. All I remember now is that the gallery was fraught with an electric atmosphere. Almost all of the paintings were sold. The event made national news &#8211; it raised awareness as well as funds and we did receive a lot more than the huge impact Rippan had envisioned.<\/p>\n\n\n\n<p>Regina Thomas (with inputs from Pervin Varma): In Bangalore (now Bengaluru), we had the ART for CRY show at Chitrakala Parishath. As an honorary guest, we invited the Chief Minister of Karnataka. My neighbor was the CM’s secretary and our sons studied together so we convinced him to invite the CM. The CM would have later heard about Rajiv Gandhi at the Bombay show anyway so we were sure he won’t cancel. Selfishly, we also needed tax exemptions and hence a senior government official. ART for CRY was planned as a week-long exhibit in each of the four cities. Freighting and planning the show for the next stop took us almost a month each.<\/p>\n\n\n\n<p>The curation idea was all Rippan’s – it was going to be India’s first art show for a cause, with only Indian Art. ART for CRY brought together 122 Indian artists for the first time. Never before had all these artists ever been seen together. On display were 177 works of art and each piece was donated to CRY. For catalogs, we imported expensive paper (Yugo Art paper 200 gsm), and our printer, K.L Bhargava printed them for free. The artworks were collectively sold for Rs. 35 lakh that helped us form a corpus. It was a fabulous experience. It was so special that even the Jehangir Art Gallery sent their people to help us install the show. In another first, the art world and its critics featured a show in the press, that wasn’t organized by them.<\/p>\n\n\n\n<p>Bondona Dutta: For Rippan, nothing was impossible. When he conjured up the idea of ART for CRY, he had only about 5-6 people working with him in Delhi, Mumbai &amp; Bengaluru together, and Calcutta (now Kolkata) had no office at all. We had no designations, no visiting cards, and nothing about us said that we were an established NGO. Art exhibitions, too, were not everyday phenomena like they are now. But for Rippan and us, it had to be done.<\/p>\n\n\n\n<p>When we approached artists like Anjali Ela Menon and Arpana Kaur to donate their works for the show, they had already heard of Rippan and referred to him as a ‘passionate boy’. Many artists agreed to give us their works, purely based on their instincts. I remember carrying several expensive paintings in an auto-rickshaw to our space in Gautam Nagar. Now we needed to get sponsors for many other things such as transport and catalogs, etc.<\/p>\n\n\n\n<p>Rekha Vohra who worked with us knew people in the government because of her past associations with the diplomatic circles, and I think through her, Sheree Carlos and Tara met with Mani Shankar Iyer and Jaya Jaitley to invite Rajiv Gandhi to come for the show as well as for tax exemptions. I, on the other hand, didn’t know anyone and it was not easy for me to talk to corporate people or the government.<\/p>\n\n\n\n<p>We met with Godfrey Philips to sponsors the exhibition. The marketing head was nice and gave us Rs. 15,000. But I also remember that he advised us to carry visiting cards and that designations mattered. I think right after that, we came up with the idea of calling ourselves ‘Co-ordinators’.<\/p>\n\n\n\n<p>To transport the artworks collected from Delhi to Mumbai, we needed packers and movers. One packer quoted Rs. 2 lakh and we were aghast. Then we found another who said that at a lower price, he will provide us with two workers but we had to buy our packing materials. Rekha got some thermocol and paper from Chandni Chowk and for the next two-three days and nights, we only packed artworks. Then we hired Prakash Travels to transport them to Mumbai.<\/p>\n\n\n\n<p>After a successful show in Mumbai and then in Delhi (at the Lalit Kala Academy) the show went to Kolkata. We all stayed either with relatives or in clubs. I remember when the Indian Airlines flight carrying the show cargo came in, Kolkata saw its worst rains in decades and we watched helplessly as our cartons got drenched in the open airfield. When the rain gave us some respite, we took them in, opened each packet, switched the fans on, and realized that some of the works had been damaged. With only a day in hand to mount the show, we got Jatin Das’s painters to help us restore the paintings.<\/p>\n\n\n\n<p>Thankfully, the ART for CRY show in Kolkata also went off well. We had several volunteers who worked with us, mounted the show, installed big banners, announcing the show, and each publication in West Bengal wrote about it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Memory Contributors: Sheree Carlos, Gitanjali Khanna, Regina Thomas, Pervin Varma, Bondona Dutta Picture Caption: Rajiv Gandhi and Rippan Kapur at the ART for CRY event. Jehangir Art Gallery, Bombay, 1988 Sheree Carlos: In this photograph, I remember I was right there behind the then Prime Minister of India, Rajiv Gandhi. It was a very hectic [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1446"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1446"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1446\/revisions"}],"predecessor-version":[{"id":2832,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1446\/revisions\/2832"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1446"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1446"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1446"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}