{"id":1450,"date":"2020-09-03T10:10:06","date_gmt":"2020-09-03T10:10:06","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1450"},"modified":"2022-07-18T12:52:43","modified_gmt":"2022-07-18T07:22:43","slug":"we-refined-the-greeting-cards-venture-into-an-art","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/we-refined-the-greeting-cards-venture-into-an-art\/","title":{"rendered":"“We refined the greeting cards venture into an art.”"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/we-refined-the-greeting-card-venture-into-art.jpg\" alt=\"CRY greeting cards\" class=\"wp-image-1451\"\/><\/figure>\n\n\n\n<p>Memory Contributors: Gitanjali Khanna, C.S Mahesh, Ingrid Srinath<\/p>\n\n\n\n<p>Picture Caption: The first greeting card designed by graphic designer and artist, Sanath Surti, Bombay, 1983<\/p>\n\n\n\n<p>Gitanjali Khanna: My mother-in-law’s best friend was Rippan’s mom and our families were very close. I remember in 1982, Neera (Rippan’s sister) called me up to say that Rippan is all fired up about forming an organization; since it was a fledgling organization, he couldn’t hire full-time professionals yet, and she asked if I’d work with him part-time to get it going. My children were in a full-time school and so I had some time. I had also worked as a nursery school teacher earlier but hadn’t worked since, hence at first, I was hesitant but Neera insisted I try and I relented.<\/p>\n\n\n\n<p>Rippan rented an apartment at Giriraj, Altamount Road in Mumbai as a working space. Working in it were four of us – Rippan, me, an old retired accountant, and a young woman Nirmala, who was an efficient stenographer &amp; a secretary rolled into one. The three of us were at first literally like the blind, the deaf, and the mute because except for Rippan, no one knew what we were doing. But it was a happy atmosphere and we improvised. The spare bedroom was made into an office, the bed was used as a filing cabinet. I had a desk and there was a dining table for general use. That’s how we began to plan the first set of cards with only two to three designs. The first press was in Prabhadevi and later, we used the press that belonged to the Poonawallas. Each one of them worked with us sans any conditions.<\/p>\n\n\n\n<p>Rippan was all gung-ho, ready to get me involved full swing but I was holding back and said, “Look, I don’t know anything about selling cards!” and he exclaimed with confidence, “No problem, you just come along with me everywhere and we will learn. You have to get content (art) for future cards&#8217; production, sell them, and get donations.” With great diffidence and hesitation, I agreed and began going with him to museums and art galleries. We met with art collectors and asked if we could use their collections, photograph the paintings, and reproduce it on cards and calendars for CRY. We also roped in photographers and studios to photograph the artworks. Some of the people we met were in high positions in large companies. I was in awe of the reception and response from people when they’d simply agree without question, and my confidence grew. Even when we met the artists themselves, it was the same. They were kind, inviting, and most generous with their works for CRY. We got permission to use works of the top artists of India and some would even create works especially for CRY. When I think of it now, I don’t think the top artists of today would do the same.<\/p>\n\n\n\n<p>I remember once Rippan sent me to meet the managing director of Hindustan Levers (HL, now Hindustan Unilever). A huge corporate collection exhibition organized by Hindustan Levers at the Jehangir Art Gallery was on display at the gallery. The managing director of HUL was passionate about art and had collected works for the company. So I went up to him, told him about CRY, the cause, and what our request was. I also told him about a painting that struck me as a perfect fit for the cards – A beautiful painting of a mother and child. He said that it was a Jamini Roy. I wondered if I could have Jamini’s address and that is when he knew I didn’t know much about art because he said, “Well, I can’t give you the address because he is up there.” pointing to the heavens. Like that, I made many a faux pas but I learned a lot and it was great fun.<\/p>\n\n\n\n<p>Over the next few years, we met and found works of M.F Husain, KK Hebbar, Anjolie Ela Menon, Badri Narayan, Souza, NS Bhendre to name a few, and they all responded with sheer enthusiasm. They would show their works, have tea, and talk about the world. Soon I even surprised myself with the fact that I could recognize artists’ styles.<\/p>\n\n\n\n<p>In the office, more and more great people began to work with us, some with a high-quality professional experience like Sheree Desai and Tara Sabavala. They had left high paying jobs to work with CRY and anyone who would give up so much to work with a cause could only enhance the complexion of an organization like CRY.<\/p>\n\n\n\n<p>From Giriraj, we soon moved to Aakash Ganga, a building that was initially meant to be an artists’ hub and was founded by the Bhulabai Desai Trust. However, it began to slip from its agenda and was in complete disrepair and we got a tiny nice room for cheap. On the same floor, there was a hairdresser, a photographer, and an exporter, with one PCO telephone booth for everyone, at the end of the building corridor by the staircase. The staircase was fraught with activities of electric repairs and people. Considering all my work involved making phone calls to meet people in high positions, this was going to be a problem. So every few days, I would receive a bag of 50 paisa coins from the accountant to make calls from the corridor by the staircase. Dressed in my cotton saree, I would get a chair, sit with my appointment diary, and make the calls. With electrical work going on, the telephone also gave electric shocks so one had to be ever-so-careful. It was a balancing act, quite literally.<\/p>\n\n\n\n<p>Meanwhile, CRY was growing leaps and bounds. From cards, we graduated to calendars and notebooks, and with more donations, we could help more people. One of the big realizations was that one can’t help children unless their mother is also helped, and so the scope of our work increased in vision too. Rippan believed in the cause and with every new realization, got himself out of the way. There was no quest for glory, and that has since stayed with me. I used the same thing in my future work – I got myself out of the way and got great results. My work involved discoveries all the time, my horizons widened and I gained confidence in everything I have done since. I may have done some work with CRY, but CRY has given me a lot more than it knows.<\/p>\n\n\n\n<p>Ingrid Srinath: The first day I walked into the CRY office at Anand Estate to meet Pervin, I saw two people sitting at the table cleaning the greeting cards with cotton wool. It seemed to me that they were polishing the greeting cards. I thought that to be very strange.<\/p>\n\n\n\n<p>The greeting cards&#8217; business at the time used to employ a total of 100 people. Ranging from people who ran warehouses production, logistics, accounts, sales, transport, and delivery. We were importing paper from Europe and commissioning the print to third parties. It was a proper manufacturing operation. However, there was a big problem, while we had people employed on a yearly pay-roll, we earned revenues only three months a year – from September to December. At the time, only businesses sent festive greeting cards. The rest of the country was not into the &#8216;sending greeting cards&#8217; culture. The numbers were simply not adding up.<\/p>\n\n\n\n<p>In 1991, C.S Mahesh, a former Procter &amp; Gamble brand manager joined in 1991 and he professionalized the whole CRY greeting cards and merchandise business. After he left, there was no competence around to manage the business, and meanwhile, the market changed – it became more competitive, from printing to freight, everything became more expensive. The business gradually made itself unworthy and something had to be done. We could of course shut the operation down or franchise it further as we had done with the Citibank Credit Card or license the CRY brand to somebody who understood the merchandise business. It made sense to outsource the department because we didn’t want to invest in an infrastructure that we did not have the skills to manage. It was decided that we must collaborate with someone who was already in the business and would fit the brand for CRY.<\/p>\n\n\n\n<p>I remember, one day, ITC (Tobacco) came to the office and said that they were getting into the greeting cards business and that they’d like to co-brand it with us. But there was no way we could attach a tobacco brand to a children’s brand. Nonetheless, I entertained the negotiation for a while and learned what would it cost us to run a proper greeting card business. Soon we found two matches, Hallmark and Archies. Hallmark wasn’t doing well so we focused on Archies.<\/p>\n\n\n\n<p>Mr. Moolchandani was the head of Archies. He was the most interesting and wonderful man. In the 1970s, Mr. Moolchandani got into the business of printing western songbooks with lyrics and guitar chords, when you could not get western music in India very easily. He knew that playing the guitar was a rage those days. Once he understood how to print and distribute his material, he began printing posters of rockstars, which were everywhere, and then he got into greeting cards. In India, he popularised Valentine&#8217;s Day, Mother’s Day, and Friendship Day. He took great pride in his work. When we met with him, he understood CRY immediately and saw us as kindred brands. He was exceptionally keen to do business with us and that helped me negotiate with him ferociously. I remember it was a great meeting and we all walked away with a great deal and partnership. My logic was that as long as we break even, it was still something worth doing. Even when we downsized, Archies hired the people we had to lay off.<\/p>\n\n\n\n<p>C.S Mahesh: I was working in Proctor &amp; Gamble as the marketing head on several of its products and I remember that I used to get cards all the time and many of them were CRY cards. CRY was not a consideration for a job at the time but I wasn’t enjoying my job anymore. The corporate life was not making sense and I wondered about my options.<\/p>\n\n\n\n<p>Indira Pant (nee Rajadhyaksha) was my senior at St. Stephen&#8217;s and I had heard that she had joined CRY. I was very curious about that move and one day, I impulsively called her at the CRY office and then hopped across to see her. I spent a half-hour and asked her what prompted her to leave the TATAs. It was a tough decision to be able to afford CRY with a small salary but around the same time, I got engaged, and since my wife was also working, it was easier on me. In 1990, I joined CRY to run their Cards Division.<\/p>\n\n\n\n<p>The CRY Greeting Cards division was a big thing. It overtook UNICEF cards in sales, partly due to patriotic feelings of supporting a national organization and partly charity. We also had good printers committed to supporting CRY and they delivered quality at competitive rates. Geetanjali Khanna sourced all the artists and she had this wonderful ability to connect with anyone she met and would convince them to donate their works to CRY. The cards business helped CRY make a lot of its money and it had grown organically. Indira had joined the year before and she had a background in planning. She had also put some commendable processes in place but due to lack of support, logistical, and marketing expertise, it was a messy operation. In fact, it took me a long time to realize how disorganized the process was.<\/p>\n\n\n\n<p>The thing with running a products&#8217; division is that unless you manage the backend well, you make little money. There were a lot of paper products with around 50-80 designs, and also prepared custom designs for corporate clients. We spent about three months in Mumbai placing newer systems and then went to Bangalore, Chennai, and Delhi and to understand and change how the sales were done. Very quickly we managed to resolve all backend issues like stock, printing, logistics, and customer support. We got a designer, Viloo, to work with us. Raman and Srini joined us with printing experience. Putting the catalog and the cards together was one hell of a task but once the sales got organized, and Indira got time to plan productions. We even convinced Rippan, much to his disdain, that we sell our cards through retail. Rippan hated the fact that we had to part with 20% margin on retail sales, whereas my background in retail ensured that I trusted them. Soon retail exploded and business took off. We had refined that business into an art.<\/p>\n\n\n\n<p>Soon every NGO decided to get on to the bandwagon and asked artists to donate works for their cause. After a while, I think all the artists got tired of it. I remember, we even invited the principal of Davos College to run a telephone etiquette training for customer service. After that, it was amusing and admirable at the same time to watch Rippan call customer support to check if they picked up the phone after three rings.<\/p>\n\n\n\n<p>After Indira left in 1991, and though I wasn’t running the show, I was looking after donations and the Bombay operations. Pervin and I even worked on the annual reports, brand manual. Prassanna who was my junior at IIMA ran the planning. Very soon, we had around six MBA graduates working with CRY, and there was so much interest in the press over that because it was unheard of. I think I gave more interviews in CRY than in P&amp;G.<\/p>\n\n\n\n<p>In 1993, I left CRY. One, because I could not afford to work there anymore. Secondly, my equation with Rippan had turned unpleasant. He wasn’t agreeable with several decisions I had to make, especially when his health was failing him. While our goals were the same, it became frustrating.<\/p>\n\n\n\n<p>To keep refining and improving the program support is an ongoing challenge for CRY. It must do so, to keep its word to the world. What works in its favor is that CRY was and is fiercely independent. It does not follow anyone, moreover, CRY would help people when no one else would help.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Memory Contributors: Gitanjali Khanna, C.S Mahesh, Ingrid Srinath Picture Caption: The first greeting card designed by graphic designer and artist, Sanath Surti, Bombay, 1983 Gitanjali Khanna: My mother-in-law’s best friend was Rippan’s mom and our families were very close. I remember in 1982, Neera (Rippan’s sister) called me up to say that Rippan is all [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1450"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1450"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1450\/revisions"}],"predecessor-version":[{"id":2831,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1450\/revisions\/2831"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1450"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1450"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1450"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}