{"id":1454,"date":"2020-09-03T10:26:42","date_gmt":"2020-09-03T10:26:42","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1454"},"modified":"2022-07-18T12:52:33","modified_gmt":"2022-07-18T07:22:33","slug":"the-right-to-education","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/the-right-to-education\/","title":{"rendered":"The Right to Education"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/the-right-to-education.jpg\" alt=\"The Right to Education\" class=\"wp-image-1455\"\/><\/figure>\n\n\n\n<p>Memory Contributor: Subhasis Chakrabarti, Pervin Varma, Bondona Dutta (Bondi)<\/p>\n\n\n\n<p>Picture Caption: The Right to Education March, Lucknow, Uttar Pradesh, January 2001<\/p>\n\n\n\n<p>Subhasis Chakrabarti: This photograph was taken by me from atop a hotel. This was one of the happiest days for me; a culmination of so many efforts by hundreds of people. After finishing a course in Rural Development from Xavier’s Institute of Social Service in Ranchi, I moved to Delhi with a job in Deepalaya. At the time, CRY was supporting Deepalaya and I was regularly in touch with the people from there. When I left, Bondi offered me a job at CRY and I became the first professional in Development Support at CRY, in August of 1990.<\/p>\n\n\n\n<p>In 1995\/96, I was promoted to State Manager, Uttar Pradesh (UP) and we were supporting 40-45 projects. In UP, child labor was a prevalent issue, mainly in the Mirzapur and Bhadoi area. We were working with the projects to release children as bonded labor from the carpet industry. But I also knew that I couldn’t do it alone so the idea of forming alliances came up. I wrote a concept note, met with some partners in Somvadhra, and later in Allahabad, to formalize it. Professor B.N Juval was a lead figure working in the area of child labor and he too joined us. A small committee was formed to design the constitution and we named the alliance – ‘Voice of Partners’ (VoP). Over the next few weeks, we organized a conference about the alliance, defined its personality as a people’s organization, arrived at a 6-10 point charter, and discussed what the partners will do, and how the program will work.<\/p>\n\n\n\n<p>At the same time, in consultation with Shefali Sunderlal who was heading the Development Support unit in Delhi, we created a forum at a partner-organization level. The idea quickly began to percolate across our partners in 14 states and even more alliances were formed in the VoP program. The movement was becoming stronger. At the ground level, our partners identified the interested groups and communities who wanted to work together because everyone knew that child labor is not an isolated issue and is linked with the livelihoods of adults and children alike. We began by demanding land for the landless. A lot of local landlords possessed land illegally and we adopted a political route to reach our goals. We organized protest rallies, wrote letters to the Chief Minister, and worked against the corrupt patwaris (village accountants).<\/p>\n\n\n\n<p>One incident I remember was that around 250 acres of tribal land was illegally possessed by a local landlord. So we mobilized 80 families from the tribal belt to come together and take over the land. More than 250 women <em>gheraoed<\/em> the land and their husbands, the farmers, plowed the land with 80 plows. The land was given to the families on the condition that they will release their children from the carpet looms. They agreed, but then they didn’t have the money to cultivate the farm, so we formed an agriculture bank and provided them with seeds and basic farming infrastructure, also on the condition that they will return the cost of all, once they began earning. We also initiated a small campaign in the area that was called &#8216;Hisaab Chaahiye, Hisaab Do&#8217;, in which we calculated what was owed to the child by the carpet looms. We sent letters demanding the release of the children to the carpet looms and organized protest rallies. After a month, 119 children were released with no conditions, and the campaign spread. Within 3-4 months, 2000 children were released from the neighboring districts.<\/p>\n\n\n\n<p>Similarly, we went to Shankargarh (40 km from Allahabad), bordering Madhya Pradesh. There was a lot of tribal labor bonded to the mining of Silica sand in 42 illegally possessed mines. The local landlord was a man called Raja Sahib. There were schools in the area but weren’t active. The teachers would sign in only to get a salary and disappear. We then mobilized the tribe. We locked the schools and when the teacher came to get his salary, we locked him up too. Our demand was &#8211; run the school or you can’t sign for a salary. We also demanded that the mines should be owned by the workers and we succeeded in both. I remember asking a 55-year-old woman from the tribe, Surajkali: “Do you know when is Independence Day.” She replied, “I don’t. But I know our independence is when we win the battle.”<\/p>\n\n\n\n<p>We got a lot of support from NAFRE (National Alliance for Fundamental Right to Education, now NAFRE – Jan Andolan) and in the duration, we also lost some of our people who were murdered by the local goons. The case went to court, we filed a PIL, we won the case and all 42 mines were captured. Within eight months, the workers deposited Rs. 2 lakh to the government of UP as revenue of Silica sand; money which the landlord himself never paid.<\/p>\n\n\n\n<p>NAFRE itself, however, needed to be stronger because they were not being able to bring a change in the amendment; we needed different kinds of people and communities on it. So I formed even more alliances in the country across 14 states. They all became members of NAFRE and created a stronger voice, and we were able to bring a change in the amendment. Many people from other states came to learn from VoP and started similar programs in their states. VoP had a solid structure: It had a secretariat, and then an executive council, and every 3 years, we had a conference where we’d identify more issues and demands, and organize rallies.<\/p>\n\n\n\n<p>When the Right to Education march was organized in Lucknow (the capital of UP), it was a strategically-chosen place so that the government would listen. The march and the conference were fabulous. Thousands of people came for the march and I was flabbergasted. A lot of intellectuals and the Vice-Chancellor of the University of Lucknow also came. I was shouting slogans so long that I almost lost my voice. The crowd even picked me up and placed me on the stage. Thousands of hands were waving to me with gratitude and love. It was humbling.<\/p>\n\n\n\n<p>The change in CRY’s vision from Relief to Rights began with education. I remember Sony George made the Child Rights grid. The grid was a matrix covering all four rights of children – the right to education, health, protection, and participation, as well as direct actions to be taken by children, communities, parents, policy influence, and advocates. We then distributed our endeavors across the partners’ programs. When we began work in UP on child rights, I was involved in everything. But I soon realized that mere changing of policies and start-ups was not a permanent solution and there had to be structural changes in the country-wide systems, societies, and the constitution. When you talk about rights, it&#8217;s connected to the constitution of a country. We scoured the constitution to see what was there and what needed to be amended in policies and our laws. Laws can only come when policies are put into action. We began ground up, organizing workshops across all offices in CRY, identifying the correct partners to spread the word across the country. At CRY, we realized we had to work on all the rights simultaneously because all rights are linked. We could not do much on the ‘Right to Participation’ but the other three worked.<\/p>\n\n\n\n<p>Raising money is difficult when it comes to child rights. There are no tangible products to sell, for instance, how can one sell a ‘right to development’? We were all keen and tried our best but I am not sure how many of us managed to become serious advocates.<\/p>\n\n\n\n<p>Pervin Varma: Until 1999, education wasn’t a formally discussed fundamental right. It all began with a bold initiative by Pratham whom we co-funded with other entities. Pratham brought in a Memorandum to the Government and got eight funding agencies, including us, on board, to propose the act. We then brought on 200 partners to the table. Several of the partners fell away as well because the process was tough and quite political, but then there was no other way to address the issue.<\/p>\n\n\n\n<p>I remember our teams (with Subhasis being the ringleader) went from village to village, educating people on the draft bill, what it was about, and what it could do. We had to inspire people with hope and to tell them that no government would pass anything if they didn’t show up in numbers. Moreover, creating awareness on the bill meant they stood abreast and aware of what to do next when it comes into force. The communities would know what to do, how to get, and build schools.<\/p>\n\n\n\n<p>A day was decided and in each state, they organized <em>dharnas<\/em> (non-violent sit-in protests) but no one expected what was to happen in Lucknow, Uttar Pradesh. In retrospect, yes, we had the largest network there and they even got more partners to follow and build an even sturdier network. I remember I reached Lucknow a day early before the slated march on January 9, 2001. The Kumbh Mela was taking place at the same time. It was so cold that I think I must have had ten layers on me. The next morning, we got the news and were told that the trains were shut down and our heart sank and thought no one would turn up. But to our big surprise, 17,000 people came! Unlike an election rally, not one person had been paid. This was a lot more than we expected! There were people from all walks of life – people who were daily wage earners and had given up their daily wages for that day, old and young men, women, and children. There were people barefoot, in thin sarees, and wearing torn kurtas. Upon news of the numbers, the media too arrived in hoards and asked people why they had come. The citizens in the march told them about every element in the proposed bill. The day the bill was introduced in the parliament, we were all in Delhi, and 25-30,000 people arrived from all over the country to support the bill. There was a 70-year-old man who had come from the deep south, and a BBC journalist asked him, “Why are you here?” and he said, “I am here for my grandson”.<\/p>\n\n\n\n<p>The event in Lucknow gave us the confidence to invest ourselves in large issues and the knowledge that communities will come out to support anything if it matters. They know exactly how to fight for their rights and our job was to give them the right knowledge and direction.<\/p>\n\n\n\n<p>Bondona Dutta: I remember this event so well. There was so much excitement in the air. We had worked on it for 5-6 months at full speed and managed to mobilize all of our partners. As usual, we were always short on money, and not many of our partners or alliances were registered so it was hard in the beginning to find and connect with them. Pawan Rana was one guy who helped us connect to more people. When we planned the walk, we wondered about several issues including ones like how long could old people and women with children walk or should it be 3 km or 5. Bringing in so many people together was not an easy task even though it was most exciting. People are generally scared of rallies and protests, nonetheless, we involved the government, media, and panchayats; we went shop to shop requesting them to be ready with snacks and water. We got so many people involved to help us out with the preparations, including families of people who were working on the ground.<\/p>\n\n\n\n<p>Subhasis’s wife Sushmita, for instance, never really knew what he was up to and he was all over the place meeting people, organizing new meetings, hopping, skipping, and jumping from village to town to city working away on a project or this rally. Even when his own house got demolished, he wasn’t there. For this rally, he invited his wife to help out and perhaps even see the impact of the work she had contributed to, indirectly, with her patience with him. Sushmita, I remember, was simply amazed. People loved Subhasis, hundreds buzzed around him, everyone knew him, they even lifted him to the stage to applaud him. It was the first time she got to see what her husband had been up to and must have been so proud.<\/p>\n\n\n\n<p>I remember Pervin climbing atop on roofs, watching thousands of people walking the rally. She was like a child, awestruck by what had been achieved. That day, I think, we all must have walked around 10-11 km. The power of the people was amazing.<\/p>\n\n\n\n<p>It was not just a rally, it was a purpose and every effort was made to ensure that the education bill was passed.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Memory Contributor: Subhasis Chakrabarti, Pervin Varma, Bondona Dutta (Bondi) Picture Caption: The Right to Education March, Lucknow, Uttar Pradesh, January 2001 Subhasis Chakrabarti: This photograph was taken by me from atop a hotel. This was one of the happiest days for me; a culmination of so many efforts by hundreds of people. After finishing a [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1454"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1454"}],"version-history":[{"count":6,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1454\/revisions"}],"predecessor-version":[{"id":3027,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1454\/revisions\/3027"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1454"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1454"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1454"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}