{"id":1458,"date":"2020-09-03T10:31:43","date_gmt":"2020-09-03T10:31:43","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1458"},"modified":"2022-07-18T12:52:19","modified_gmt":"2022-07-18T07:22:19","slug":"doing-good-is-also-good-for-the-brand","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/doing-good-is-also-good-for-the-brand\/","title":{"rendered":"“Doing good is also good for the brand&#8221;"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/doing-good-is-also-good-for-the-brand.jpg\" alt=\"Jacob Kurian's Story\" class=\"wp-image-1459\"\/><\/figure>\n\n\n\n<p>Memory Contributor: Jacob Kurian, Former CEO, Titan Company Ltd. (with inputs from Regina Thomas)<\/p>\n\n\n\n<p>In 2002, two young employees from Rolls Royce had this crazy idea of doing a Microlite flight from the Farnborough Air Show in England to India. Originally, Rolls Royce was to be the sponsor but since TATA had been toying with the idea of aviation for a while and Rolls Royce was perhaps trying to establish a partnership, somehow the proposal landed in Titan and on my lap, and someone in the company thought we should sponsor it. From the time I lived in the US until I returned to India, I had liked the idea of companies adopting good causes. In the USA, I would watch companies go the whole nine yards when it came to supporting causes – merchandise, CEOs flipping pancakes etc, however in India, it was a tedious and dull CSR activity and usually, the most dispensable person would be given these projects.<\/p>\n\n\n\n<p>Even though the TATAs have had a great track record of supporting charitable causes, in most TATA companies, the involvement of an average employee in such projects is low. They feel proud but they don’t do much or don’t find the opportunity. At the time, there wasn’t even a mechanism to facilitate employees to get involved. So when the Microlite proposal landed through what I can only call serendipity, I was interested. I had a deep desire to try these things that could energize people and get all of a company’s competencies and talent involved exactly like a business objective. Maybe we could use this to build some good deed equity and create awareness on a good cause in our own country.<\/p>\n\n\n\n<p>We decided to collaborate with an NGO that had credibility. We had all heard about CRY, the most credible institution in the area of child rights (till today). We reached out to them and began discussing the many things that we could do around this project.<\/p>\n\n\n\n<p>We also reached out to our business vendors, collaborators, communication agencies, and even the graduates of the National Institute of Design, and were pleasantly surprised that anyone we reached out to agreed to work with us on the project gratis. We were lucky to get Neville and Josy Paul to come on board to help us brand it and design all the interesting merchandise around it, like cut out planes, T-shirts etc. Within the company, instructions were clear that no one could be given time off and we had to invest our spare time and do it. And again, as a pleasant surprise so many employees volunteered – including their spouses, friends, and partners.<\/p>\n\n\n\n<p>The flight plan was charted out to land and take off from several places because they could only fly some hours and needed to stop often. At every point that they landed, we and CRY together created a buzz of the event and CRY galvanized their regional areas to bring children and parents to the event and watch the plane take off and land. Even the two pilots were very interesting people. They were funny, inclusive, and articulate. They even blogged about their travels in India. It was the most successful and exciting event. I remember my daughter sitting on my shoulder and watching them fly.<\/p>\n\n\n\n<p>To mark an end of a remarkable journey in India (their flight was to take off from Mumbai and fly back to England), we also decided to organize celebratory dinners in three cities – Delhi, Bengaluru, and Mumbai. It all seems routine now, but in those days, it was new. The idea was to sell tables to top corporate houses and the proceeds will be donated to CRY. The Taj Hotels agreed to organize the dinner and venue at cost and to make it worth everyone’s while, we also had some entertainment, and celebrity hosts, a rather novel idea at the time. We had Jackie Shroff in Delhi and Raveena Tandon at Mumbai. We also reached out to some more top-notch performers of the country through the CRY network like Nrityagram, Jagjit Singh, Usha Uthup, and Pandit Jasraj.<\/p>\n\n\n\n<p>For its time, the event raised a large amount of money. It was big money for CRY and we raised Rs. 75 lakh just in the south. We called it The Titan CRY Education Fund. We selected some of the CRY programs that we wanted to contribute to, and a separate bank account was established only for the funds via this event.<\/p>\n\n\n\n<p>Over the years, we had several small and a few big collaborations with CRY. The Tata Council of Community Initiatives was one. It was an attempt by TATA to galvanize their regional companies to collaborate with local causes and communities. But for a while, this collective set of Tata companies had managed to donate only 8 sewing machines. When the time came to be serious, we called in CRY as advisors to our company and brainstorm on ideas. One of the things we narrowed down to a problem we could help solve – a lack of public spaces for urban kids to play and learn.<\/p>\n\n\n\n<p>My daughter at the time used to go to Balbhavan for the train ride and was always thrilled about it. But there was nothing else much there. I used to think there was so much potential but it wasn’t being put to good use. We met a bureaucrat who agreed to support us with that space. We planned the project in three phases but due to subsequent interference from the government, we managed to complete only one. The project successfully met the criteria – creating assets, the involvement of NGOs etc, but unfortunately, it never went on to phase 2 and 3.<\/p>\n\n\n\n<p>Logically, CRY may not have seemed like a perfect brand fit but we knew that they did good work, had good thoughts, and did good deeds. And I come from the school of thought that if companies think of more than commercial objectives and collaborate with good causes, it earns them respect and equity that is otherwise almost impossible to earn. Doing good is also good for the brand. It certainly was for Titan and CRY.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Memory Contributor: Jacob Kurian, Former CEO, Titan Company Ltd. (with inputs from Regina Thomas) In 2002, two young employees from Rolls Royce had this crazy idea of doing a Microlite flight from the Farnborough Air Show in England to India. Originally, Rolls Royce was to be the sponsor but since TATA had been toying with [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1458"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1458"}],"version-history":[{"count":4,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1458\/revisions"}],"predecessor-version":[{"id":2753,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1458\/revisions\/2753"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1458"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1458"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1458"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}