{"id":1462,"date":"2020-09-03T10:35:21","date_gmt":"2020-09-03T10:35:21","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1462"},"modified":"2022-07-18T11:12:33","modified_gmt":"2022-07-18T05:42:33","slug":"whatever-we-are-today-we-owe-it-to-that-first-cheque","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/whatever-we-are-today-we-owe-it-to-that-first-cheque\/","title":{"rendered":"“Whatever we are today, we owe it to that first cheque.”"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/whatever-we-are-today-we-owe-it-to-that-first-cheque.jpg\" alt=\"Story of Shantha Sinha\" class=\"wp-image-1463\"\/><\/figure>\n\n\n\n<p>Memory Contributor: Shantha Sinha<\/p>\n\n\n\n<p>Picture Caption: Shantha Sinha, MV Foundation with Rippan Kapur, Founder, CRY in Janwada, Karnataka, 1993<\/p>\n\n\n\n<p>The picture of Rippan and me in Janwada, Karnataka is very special to me. It was photographed in 1993, upon a field visit to an MV Foundation project, our organization. Outside the photograph, it also has my father Mr. Anandam sitting on the left, who was the Chairman &amp; Managing Trustee of MV Foundation, and Ms. Usha Sriram who continues to be our Finance Officer. It was a visit to our Residential Bridge Course Camp and I recall vividly how excited we were for this very special visit. At the time, CRY was supporting us to mobilize communities in Shankarpally Mandal (Rangareddi district, Telangana) in 15 villages. The people who accompanied Rippan from CRY were Roy, Shefali, Sony, and Vasu.<\/p>\n\n\n\n<p>I am a product of the 1960s which was an era of optimism and radical politics, and it was hard for many of us to not be drawn towards the idea of making a difference. I remember I used to teach “Rural Politics” at the University of Hyderabad, lecturing on caste, community, and rural lives, but I had never seen a village in my life! So I began going to the villages around the University for me to make sense of what I was teaching. I discovered soon that the poorest villages were the ones that had bonded labor and that 40% of them were children. There was no organization in Andhra Pradesh working with the issue of rights and so it inspired me to begin working on the area of Abolishment of Bonded Child Labour. I began an association with Shramik Vidyapeeth, an extension of the University of Hyderabad whose mandate at the time was adult education. Within it, I established a new area of child labor.<\/p>\n\n\n\n<p>I remember around 1987 or 88, we had just withdrawn the first batch of children from bonded labor and we put them in a small temporary hut with rations. But we were a small organization and ran short of funds. To top it all, we were also not very clear on what we had to do next. Around the same time, I saw an advertisement in The Illustrated Weekly of India for CRY Greeting cards which said that the proceeds are for helping children. I didn’t even know what CRY or who Rippan was, or that they were a donor. We just sort of knew that they support children and maybe they could help us out too. On a whim, I wrote to them and said that we needed Rs. 30,000 because I had these children and wondered if they could do something to help us with the program. To my surprise, within two weeks, we received a cheque for Rs. 30,000 made out to Shramik Vidyapeeth. These days, you have to fill up intimating forms, write a hundred details and you still won’t know if you will get the funds, and to simply receive money based on a letter that I, a stranger, wrote to them, was too exciting. That is how our first association with CRY began and I think whatever we are today, we owe it to that first cheque.<\/p>\n\n\n\n<p>Considering that CRY had advertised in The Illustrated Weekly of India, one of the top magazines at the time, I had assumed that CRY was a huge corporate organization. Later when I went to Bombay (now Mumbai), I was so pleasantly surprised to find that they were all like me; ordinary people trying to do some good. They too were groping and figuring out what to do with our respective entities, exactly like us. So there was this feeling of camaraderie, empathy, and warmth from the start. CRY and I had both begun our work at the same time, we were both evolving and learning to institutionalize our efforts simultaneously. So our relationship flourished like a great partnership, we were on a parallel track of learning to grow. Rippan was not feeling too well at the time and we were hoping things were not too serious. I felt that people like him and organizations like ours must go on and it was perhaps selfish of me to scold him one day that he needs to take care of himself for the sake of the work we do.<\/p>\n\n\n\n<p>In 1990, CRY and I went through a challenge together. With my term ending at the University, I had to leave Shramik Vidyapeeth and move to a smaller and new organization, MV Foundation. All this while, CRY had been supporting Shramik. It must have been tough on them to negotiate if it was ethical for them to shift their alliance to another organization just because of me. But eventually, it did work out because Shramik Vidyapeeth’s mandate was to work with the adult workers&#8217; education program and I was the only one trying to do the children’s work.<\/p>\n\n\n\n<p>For MV Foundation too, the first donor was CRY. We re-started the work with a new set of 5-10 villages and it was a very exciting period. Because of CRY’s support, other organizations too began to come forward and help us with our cause; after all, an alliance with CRY was like an accreditation. By 1996, we had become big and CRY’s support was essential for us to realize the truth about child labor and poverty – ‘Poverty does not cause child labor, child labor causes poverty’ was our big understanding and insight. I owe it to Rippan and CRY that they too felt it was important work and that they decided to trust me. Moreover, I never thought of CRY as a donor, they called us partners. Their job was to fundraise and ours was to do &#8211; it was never like that. We were truly equal partners working towards the same cause.<\/p>\n\n\n\n<p>I loved CRY most at the time when they made a transition from Child Relief &amp; You to Child Rights &amp; You. There was a lot of maturity in that thought. Although they were not politically inclined, they knew it was time to talk about rights and entitlements. It was a significant shift.<\/p>\n\n\n\n<p>I think it was the very next year that I met Rippan again in Raichur, Karnataka, and noticed how unwell he looked, and of course, later his loss was deeply felt. CRY went through a transition after Rippan passed away. But he had left behind a very strong team and they were getting more professional. And since, I too was trying to separate my own identity from the MV Foundation’s, we were sympathetic to the changes. Great institutions had to hold their own and not depend on founders. He was so passionate and emotional, and to do something as boring as institutionalization, I wonder if today, he would still be attached to it. Because to build an institution, you have to put aside emotion and warmth and he wasn’t like that. Nonetheless, he laid the foundation of a very strong organization, built a very strong team and they took his vision forward. He left behind a wonderful and long-lasting relationship with CRY, for which I am very grateful.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Memory Contributor: Shantha Sinha Picture Caption: Shantha Sinha, MV Foundation with Rippan Kapur, Founder, CRY in Janwada, Karnataka, 1993 The picture of Rippan and me in Janwada, Karnataka is very special to me. It was photographed in 1993, upon a field visit to an MV Foundation project, our organization. Outside the photograph, it also has [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1462"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1462"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1462\/revisions"}],"predecessor-version":[{"id":2828,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1462\/revisions\/2828"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1462"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1462"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1462"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}