{
  "id": 1473,
  "date": "2020-09-03T11:35:15",
  "date_gmt": "2020-09-03T11:35:15",
  "guid": { "rendered": "https://testsitestaging.cry.org/?p=1473" },
  "modified": "2022-07-18T12:50:36",
  "modified_gmt": "2022-07-18T07:20:36",
  "slug": "the-three-ceos",
  "status": "publish",
  "type": "post",
  "link": "https://www.cry.org/blog/the-three-ceos/",
  "title": { "rendered": "The three CEOs" },
  "content": {
    "rendered": "\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"/wp-content/uploads/the-three-ceos.jpg\" alt=\"Three CEOs Stories At CRY\" class=\"wp-image-1474\"/></figure>\n\n\n\n<p>Memory Contributors: Ingrid Srinath, Puja Marwaha, Pervin Varma</p>\n\n\n\n<p>Picture caption: Ingrid Srinath, Puja Marwaha, Pervin Varma. CRY Corporate Responsibility Summit 2013, Mumbai</p>\n\n\n\n<p>Ingrid Srinath: I did an MBA and was buying time to figure out what I wanted to do. After 12 years in market research &amp; advertising, in 1998, I was just profoundly bored and spent the last two years like a zombie – so much so that I was going for meetings without having prepared for them and it didn’t feel right. It wasn’t right for my clients or my team, the agency, or the stakeholders. It was time to leave. But I’m not very good at figuring out the next step while I’m doing the current work. I usually sever my ties and think of fresh canvas. And that’s what I did! I quit and mopped around wondering what I could do next. My husband got tired of it and asked me a breakthrough question – ”When did you last have a great sense of accomplishment?” Oddly, what came to mind was a spastic child with whom I had been working at the Spastic Society. Clearly, some work with service would be worthwhile.</p>\n\n\n\n<p>CRY just happened to be the place with people I knew. I had known Pervin from Lintas (now Mullen Lowe) and Indira Pant was my husband’s predecessor at TATA. People like me had been in CRY and it worked for them, it wasn’t a completely alien domain. It also understood brands, use of brands, marketing &amp; communication so I could see some relevance for my skills. I couldn’t do NGO work such as administering vaccines, I had no skills for that.</p>\n\n\n\n<p>In 1998, there was an advertisement in the Economic Times for a Regional Director (west) to which I responded and I got in. It was a general management position that involved running all the functions – from programs to resource mobilization to finance, HR, admin, and the sales of the greeting cards. As a member of the managing committee, organizational policy, and strategy, I got to play a bigger role in the marketing side of things. Pervin’s brief to me when I joined was simple – ‘Create a fundraising system that does not need Ingrid to run it’. That way, we could spend more time innovating rather than trying to meet budgets. When people can merely meet budgets, it is tough to stay hungry. I took the brief very seriously. I am not very good with routine work and enjoying the breeze while things run smoothly. I need things to change constantly because I get bored. When a resource generation person would ask, “Ingrid, why must we do 40 crores and I would exclaim, “because it’s there to be taken!” The idea that you would just sit back and enjoy the view was not my cup of tea.</p>\n\n\n\n<p>From 1994-1998, CRY had been strapped for finances. In these four years since Rippan’s death, CRY had spent all its energies keeping itself together, at the cost of the external world. They stopped looking at new and different as they used to. Moreover, it showed in the numbers, and for me, the numbers are the most powerful story. The incomes plateaued off, the costs were rising, we were losing funding to other entities. The re-inventing and re-energizing mandate took a while. CRY had to establish internal credibility to get back into action. Then you had to sell the plan to everyone on the board, leadership team staff donors, implement it, and make sure that it was working, so the course could be corrected if there were any issues.</p>\n\n\n\n<p>The changing of CRY from Relief to Rights entailed changing what was essentially an ‘urban middle-class compassion-driven response to poverty &amp; equality’ to a citizens&#8217; movement based on rights and entitlements in the forms of work advocacy and campaigning. To see Relief to Rights change finally happen was a highlight for me in my life at CRY. The changes had already begun on the peripheries of the organization, by Subhasis in UP. Radical ideas like that allowed new visions to incubate. We restructured everything – from the logo to the management process, the grammar, and the communication of events, internally and externally. It was a pretty cool thing to be a part of! It was grueling because it meant day and night of hard work. I remember Ila and I were locked up in the room for seven days. A lot of people were going to lose their jobs because of the restructuring, so we had to be thorough and sure with every detail. We sat with people and conversed one on one. But finally, when the presentation was ready, we showed it to the management committee and after their sign off, we had to present to the board. It was a relief to see that it went through.</p>\n\n\n\n<p>Face-to-face fundraising was one of the systems we initiated. It was a scalable way to raise money. After some analysis, we identified that the reason 82% of people don’t give money was inertia. We then decided to get professional fundraisers to help us out. It was a departure from doing it ourselves. Cobra was a company (later known as APCO, then Support Direct) came to us for the job and ran a pilot with us for three months. It broke the inertia and was cheaper than direct mail. We raised a lot of funds. I didn’t want CRY to be an army fundraiser and it was a great decision. We were the first or at least an early adopter in the game.</p>\n\n\n\n<p>We had a website since 1990 but it was only in 2000 that we got ourselves a payment gateway. We negotiated a payment gateway with Citibank because they had a good backend. We got the Ford Foundation to invest money like any entrepreneurial venture. The online payment system worked wonders, I remember, to our surprise, someone deposited Rs. 6,23,000 online. We tracked it down to a French gentleman living in Singapore and asked him why he did it. Turns out, he had been talking about India’s problems with friends and got depressed. He recalled seeing the Starlight Logo on a greeting card, found it online, and made the donation. The cards had their impact, it reminded people of the brand. I think Sangeeta Kapila also ran Google Ads in Portuguese and donations started coming in from Brazil. I became the CEO in 2004 because Pervin was after me and yes, several problems could only be solved at the top. If it took to be a CEO to fix things, so be it. By 2008, ten years had passed, and I realized I was getting bored again. CRY too needed a different set of skills and I decided to leave.</p>\n\n\n\n<p>I have been very fortunate in the people I had the opportunity to work with. There were many debates and arguments but everyone contributed valuable information without trying to control it. I have also had the opportunity to present the organization on a global level. Peggy Rockefeller got CRY to be written up as a case study. CRY was presented at management institutions around the world &#8211; IFC, XLRI, Insead etc. CRY was not a ‘cute not-for-profit’ story, it was a serious business approach worth emulating around the world and has since changed the way not-for-profit sectors work. Maya Ajmera, who runs a global fund for children once said to me, “If Rippan built this organization with Rs. 50, and with no prior formal education on the subject, so could I.”</p>\n\n\n\n<p>An interesting story of CRY’s impact on my personal life – While I was in South Africa, I happened to meet Archbishop Tutu. We talked about the work with CRY and became close friends. He even insisted that I call him by his first name “Tutu” which I clearly couldn’t – but every year since we exchange virtual hugs on Christmas. None of that would have happened if it was not for CRY because no other organization could have provided that platform. CRY is truly an incredible institution, one of a kind, I don’t know anything else like it.</p>\n\n\n\n<p>Puja Marwaha: The idea to work in the social sector, occurred during my Post Graduation at Xavier’s Institute of Social Service in Ranchi. The institute, like many others in the 80s and 90s, had a strong service bias. I remember once they sent us to a village and that was my first experience of poverty. I was brought up in a small town in the public sector where poverty was not in our faces. Poverty only hit me when I moved to Bombay, a city where it was everywhere and so was the wealth. I worked in the corporate sector for a while – in a software company, but soon got very tired and wondered about what I was doing. My husband could support us for a while so I quit. I tried to work in several NGOs but got thrown out of everywhere.</p>\n\n\n\n<p>In June of 1994, one day, an old friend whose center was funded by CRY recommended that I meet with CRY. I had been trying to get in touch with them but CRY itself was going through a tough time, with Rippan’s death. So maybe that is why there was no forthcoming interest in new hires. I asked for a Human Resources (HR) department and they said, “What HR, we don’t have HR!&#8221; Finally, when I got a meeting at CRY, they asked me what I did. I said I worked in HR and they said, “Oh HR! Come, join, and set an HR department for us.” They also said that they had advertised for the job and since they had spent money on it, they must look at candidates. In corporate-speak, that means you are not that good. I was so arrogant! But then, they called to say that I was hired &#8211; I was amazed by their sheer honesty. In September of 1994, I joined CRY.</p>\n\n\n\n<p>They knew little about HR but they let me work it out. I was such a kid at the time and they ensured that I have a mentor called Vijay Padki from Bangalore. I decided that the first thing to set up was the salary structure. Up until that time, people were being given salaries rather randomly. These were the times when I got to learn about the internal working of CRY. I remember, I needed some data on the employees and was met with silence. Initially, I was furious but realized later that the silence was because they hadn’t understood my request. I calmed down and described what I wanted in a very simple, layperson manner. At CRY, people are mostly self-taught, they learn by experience. They won’t do anything just for the sake of it, it must add to the vision. At corporates, these exercises are taken for granted and most don’t even know why they are doing what they are doing. I have never seen an organization take a Performance Management System so seriously and that too, with no rewards attached to it.</p>\n\n\n\n<p>By 1996, I got adopted into the first ManCom. I was the HR person and they were amazing. I have little memory of a formal induction, I was learning a lot on the job. But soon, I could see problems in the organization and it was beginning to feel a little stodgy. While individually, everyone on the ManCom ran their functions superbly well. For an organization-based decision, even as little as approving a performance letter, it had to be approved by all of them together. Shefali set up the Development Support system and enabled a new financial monitoring system for CRY. Pervin was watching over the extraordinary Child Watch project and Resource Generation. But any decision for the overall organization took too long. It was quite impractical and began to slow us down on the joint areas of action. I used to love the ManCom meetings. We used to stay up all night and work like maniacs. I had never seen anything like this within corporates, it was joyful, they didn’t seem to be bogged down for all the work, and above all, they all loved each other. I had begun to feel that they loved each other so much that they couldn’t confront each other.</p>\n\n\n\n<p>I began to feel strongly about the delays in the joint areas of action. Nonetheless, the problems did not escape the ManCom either. They brought in Anil Chaudhry for an IB exercise (Institution Building). They began evaluating themselves, as well as all problems in the area of Development Support. That was my big attaching moment to CRY. I got to know all the wonderful impact CRY had had on the world. It was humbling as well as overwhelming. I also realized we were two CRYs, ‘a Janus-faced organization’, I remember christening it. There were privileged people in it, with cars, art, high society and mostly all were in Resource Generation, and on the other hand, there were also earthy, simple, employees &amp; partners, who worked on the field, in rural areas in the Development Sector and they were emotionally bonded with CRY. They felt partnered, not funded, and thought of CRY as a warm organization. The evaluation in the Development Sector went so well that we decided that we must do it for Resource Generation. But I got very upset and intuitively figured out what was off. I plucked the courage and said to the ManCom that this departmental evaluation will break it up and requested that they do it for the whole organization instead. We worked with both the worlds within CRY and began to bridge them so that both worked together for a better impact. One needs all kinds of people to have a bigger impact.</p>\n\n\n\n<p>The ManCom also decided to evaluate their functions. And this time, C.S Mahesh was invited to run the IB process. They discussed their grievances which involved losing Rippan, leadership in CRY, etc. CRY was so traumatized by Rippan’s passing that they wouldn’t sack anyone. They would protect and preserve all for the fear of losing more. Simply put, they were getting in the way of themselves. They finally selected Pervin. In 1998, after Pervin became CEO, the first thing she and Janaki did was to create a Performance Management System but it was rejected by the Development Sector initially as they regarded it as a corporate concept. Pervin had already been instrumental in great changes within CRY and as the CEO, she was even better. She brought in new and extremely experienced people like Ingrid Srinath. For me, it was a great time as I got to learn from both the older people at CRY as well as the new. The old had experience and the new ones had all these exciting ideas. However, in 2000, I had to move to South Africa due to my husband’s transfer.</p>\n\n\n\n<p>I remember the high point was the 25th anniversary. Ingrid Srinath was like a lioness that day. By 2005, she had gotten everything organized, we were making money and ticking away like a well-oiled clock. People had made peace with their issues. It was beautiful and to top it all, I was made Regional Director. Such happy times they were. But then Pervin announced that she was quitting and I wept the whole evening. I don’t think until this day she knows what she meant to us.</p>\n\n\n\n<p>After I returned from South Africa in 2008, is when I saw the division between the old CRY and new CRY happen. I believe that we need both the old and the new to become an even greater organization. However, as things go up, they also do come down and CRY was again on shaky ground. The trustees then decided to select a new ManCom and re-work our value systems. Many people were purged, some survived the purge and some didn’t, and I was invited to be the CEO. I took months to decide but finally in 2009, I joined and got Yugita on as the RD. Ingrid had left us with one of the best gifts – a board of great trustees. She also got Pervin re-involved with CRY. I remember Janaki asking me, “Why do you want to be CEO?” I said, “They want me!” Then she asked me the same question again – and I understood what she was asking me. I said, “I have the energy and I am strong to do this job.” Questions like these helped me. It helped me evaluate my intention, goals, value systems, as well as a new vision for CRY. This image in 2013 is a symbol of our struggles as well as our achievements.</p>\n\n\n\n<p>Pervin Varma: I remember someone telling us (perhaps it was Amita Kapur), that Rippan was once told that CRY will be in the hands of women. I was thinking of that when I saw this image. Truth is that he always encouraged the women in the organization and perhaps even trusted them more to take care of CRY.</p>\n\n\n\n<p>Most organizations have serial CEOs, one person after the other, however, at CRY all three of us in this picture had worked together quite closely. Puja had come in to set HR when Rippan had just passed away. She and I worked very closely on the institution building. Ingrid joined in 1998 and we worked together over big strategic shifts and transitions within the organization.</p>\n\n\n\n<p>Interestingly, all three of us in this image had also been the heads of the Mumbai office at different times. In a way, it was a good training ground for the next role to take on. What struck me as well was that I was the only one who had known Rippan, and yet each one of us has carried Rippan’s legacy on with deep care. He was and is still a big influence on each one of us. Truth is that whether one had met Rippan or not, once people walked into CRY, they encountered the essence of his vision and ideas deeply. All three of us have shaped things not just from our points of view and ideas, but have also celebrated the very essence of the organization.</p>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p>Memory Contributors: Ingrid Srinath, Puja Marwaha, Pervin Varma Picture caption: Ingrid Srinath, Puja Marwaha, Pervin Varma. CRY Corporate Responsibility Summit 2013, Mumbai Ingrid Srinath: I did an MBA and was buying time to figure out what I wanted to do. After 12 years in market research &amp; advertising, in 1998, I was just profoundly bored [&hellip;]</p>\n",
    "protected": false
  },
  "author": 1,
  "featured_media": 0,
  "comment_status": "open",
  "ping_status": "closed",
  "sticky": false,
  "template": "",
  "format": "standard",
  "meta": { "_mi_skip_tracking": false },
  "categories": [14],
  "tags": [],
  "acf": [],
  "_links": {
    "self": [{ "href": "https://www.cry.org/wp-json/wp/v2/posts/1473" }],
    "collection": [{ "href": "https://www.cry.org/wp-json/wp/v2/posts" }],
    "about": [{ "href": "https://www.cry.org/wp-json/wp/v2/types/post" }],
    "author": [
      {
        "embeddable": true,
        "href": "https://www.cry.org/wp-json/wp/v2/users/1"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https://www.cry.org/wp-json/wp/v2/comments?post=1473"
      }
    ],
    "version-history": [
      {
        "count": 6,
        "href": "https://www.cry.org/wp-json/wp/v2/posts/1473/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 3024,
        "href": "https://www.cry.org/wp-json/wp/v2/posts/1473/revisions/3024"
      }
    ],
    "wp:attachment": [
      { "href": "https://www.cry.org/wp-json/wp/v2/media?parent=1473" }
    ],
    "wp:term": [
      {
        "taxonomy": "category",
        "embeddable": true,
        "href": "https://www.cry.org/wp-json/wp/v2/categories?post=1473"
      },
      {
        "taxonomy": "post_tag",
        "embeddable": true,
        "href": "https://www.cry.org/wp-json/wp/v2/tags?post=1473"
      }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
