{"id":1477,"date":"2020-09-03T11:39:17","date_gmt":"2020-09-03T11:39:17","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1477"},"modified":"2022-07-18T12:47:47","modified_gmt":"2022-07-18T07:17:47","slug":"an-organisation-is-the-skeleton-muscles-of-a-body-and-the-institution-is-the-blood","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/an-organisation-is-the-skeleton-muscles-of-a-body-and-the-institution-is-the-blood\/","title":{"rendered":"“An organisation is the skeleton &#038; muscles of a body, and the institution is the blood.”"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/an-organisation-is-the-skeleton-muscles-of-a-body-and-the-institution-is-the-blood.jpg\" alt=\"Journey Of The Partners\" class=\"wp-image-1478\"\/><\/figure>\n\n\n\n<p>Memory Contributors: Ila D Hukku, Bondona Dutta, Pervin Varma, C.S Mahesh, Janaki Venkat Narrative by Bondona Dutta<\/p>\n\n\n\n<p>Picture caption: ManCom 1997<\/p>\n\n\n\n<p>Bondona Dutta: After Rippan passed away in 1994, for a while we were all lost. Ami (Amita Kapur) who was the successor had to leave due to personal problems and it was a huge struggle to find out who will be the next Director. We also struggled with the idea if we should have a ManCom (Management Committee). It is tough to make any good decisions when you are not empowered. We looked at each other for some direction but everyone was grieving and it was to be an uphill task. Rippan had left CRY in our care, but suddenly we didn’t know where to begin. Each decision was taking too long and we didn’t have the confidence. There was a big fear of taking decisions and the fear of working together. In 1997, C.S Mahesh and Janaki Venkat helped us change that by understanding each other.<\/p>\n\n\n\n<p>When the extended ManCom meeting happened, it shook us up. For many of us, introspection was a new concept. I remember we talked with each other about a ton of issues, personal and professional. We also did exercises such as Rock Climbing and it gave me so much courage. I remember when Regina climbed up and came down, her face was lit up like a child who had achieved something great. A long story cut short, we realized we each had to take on responsibilities and nominate a CEO as the leader. I felt we needed to look at someone who will align with everyone and who makes their views secondary. I recommended Pervin and everyone agreed.<\/p>\n\n\n\n<p>Ila D Hukku: Our ManCom meetings used to take place every quarter. To me, an organization is the skeleton and muscles of a body, and the institution is the blood. The institution is the belief that powers the body to move. It is the essence of the organization. Once Pervin became the CEO, the process to build a solid institution came up, and we managed that with the help of Mahesh and Janaki.<\/p>\n\n\n\n<p>I remember Pervin said (and I agree) that we had to simply re-learn how to perform better. We had different people, each with their responsibilities on critical functions and roles in CRY and there had to be a meeting of all these minds. At that juncture, the smoothening of the levels hadn’t happened, the designations were mismatched. Things inside the organization were getting muddled up.<\/p>\n\n\n\n<p>People, for example, were looking for resource generation but only as individuals and not as a whole. We began to build and sharpen our objectives, performance reviews, and plans. The real purpose was to use these ManCom platforms to see and tighten our approach, our businesses, and see how we had to contribute to CRY in an aligned form. We needed all perspectives to match any particular situation. We came from different backgrounds, with different levels of experience. We unpeeled the layers of hierarchy and experience and delved into how we related to one another. It was a painful process because it was like shedding skin, but it so worth it in the end. Many couldn’t deal with the emotional turmoil, and some walked away, but it was the foundation on which the leadership group found their compassion for each other.<\/p>\n\n\n\n<p>One of the things I was attracted to at CRY was the sense of camaraderie. There continues to be that spirit in the organization. Despite the differences, the wars, and the battles, there was a strong bond, a psychological contract that we had with CRY. If anyone got lost in the maze, it also allowed one to come back to the fold, without feeling rejected. It can become frustrating when things don’t work out our way. We once sat and wrote down the reasons why some of the people left and realized that if they lasted the first year, they would last a three, and if they survived that they were likely to be around five. People didn’t depart CRY so easily.<\/p>\n\n\n\n<p>By the time we got to a larger and extended ManCom, everyone found it logical that the organization needed to set bigger goals for itself. And with those goals, each could find their direction within CRY. Any other place this strategy could be a tough sell, but in CRY we found it easy to dream of larger objectives.<\/p>\n\n\n\n<p>The organization took a massive risk when Shefali moved to America and Pervin recommended that I direct the Development Support function. I knew nothing about that role, but Pervin’s reasons were that the team already had the knowledge and I could help them organize their ideas in a corporate-like fold. It made a lot of sense and the burden that I needed to know everything was off. With the Development Support role, we began the exercise of strategic planning for CRY. Ingrid Srinath, Pervin Varma, and I worked together on that and after presenting it to the ManCom, we began to formulate the shift from Relief to Rights.<\/p>\n\n\n\n<p>Development sector work was already partly oriented to rights-based work. After a strategy got presented, it led to the name change. Of course, there was a lot of experimentation around rights-based work in our folio. But since the leadership was aware of all the pitfalls, they were patient with how the strategy was unfolding and developing.<\/p>\n\n\n\n<p>CRY at the time was earning\/raising a significant amount through individuals and corporates. But the events were becoming expensive. Our merchandise too was hived off and only a small amount of royalty was coming in. Our strategic process included re-looking at revenue. We formulated a newer financial revenue model to align with our strategy and our principals, which led to the articulation of the vision and the mission. We strategically put systems in place and from top to bottom – soon, from the organization to the region to function and then to individual goals, each person could see how they were contributing to CRY. One allowed the other to happen. It is a unique quality about CRY that it is able to see the larger and the smaller picture together.<\/p>\n\n\n\n<p>Pervin Varma: The leadership transition process was addressed albeit meekly, just before Rippan passed away. We had been, for a while, a simple and loose matrix structure. Indira and C.S Mahesh were instrumental in setting up CRY as a professional organization, with regional heads like Regina and Bondi. Rajashree and Chinnam handled Development Support and Rippan was the Head.<\/p>\n\n\n\n<p>Only in 1992 did some of us get to know that Rippan was very unwell, and Ami (Amita Kapur) took over as VP and set up a revised ManCom, but then Rippan got better and dismantled the group. He was very possessive about CRY and when he felt threatened, he would dismantle structures in it; though if he trusted you, he would offer a long rope. Towards his end, he began to feel disconnected for he knew that he will not be able to fight the illness. In 1993, he invited my uncle, Sam Varkey, to come in as a director, with the hope that he would take on CRY as his own.<\/p>\n\n\n\n<p>But it was difficult and there were a lot of conflicts within. By the end of 1993, Mahesh, Prasanna, and Jyoti quit CRY. The entire top management was gone, and that is when Ami (Amita Kapur) came and recommended that we should manage CRY as a collective. She came to Bombay and helped us build a collective leadership (including a second line, a first among equals role). It was nerve-racking considering we were all juniors, but considering we ran a big event called Bal Sawaal and raised 27 lakhs, it was a sign towards a good step.<\/p>\n\n\n\n<p>With Ami as VP, Shefali, Anupama, and I came on to the ManCom as the leadership team. But Ami was also going through a difficult time &#8211; she had just adopted a child and with Rippan’s death in April, by the end of June, she simply couldn’t handle it. My uncle also left and we were left in a lurch yet again.<\/p>\n\n\n\n<p>The years 1994 to 1996 were tough. The Trustees got Bal Bhagvat as Director (former Secretary Youth of India), but that too wasn’t a fit and he didn’t even last a year. Then we went to the Board and said that we would like to manage it as a collective. Along with grief and the mess at CRY, we felt that we needed to consolidate and straighten up ourselves and CRY first.<\/p>\n\n\n\n<p>To help us begin an evaluation of CRY and ourselves in 1995-1996, we brought in Anil Choudhary and he facilitated a process to achieve that. We organized internal workshops in each region with partners, discussing feedback, directions, and our future. The process went on for a year, after which we understood our position. Our processes got revised to capacity-building.<\/p>\n\n\n\n<p>At first, we were dead against advocacy but then 200 of our partners pushed us because we were, after all, the only national organization in the country. Soon, we went from a funding organization to facilitating the empowerment of communities. But as a collective, we were beginning to slow down, and Puja Marwaha recommended that to create speedier processes with new shared values, we needed to re-evaluate the whole organization and not just some units. She made a strong presentation to ManCom and we then went to C.S Mahesh to help us make the change from relief to rights, within CRY. He recommended that to re-build CRY with new energy and goals, we start with leadership. In January of 1997, he brought in Janaki Venkat who played a critical role in CRY’s transformative process.<\/p>\n\n\n\n<p>The beauty of my entire experience with CRY was that when we needed specific input and skills, we found the right people. For instance, when the Trustees were getting impatient with the five of us as a collective, we brought in Jonathan Pinto from Arthur Anderson to evaluate us and it all led back to leadership. In one day, we then planned the whole restructuring of the organization. Of course with new values and goals, five people in leadership needed to become 10, but certainly not as a collective. That is when then they asked me to become CEO in 1998.<\/p>\n\n\n\n<p>The day we announced that I was taking over, it was a significant day. We had to now suddenly expand. We got in Ingrid, lla, Anuja, Rig, Simon, Puja, and Mamta as the second line and I was first among equals. But we worked together relentlessly for almost two months, to resolve everything.<\/p>\n\n\n\n<p>Janaki Venkat: If I am not wrong, I think the photograph with five women was taken by me. It is endearing to see it after so many years have passed by. My background experience is in HR and in 1990, I left the corporate sector to work as an independent consultant. After having a baby and by 1997, I was trying to get back to work when Mahesh, whom I had known since 1990, recommended me to work with him at CRY as institutional building consultants and process facilitators. A larger level of intervention had been invited.<\/p>\n\n\n\n<p>I remember the day I walked into the training session. I didn’t know what to expect! I landed up in a saree at Aksa Beach where some cottages were lent by CRY friends as a training retreat. Suddenly I see a woman walking up in track pants, with four dogs ahead of her and four behind. She introduced herself as Bondona (I think the only time Bondi used her full name). Then I met more people and felt so over-dressed, everyone was in track pants and T-shirts. I think by the evening, I too had borrowed someone’s track pants and a t-shirt.<\/p>\n\n\n\n<p>But this picture again is significant for many reasons. The CRY before this was not keeping well. Rippan had died only a few years ago, and they had no director. They had been managing for a while as a collective, but that model had stagnated. They wondered about how to lead it and manage it better. They didn’t have a clear sense of what was needed, but then neither did we. As external consultants, we too began to learn about CRY, its ancestral impact, the group, and individual narratives. Only then we began working toward new and shared identity, visions, and missions. To chart a path beyond Rippan and his dreams was a huge ask of them. CRY was stuck. We then identified the blocks and began to help them recognize the power of group decisions, embracing conflicts, and disciplines of working with a collective. We also traveled to all the CRY offices to help strengthen their psychological contract with the organization and the institution.<\/p>\n\n\n\n<p>This was a photograph taken at the time when CRY made a new and empowered announcement at ISI. Pervin was to be the CEO of CRY. Today, this picture also signifies to me the growth and the journey these five women went through at the time and since. This is when they decided that CRY will forge ahead and not wonder at each step what Rippan would have wanted. This is a moment in history for CRY.<\/p>\n\n\n\n<p>I am always astounded by how CRY has wrestled with itself and come through with its mission. It is an important part of Rippan that gladly remains – CRY and its people want to experience their cause in the most tangible and heartfelt way possible. I haven’t come across many organizations that do that.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Memory Contributors: Ila D Hukku, Bondona Dutta, Pervin Varma, C.S Mahesh, Janaki Venkat Narrative by Bondona Dutta Picture caption: ManCom 1997 Bondona Dutta: After Rippan passed away in 1994, for a while we were all lost. Ami (Amita Kapur) who was the successor had to leave due to personal problems and it was a huge [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1477"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1477"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1477\/revisions"}],"predecessor-version":[{"id":2825,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1477\/revisions\/2825"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1477"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1477"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1477"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}