{"id":1481,"date":"2020-09-03T11:42:30","date_gmt":"2020-09-03T11:42:30","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1481"},"modified":"2022-07-18T12:47:36","modified_gmt":"2022-07-18T07:17:36","slug":"the-kapur-family","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/the-kapur-family\/","title":{"rendered":"The Kapur Family"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/the-kapur-family.jpg\" alt=\"The Rippan Kapur Family\" class=\"wp-image-1482\"\/><\/figure>\n\n\n\n<p>Memory Contributor: Neera Kapur<\/p>\n\n\n\n<p>Picture caption: The Kapur Family, Bombay, 1990<\/p>\n\n\n\n<p>This photograph is probably the only image where the family can be seen together. Vippan (left) and Rippan (third from left) are twins and so similar looking that sometimes, even I got confused. It was taken at a party in Bombay.<\/p>\n\n\n\n<p>My mother, Mrs. Jai Kapur, and father, Mr. Purshotam Kapur, were both from Lahore (now in Pakistan) and after partition, their families moved to Delhi. My mom’s family lived in Chandani Chowk and dad’s in Karol Bagh. After they were married and we were born, that’s where we spent our early childhood days. My father dealt with cars and then worked with the Grindlays Bank for which he moved to Bombay (now Mumbai). Our mother was a housewife and later felt she wanted to do something worthwhile. She was a great cook and started a small catering business in Worli Naka. She supplied food to several small offices around Bombay.<\/p>\n\n\n\n<p>I was the eldest and the twins were born 15 minutes apart. Our childhood was crazy, mainly because of the twins. Rippan was particularly naughty. I remember my mother would dress them differently to identify them but Rippan would change clothes to look identical so he could go out, play and confuse the identity. I studied at Walsingham House school and the boys went to St. Mary’s School in Byculla. After school, they went to different colleges and studied further, and I went to Sophia’s and later took a secretarial course. Right after college, Vippan pursued a career in the hospitality business, and Rippan joined Air India and became a purser.<\/p>\n\n\n\n<p>In Worli, we lived on the ground floor and behind our home was a slum. I remember it would upset Rippan when he was eating something and the children from the slum would watch longingly. Sometimes he would mumble, “How can I sit here and eat when this boy can’t afford to!”. Clearly, it was the beginning of an idea that would bring him far. He traveled a lot and got to see and learn much more. When the concept of an organization crept up, he would discuss the idea with many and soon it became the centre of every discussion. Rippan soon realized that he had to make a difference and he couldn’t do it alone. While the idea was to help children, the emphasis was on how to get people involved in helping them. The concept was simple &#8211; it was asking us to make a change and convincing us that we could, and it didn’t have to be only money. It was as early as while we were in school as I may have heard him mentioning a need to do something. He even began a scheme with empty milk bottles to raise money, though I don’t remember what it was.<\/p>\n\n\n\n<p>It was no surprise to anyone of us when he decided to crystallize his plans. He began supplementing his efforts with his income from Air India. He got five of us on the board to establish an NGO and we began operations from our dining table. He had no thought of himself and never wanted glory. It would upset him when our mother praised him in front of other people.<\/p>\n\n\n\n<p>Initially, I was working with a bank and then established a placement service on my own. Meanwhile, CRY was growing. I quit and joined Rippan in his cause. I love children too and for me, it felt like the right thing to do. There were no strings and it was simple, but it wasn’t easy to manage CRY. Slowly from under the dining table, our papers began to pile up and we had to move to an acquaintance’s garage. Interestingly enough, a lot of help came in all shapes, sizes, and forms, and it showed us that it was the right idea that was moving in the right direction. Rippan was always inspired, and even if we disagreed, he would persist. My mum was a big influence &#8211; she saw what it meant to him and was very supportive. Everyone in the family, and even the extended family, was influenced and gave their blessings.<\/p>\n\n\n\n<p>The Aakash Ganga room also happened by chance because Rippan used to go for a haircut across the building. When he requested a space, no one could say no to him. He was so passionate and he spoke to hearts. Rippan knew what he wanted CRY to become but he wasn’t very organized. But what he did was give a solid foundation to the people involved in CRY, not something that could be shaken off. He, too, grew emotionally and spiritually with time. People did begin to have problems with him later but that was primarily because he was in a hurry and no one knew why until the last minute. Soon he couldn’t give too much time to people at CRY because he was going to the hospital often. I don’t know if he spoke to people about it but it became obvious that he wasn’t doing well. Nonetheless, he continued to work and was still flying with Air India until his health allowed because I still remember receiving back-dated salary cheques after he passed away. Even when he was in the hospital, he was working on CRY. He simply never stopped.<\/p>\n\n\n\n<p>Rippan was wise and smart and always found people who were good. Once he talked to you, you were convinced that you had to work with CRY. Even the ones who broke away, it took a lot for them to finally take that step. When I resigned as a trustee, he could see that I would not be involved. By then, CRY was very well settled and it didn’t need me. But it was a group of great people and their selflessness through thick and thin that has helped CRY move forward. Rippan would have been very happy to see that.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Memory Contributor: Neera Kapur Picture caption: The Kapur Family, Bombay, 1990 This photograph is probably the only image where the family can be seen together. Vippan (left) and Rippan (third from left) are twins and so similar looking that sometimes, even I got confused. It was taken at a party in Bombay. My mother, Mrs. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1481"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1481"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1481\/revisions"}],"predecessor-version":[{"id":2824,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1481\/revisions\/2824"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1481"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1481"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1481"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}