{"id":1485,"date":"2020-09-03T11:46:57","date_gmt":"2020-09-03T11:46:57","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1485"},"modified":"2022-07-18T12:47:27","modified_gmt":"2022-07-18T07:17:27","slug":"minki-stands-up-for-herself","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/minki-stands-up-for-herself\/","title":{"rendered":"Minki stands up for herself!"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/minki-stands-up-for-herself.jpg\" alt=\"Minki stands up for herself\" class=\"wp-image-1486\"\/><\/figure>\n\n\n\n<p>17-year-old Minki* hails from Samastipur, Bihar, where she lives with her mother and five siblings. Her father, having migrated to someplace else, doesn’t support the family at all; leaving her mother to support the family by working as a daily wage agricultural laborer.<\/p>\n\n\n\n<p>Currently enrolled in 12th grade, Minki was shocked when she found out that her mother was planning to get her married and had begun speaking to relatives and people in nearby villages about prospective grooms. While Minki tried to speak to her mother about delaying her marriage and allowing her to complete her studies, it fell to deaf ears.<\/p>\n\n\n\n<p>Having been a part of their adolescent girls&#8217; meetings that had helped her understand her rights, Minki reached out to JJBVK, a CRY project in Samastipur, and asked for help. The project staff immediately visited her house the very next day and spoke to her mother about their concerns regarding Minki’s marriage plans. Her mother spoke to them about their financial difficulties and how getting her married was the only option for their survival as it’d mean one less mouth to feed.<\/p>\n\n\n\n<p>The CRY team tried to convince her otherwise by explaining how letting Minki complete her education will help the family’s financial condition in the long term but what really turned the conversation around was Minki herself. The fact that she had people standing up for her gave her courage and she decided to speak up. She told her mother that getting married at this age would negatively impact her life forever and also cited provisions in the Indian law on the Prevention of Child Marriage Act. “Believe in me, Amma! Give me a chance to complete my schooling and I will get a good job that can support us all,” she said.<\/p>\n\n\n\n<p>Seeing Minki expressing her opinion with so much clarity, her mother finally agreed to let her daughter study.<\/p>\n\n\n\n<p>Minki’s story is not just about preventing a child&#8217;s marriage but proof of what’s possible when children are empowered to speak up on the issues that affect them!<\/p>\n\n\n\n<p><strong>You can give more children like Minki the chance at a healthier future. Donate to CRY by <a href=\"\/donation\">clicking here.<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>17-year-old Minki* hails from Samastipur, Bihar, where she lives with her mother and five siblings. Her father, having migrated to someplace else, doesn’t support the family at all; leaving her mother to support the family by working as a daily wage agricultural laborer. Currently enrolled in 12th grade, Minki was shocked when she found out [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1485"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1485"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1485\/revisions"}],"predecessor-version":[{"id":2748,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1485\/revisions\/2748"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1485"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1485"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1485"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}