{"id":1496,"date":"2020-09-03T12:06:25","date_gmt":"2020-09-03T12:06:25","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1496"},"modified":"2022-07-18T12:47:02","modified_gmt":"2022-07-18T07:17:02","slug":"how-kavita-transformed-herself-and-her-community","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/how-kavita-transformed-herself-and-her-community\/","title":{"rendered":"How Kavita transformed herself and her community!"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/how-kavita-transformed-herself-and-her-community.jpg\" alt=\"Story Of Kavita From Shahbad Dairy In Delhi\" class=\"wp-image-1971\"\/><\/figure>\n\n\n\n<p>“I want to become like Mithali Raj and play for the Indian Women’s Cricket Team one day. I also want that every girl should get the opportunity to realize their dreams,” says Kavita.<\/p>\n\n\n\n<p>Recently selected by the BCCI to be a part of the T20 Women’s under-23 Arunachal Pradesh team, she is fast emerging as a promising cricketer and is working hard towards her dream.<\/p>\n\n\n\n<p>But the journey hasn’t been easy &#8211; it has taken herculean efforts and enormous courage for this 17-year-old from the slums of Shahbad Dairy in Delhi to have come this far. Kavita hails from an extremely poor family. Her father sells <em>paan<\/em> in the local market while her mother works as domestic help. Their residential area is not only a bastion of patriarchal mindsets but is also notorious for crimes against women and children. It has one of the highest rates of missing children and the cases of child trafficking are rampant. Instances of abduction of young girls are commonplace in the area and public toilets have been breeding grounds of rape and violence against women. Two of Kavita’s elder sisters were married off even before they reached 18 years of age and the same fate awaited her. However, she always aspired to continue her studies and play cricket – her love for the sport grew while watching her elder brothers play in the locality.<\/p>\n\n\n\n<p>Dreams have a strange way of coming true.<\/p>\n\n\n\n<p>One day, Kavita saw Santlal (Founder of the CRY project, Saksham) teaching cricket to three girls in a playground. She would come early in the morning every day and watch them play, until one day, she mustered the courage to request him to let her join.<\/p>\n\n\n\n<p>However, convincing her parents to let her do so was not easy.<\/p>\n\n\n\n<p>In Shahbad Dairy, it is difficult for women to venture out in the streets &#8211; which are frequented by hooligans jeering and passing lewd comments to women who step out of their homes. The situation is so grave that girls are still not allowed to go outside after dark and families who do not have toilets, actually refrain from giving their daughters food and water at night lest they need to go out to use the public toilets and fall prey to violence. But despite everything, Santlal convinced Kavita’s family to send her to Saksham and also become a part of the girls&#8217; cricket team.<\/p>\n\n\n\n<p>But Kavita’s cricketing journey was paved with enormous challenges.<\/p>\n\n\n\n<p>Boys from the locality would strew their training ground with broken glass and stalk the girls so their parents would force them to give up cricket. Kavita also faced ire from her neighbors who would constantly mock her for wearing shorts and wearing tomboyish clothes, going outside in the wee hours, or coming late due to the matches. However, Kavita stood her ground and not only learned the sport but also gained knowledge about child rights and gender equality. It gave her the strength to fight her fears, break gender inequities at home and outside, get over the inhibitions of body shaming, and challenge stereotypes by bargaining for equal spaces at home.<\/p>\n\n\n\n<p>Kavita’s efforts paid dividends and soon, her prowess in the field started showing results. She gradually ventured into state-level tournaments – under her captainship, CRY project Saksham’s cricket team won the Amul Milk Cricket Tournament! Kavita also bagged the Woman of the Series award in the National School Cricket Game tournament that saw participation from 18 states but her big moment came when she got a chance to play for India in the under-19 T20 International Championship against Bangladesh, Sri Lanka, and Nepal. In one instance, when she got an opportunity to bowl to Michael Clarke as a part of a CRY intervention, she managed to clean bowl the renowned cricketer!<\/p>\n\n\n\n<p>Kavita soon drew media attention which became an opportunity to highlight the atrocities faced by the young girls in Shahbad Dairy and how cricket was helping break gender stereotypes. As Kavita’s story gained momentum, it also opened doors to important stakeholders like the Police and the Delhi Commission for Women, which became critical in addressing cases of missing children, child marriage, harassment, and cases of abuse against women in the area.<\/p>\n\n\n\n<p>Such exposure helped Kavita shed her fears and join the CRY children’s group where she helped other girls like her to embark on their journeys of realizing their true potential. Her success helped change community perceptions as well. More families began sending their girls to play cricket, their jeers turned to applause and the very boys who would fill the ground with filth started filling the seats to watch local cricket tournaments and cheer for the girls’ team.<\/p>\n\n\n\n<p>Her contribution to the community not only bestowed her with the state-sponsored Beti Gaurav Award but also made her a proud runner-up in the DLF Pramerica challenge. When she got an opportunity to interact with Virat Kohli as a part of a CRY initiative, she confidently asked him, “<em>Aap bhi captain, main bhi captain!<\/em> How do you inspire your team to perform their best?”<\/p>\n\n\n\n<p>Through cricket, Kavita wants to empower every girl and help them find the courage to stand up to regressive mindsets and child marriage. She also wants to start a sports academy someday where all kinds of sport could be taught to the girls from Shahbad Dairy.<\/p>\n\n\n\n<p>Fondly called the “Bat Ball Wali Didi”, Kavita is a true inspiration for everyone in her community – a dreamer who has ignited the dreams of many others!<\/p>\n\n\n\n<p><strong>You can give more children like Kavita the chance at a healthier future. Donate to CRY by <a href=\"\/donation\/\">clicking here.<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>“I want to become like Mithali Raj and play for the Indian Women’s Cricket Team one day. I also want that every girl should get the opportunity to realize their dreams,” says Kavita. Recently selected by the BCCI to be a part of the T20 Women’s under-23 Arunachal Pradesh team, she is fast emerging as [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[5,8],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1496"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1496"}],"version-history":[{"count":8,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1496\/revisions"}],"predecessor-version":[{"id":3022,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1496\/revisions\/3022"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1496"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1496"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1496"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}