{"id":1499,"date":"2020-09-03T12:09:57","date_gmt":"2020-09-03T12:09:57","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1499"},"modified":"2022-07-18T12:46:51","modified_gmt":"2022-07-18T07:16:51","slug":"this-independence-day-lets-give-india-a-healthier-future","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/this-independence-day-lets-give-india-a-healthier-future\/","title":{"rendered":"This Independence Day, let’s give India a healthier future!"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/this-independence-day-lets-give-indias-children-a-healthier-future.jpg\" alt=\"Support The Health Of Children In India\" class=\"wp-image-1975\"\/><\/figure>\n\n\n\n<p>The Coronavirus pandemic has seized the world. Its impact has been unparalleled and most countries have come to a standstill due to the deteriorating conditions. Our own country has witnessed an acute shortage of basic utilities and medical supplies, and malnutrition in India, on account of the loss in livelihoods, has certainly worsened.<\/p>\n\n\n\n<p>At less than 2%, India has one of the lowest COVID-19 case fatality rates (Source: Ministry of Health, Aug 13, 2020 update). For a developing country like ours that is home to 1.33 billion people (Source: NHM 2019), the last couple of months have been challenging for people hailing from underprivileged communities. With a population this large, it’s not just the testing and containment of the virus that’s tough to navigate, but also the treatment of those who have been infected. The complete recovery and rehabilitation of formerly infected people have also been a learning curve.<\/p>\n\n\n\n<p>For underprivileged children, in particular, the pandemic has also brought ill-health. Every 3rd child in India is suffering from severe malnutrition and the last couple of months have made it even more difficult for them to get access to healthcare facilities.<\/p>\n\n\n\n<p>As we celebrate Independence Day on the 15th of August, let’s salute and celebrate the hard work of the innumerable frontline workers who’re working even in these dire circumstances to reach those in need. Be it health workers or NGOs like CRY, the country has shown up for those who are the most vulnerable.<\/p>\n\n\n\n<p>But many vulnerable children still need our help. At CRY, we are working relentlessly to help children survive and thrive in a COVID world. To achieve this herculean task, we need the help of more samaritans like you. So join hands with CRY, one of the <a href=\"\/\">best NGOs in India<\/a>, to ensure that the underprivileged children have a chance at a brighter future.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Coronavirus pandemic has seized the world. Its impact has been unparalleled and most countries have come to a standstill due to the deteriorating conditions. Our own country has witnessed an acute shortage of basic utilities and medical supplies, and malnutrition in India, on account of the loss in livelihoods, has certainly worsened. At less [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[15,7],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1499"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1499"}],"version-history":[{"count":7,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1499\/revisions"}],"predecessor-version":[{"id":3538,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1499\/revisions\/3538"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1499"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1499"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1499"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}