{"id":1502,"date":"2020-09-03T13:07:05","date_gmt":"2020-09-03T13:07:05","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=1502"},"modified":"2022-07-18T12:46:38","modified_gmt":"2022-07-18T07:16:38","slug":"a-review-of-the-national-education-policy-nep-2020","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/a-review-of-the-national-education-policy-nep-2020\/","title":{"rendered":"A Review of the National Education Policy (NEP) 2020"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"1200\" height=\"628\" src=\"\/wp-content\/uploads\/a-review-of-the-national-education-policy-nep-2020.jpg\" alt=\"National Education Policy (NEP) 2020\" class=\"wp-image-1973\"\/><\/figure>\n\n\n\n<p>The new National Education Policy (NEP) 2020 is certainly a welcome move and being an organization that has been working for children’s education as one of children’s fundamental rights &#8211; we, at CRY, are looking at some key points from the NEP: the positive change it would bring and what perhaps needs more thought and discussion to yield the desired outcome. Read on to know more about the key ways in which the NEP will impact the children and what are the challenges in each context:<\/p>\n\n\n\n<p>1. The NEP promises universal access to quality education for children from 3-18 years. This means that every child between 3-18 years will be eligible to receive quality education provided by the government; irrespective of their socio-economic background. Thus, every child will now have the opportunity to go to school and learn. This is especially important for children from&nbsp;marginalized communities who cannot afford a paid education.<\/p>\n\n\n\n<p>NSSO 75th Round data suggests that there are 3.22 million children between the ages of 6-17 years that are still out of school. There are indications that while there is a government commitment to ensure universal access to education, it may not necessarily be free. Children’s families might have to incur costs for schooling such as textbooks, transport, uniforms, digital devices etc. which will pose a challenge to poor families. This will, therefore, affect universal access, retention as well as completion of schooling.<\/p>\n\n\n\n<p>It would be difficult to ensure universal access to quality education without making it free and compulsory as a legal right for all children from 3-18 years. Thus, it is critical that the ambit of the RTE Act, 2009 is extended to cover education from pre-school to secondary levels. Currently, the RTE Act makes it compulsory for the govt. to do so only for children between the ages of 6 and 14 years. Such an extension of RTE will need an increase in infrastructure and human resources which would require a proportionate budgetary allocation.<\/p>\n\n\n\n<p>2. The NEP also covers the importance of foundational learning and early childhood education. This will help children as nearly 80% of brain development is complete by the age of 8. Early stimulation is essential for cognitive development in the first 3 years which forms the basis for learning in preschool. The years between pre-school to class 3 (ages 3-8) are called the foundational learning years. If foundational learning is not developed strongly, children are unable to catch up in later grades as concepts become more complex. The NCERT will also develop a framework for children between 0-3 and 3-8 years and the govt. will set up a National Mission on Foundational Literacy and Numeracy to address foundational learning. This will play a critical role in children’s retention within the education system.<\/p>\n\n\n\n<p>The timelines for teacher recruitment are not clear in the NEP. Teacher vacancies need to be filled within a specified timeline and teacher capacities need to be built as per the pedagogy proposed in the policy since teaching foundational literacy and numeracy is a specialized skill. While the NCERT will develop the framework, parents and caregivers will need support in how to provide early stimulation. These aspects have not been elaborated upon in the NEP and would require to be addressed in implementation plans. Ensuring learning material, safe infrastructure, teacher recruitment, and training for foundational learning would again require further govt. investment.<\/p>\n\n\n\n<p>3. Another aspect of the NEP is the creation of the Gender Inclusive Fund. Data suggests that girls&#8217; access to and completion of education is poorer compared to boys. Girls’ dropout rates, especially when it comes to a comparison between those in the general category and marginalized groups (SC\/ST\/OBC), are alarming.<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table style=\"font-size: 15px;margin-top: 0; overflow: auto;margin-bottom: 0 !important; margin: auto;width: 80%;\"><tbody><tr><td colspan=\"4\">Dropout Rates (Elementary)<\/td><td>Dropout Rates (Secondary)<\/td><\/tr><tr><td><\/td><td>Girls<\/td><td>Boys<\/td><td>Girls<\/td><td>Boys<\/td><\/tr><tr><td>General<\/td><td>4.72<\/td><td>3.92<\/td><td>16.27<\/td><td>15.14<\/td><\/tr><tr><td>SC<\/td><td>8.01<\/td><td>8.02<\/td><td>21.99<\/td><td>23.06<\/td><\/tr><tr><td>ST<\/td><td>8.90<\/td><td>8.86<\/td><td>26.51<\/td><td>27.41<\/td><\/tr><tr><td>OBC<\/td><td>5.90<\/td><td>5.41<\/td><td>19.77<\/td><td>20.28<\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<p class=\"has-text-align-center\">Source: UDISE 2016-17<\/p>\n\n\n\n<p>Educating girls, will help foster decision-making and improved self-confidence, enabling them to participate as empowered citizens and navigate the world on&nbsp;their terms.<\/p>\n\n\n\n<p>The NEP acknowledges the importance and challenges in girls&#8217; education and sets up the ‘Gender Inclusion Fund’. This fund seeks to provide equitable quality education for all girls as well as transgender students by addressing “context-specific barriers” to their access and participation in education.<\/p>\n\n\n\n<p>While the fund will be provided by the govt., the allocation priorities will be decided centrally for the states to implement. Unless clear mechanisms are developed for smooth functioning between the Centre and states, the optimum utilization of this fund for the benefit of girls and transgender students might be difficult<\/p>\n\n\n\n<p>The NEP is unclear on whether the Beti Bachao Beti Padhao program and state-run schemes and programs on girl child education will be a part of this. It’s also unclear as to how programs such as Rashtriya Kishor Swasthya Karyakram and SABLA will converge with the Gender Inclusive Fund. And whether the protection of girls will be included in the scope of the fund.<\/p>\n\n\n\n<p>4. The NEP also focuses on the use of technology and commitment to address the digital divide. While face-to-face teaching cannot be replaced by digital education, increased technological connectivity can help marginalized children fulfill their potential and break inter-generational cycles of poverty. It is especially relevant during humanitarian crises, and is an important 21st-century skill. Access to digital technology will also allow children to access information on issues that affect their communities and enable them to participate in solving them.<\/p>\n\n\n\n<p>While the NEP talks about building digital infrastructure and connectivity to bridge the digital divide it does not state clear timelines. Along with poor access to digital devices and technology, the availability of uninterrupted electricity supply is also an issue among marginalized communities. Thus, it would be a challenge for most children attending government schools to access education digitally &#8211; something that could increase the digital divide and risk higher dropouts. It’s not only about making required arrangements within the school but also about ensuring that these facilities are accessible by every child at their residence. Without these, the essential purpose of a universal education will be defeated. Without robust online safety protocols, safeguarding children online will be challenging.<\/p>\n\n\n\n<p>5. The NEP includes focus on holistic, integrated, enjoyable, and engaging learning. It’s proposing to reduce the curriculum burden on children as well as reducing rote learning and bring in teaching-learning in a way that encourages critical thinking and conceptual clarity in children. At the secondary level, NEP also provides flexibility in the selection of subjects to ensure children’s interest in learning is retained. It also tries to prepare children for skills needed in the 21st century and includes life-skills education into the curriculum.<\/p>\n\n\n\n<p>The pedagogy proposed by the NEP will require investment in skilled teachers, learning material, and basic infrastructure across all levels of education in a safe learning environment.<\/p>\n\n\n\n<p>The NEP states that there will be ‘less emphasis on input’ and ‘greater emphasis on output’ w.r.t desired learning outcomes – while relaxing requirements on land areas, room sizes, playgrounds etc. It would be difficult to ensure learning outcomes (especially digitally) without basic minimum inputs related to infrastructure and entitlements such as free textbooks and other learning materials, uniforms, teachers etc. These basic inputs are already guaranteed by the RTE Act, the ambit of which will have to be expanded to cover preschool to secondary education and its provisions further strengthened in keeping with the teaching-learning requirements proposed in the NEP.<\/p>\n\n\n\n<p><strong>As CRY, we’re continuing to ensure that children are able to complete their education and get a chance at a brighter future. But we need YOUR help.<\/strong><\/p>\n\n\n\n<p><strong><a href=\"\/donation\/\">Donate to CRY<\/a> right away and help children realize their true potential.<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The new National Education Policy (NEP) 2020 is certainly a welcome move and being an organization that has been working for children’s education as one of children’s fundamental rights &#8211; we, at CRY, are looking at some key points from the NEP: the positive change it would bring and what perhaps needs more thought and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1502"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=1502"}],"version-history":[{"count":14,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1502\/revisions"}],"predecessor-version":[{"id":4236,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/1502\/revisions\/4236"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=1502"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=1502"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=1502"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}