{"id":2036,"date":"2020-09-17T11:26:19","date_gmt":"2020-09-17T11:26:19","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=2036"},"modified":"2022-07-18T12:46:19","modified_gmt":"2022-07-18T07:16:19","slug":"non-profit-organization-that-helps-in-educating-underprivileged-children-in-india","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/non-profit-organization-that-helps-in-educating-underprivileged-children-in-india\/","title":{"rendered":"A Non Profit Organization That Helps In Educating Underprivileged Children In India"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/non-profit-organization-that-helps-in-educating-underprivileged-children-in-india.jpg\" alt=\"Non Profit Organization\" class=\"wp-image-2040\"\/><\/figure>\n\n\n\n<p>The current school system in India comprises of three main sections, elementary\/primary, secondary, and higher education. Typically, children are enrolled in schools from a tender age and are promoted to a higher standard each year. Children gain a lot of theoretical as well as practical knowledge, based on reasoning and techniques.<\/p>\n\n\n\n<p>School-based education is integral for all children. Unfortunately, there are still millions of children in India who have never attended a school or are school drop-outs. This is the reason why the Indian government took a conscious decision to strengthen the&nbsp;literacy rate in India &nbsp;and ensure that education is a right of every child, instead of a privilege. The Right to Education Act (RTE) came into effect in April 2010, making education mandatory for children aged 6 to 14. The Act functions on the concept of ‘free and compulsory education’ that ensures no child hailing from a financially-compromised background pays any sort of fee for receiving education in a school in India. The Act also holds the government and the concerned authorities accountable to ensure that the Act is fairly applied everywhere.<\/p>\n\n\n\n<p>It is to be noted that some actions are strictly forbidden under the Act, including:<\/p>\n\n\n\n<ul><li>Children falling outside the set guidelines of the Act must not receive preferential treatment.<\/li><li>No child should face any sort of mental or physical harassment.<\/li><li>No school is allowed to accept a capitation fee, i.e any amount of ‘donation’ or an extra amount disguising admission fees.<\/li><li>Every school must have an official identification certificate, approved by the concerned, recognized education board.<\/li><\/ul>\n\n\n\n<p>Right to Education&nbsp;comes as a great relief for many children in India who are awaiting their turn to receive quality education but in vain. There are still innumerable children and their parents unaware of this great opportunity and that is where noted non profit organization in India, Child Rights and You (CRY) plays its part. CRY helps underprivileged children to get education. You can also join the endeavour and <a href=\"\/donation\/\">donate<\/a> to the non government organization to help create change.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The current school system in India comprises of three main sections, elementary\/primary, secondary, and higher education. Typically, children are enrolled in schools from a tender age and are promoted to a higher standard each year. Children gain a lot of theoretical as well as practical knowledge, based on reasoning and techniques. School-based education is integral [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2036"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=2036"}],"version-history":[{"count":11,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2036\/revisions"}],"predecessor-version":[{"id":3535,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2036\/revisions\/3535"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=2036"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=2036"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=2036"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}