{"id":2051,"date":"2020-09-17T11:46:36","date_gmt":"2020-09-17T11:46:36","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=2051"},"modified":"2022-07-18T12:45:40","modified_gmt":"2022-07-18T07:15:40","slug":"help-cry-ngo-educate-girls-in-india-for-a-brighter-future","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/help-cry-ngo-educate-girls-in-india-for-a-brighter-future\/","title":{"rendered":"Help CRY NGO Educate Girls In India For A Brighter Future"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/help-cry-ngo-educate-girls-in-india-for-a-brighter-future.jpg\" alt=\"NGO Educate Girls In India\" class=\"wp-image-2053\"\/><\/figure>\n\n\n\n<p>India is home to millions of underprivileged young girls. The girl child is still a victim of discrimination and stark oppression, particularly in the case of the&nbsp;education of girls in India. In many regional belts as well as urban areas, several girls are not allowed to attend schools or are required to drop out and take care of the household chores, or even start earning, anything but receive an education. India is a progressive nation but unfortunately, the girl child is still devoid of her basic rights.<\/p>\n\n\n\n<p>This is why 24th January is dedicated to celebrating the National Girl Child Day in India, an occasion to spread awareness about the reality behind several underprivileged girls. This day also encourages citizens to support thousands of such young girls by extending useful tools and resources for them to have happier childhoods. Therefore, the best way to commemorate the day is to volunteer with CRY (Child Rights and You) that supports young girls; read on to know how you can accomplish that:<\/p>\n\n\n\n<p>1. Join CRY’s Virtual Volunteering Program if you are unable to commit in person. From working on their content-based projects to extending a helping hand in the area of IT development and contributing to research projects, the scope to assist is vast.<\/p>\n\n\n\n<p>2. Regularly donate to CRY and help initiate fruitful partnerships with donors &nbsp;(corporates, local businesses etc). Regular sponsorships also go a long way in supporting child-based programs at CRY.<\/p>\n\n\n\n<p>3. Spread the word about the work at CRY on social media platforms. One can also share insightful videos and posts from CRY’s social media pages, and engage more people to be of service and empower young girls.<\/p>\n\n\n\n<p>4. Share your skill-set and help out CRY in your area of interest – photography, content writing, designing or videography – take your pick and start contributing.<\/p>\n\n\n\n<p>CRY has had over 2500 active volunteers in 2018-19, with 239 remote volunteers, 22 Child Rights Leaders, and 1040 interns. The impact of volunteers goes a long way in improving the quality of life of several underprivileged children, especially when Rs. 52,02,825 are raised by volunteers. CRY is an&nbsp;<a href=\"\/\">NGO that helps educate girls in India<\/a>&nbsp;where each one of them is in an environment where their rights are protected and they are encouraged to strive for a brighter future. Join CRY and help make a difference.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>India is home to millions of underprivileged young girls. The girl child is still a victim of discrimination and stark oppression, particularly in the case of the&nbsp;education of girls in India. In many regional belts as well as urban areas, several girls are not allowed to attend schools or are required to drop out and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2051"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=2051"}],"version-history":[{"count":9,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2051\/revisions"}],"predecessor-version":[{"id":4226,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2051\/revisions\/4226"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=2051"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=2051"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=2051"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}