{"id":2056,"date":"2020-09-17T11:55:14","date_gmt":"2020-09-17T11:55:14","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=2056"},"modified":"2022-07-18T12:45:27","modified_gmt":"2022-07-18T07:15:27","slug":"world-day-against-child-labour-highlights-the-state-of-children-during-the-pandemic","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/world-day-against-child-labour-highlights-the-state-of-children-during-the-pandemic\/","title":{"rendered":"World Day Against Child Labour Highlights The State Of Children During The Pandemic"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/world_day_against-child-labour-highlights-the-state_of-children-during-the-pandemic.jpg\" alt=\"World Day Against Child Labour\" class=\"wp-image-2352\"\/><\/figure>\n\n\n\n<p>Due to the recent lockdown implemented by the government of India to control the spread of the COVID-19 pandemic, several families have lost their livelihoods. This has resulted in daily wagers, in particular, face acute poverty and lack of everyday resources. Children from these underserved communities are one of the silent bearers of the long-term impact of the pandemic. The worsened economic dynamic shall force children to drop out of school to help bring in money into the family for bare necessities, thus work as child labourers.<\/p>\n\n\n\n<p><a href=\"\/blog\/understanding-and-addressing-child-labour-today\/\">Child labour in India<\/a> &nbsp;is a rampant practice. According to the National Census 2011,&nbsp;1 in 11 working individuals in India is a child in the age group of 5-18 years. The term ‘child labour’ refers to work that is harmful to the mental, physical, social, and\/or moral well-being of a child. Work that interferes with a child’s schooling is also viewed as a part of child labour – includes any activity that negatively impacts a child’s potential and their dignity, as well as physical and mental development. June 12th is marked as the World Day Against Child Labour 2020 to focus attention on the impact and extent of child labour. The practice of child labour must be stopped and a zero-tolerance attitude must be adopted to ensure children are not deprived of a happy and healthy childhood. India already had over&nbsp;33 million child labourers, between the ages of 6 and 18 years. Given the loss of livelihoods during the lockdown, this number will rapidly rise as more underprivileged children are forced to work and support their families.<\/p>\n\n\n\n<p>At CRY, we have been working tirelessly to provide for the underprivileged children during these unprecedented times. As of June 8, 2020, we have distributed hygiene kits and dry rations, and spread awareness regarding preventive measures and availing medical support in&nbsp;15 states of India, impacting 65,598&nbsp;households. 96,248 children are being supported by us in the form of online learning sessions, providing supplementary nutrition food to children suffering from severe malnutrition, distributing milk and biscuits to children between the age of 0-3 years etc.<\/p>\n\n\n\n<p>Last year alone, with the support of donors like you, we&nbsp;protected&nbsp;2046 children&nbsp;from issues like child labour, child marriage and child trafficking.&nbsp;At this crucial time, we need you by our side to help those who need it the most. To take a constructive action to honour the World Day Against Child Labour 2020, donate to CRY. You can help uplift the deplorable state of underprivileged children in India.&nbsp;<a href=\"\/protect-children-from-child-labour-acld\/?utm_source=website&amp;utm_medium=blog&amp;utm_campaign=61115&amp;utm_content=blog-orgnc-acld\">Donate for children<\/a>&nbsp;right away.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Due to the recent lockdown implemented by the government of India to control the spread of the COVID-19 pandemic, several families have lost their livelihoods. This has resulted in daily wagers, in particular, face acute poverty and lack of everyday resources. Children from these underserved communities are one of the silent bearers of the long-term [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[4],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2056"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=2056"}],"version-history":[{"count":11,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2056\/revisions"}],"predecessor-version":[{"id":3543,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2056\/revisions\/3543"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=2056"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=2056"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=2056"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}