{"id":2060,"date":"2020-09-17T12:09:55","date_gmt":"2020-09-17T12:09:55","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=2060"},"modified":"2022-07-18T12:45:17","modified_gmt":"2022-07-18T07:15:17","slug":"understanding-and-addressing-child-labour-today","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/understanding-and-addressing-child-labour-today\/","title":{"rendered":"Understanding And Addressing Child Labour Today"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"403\" src=\"\/wp-content\/uploads\/the-reality-of-the-practice-of-child-labour-in-india.jpg\" alt=\"Child Labour\n\" class=\"wp-image-1967\"\/><\/figure>\n\n\n\n<p>Child labour has been a perennial problem in India – one that has tremendous short term as well as long term ramifications for the lives of underprivileged children. However, in order to face this challenge effectively, we must understand child labour in the present day context. What are the laws pertaining to&nbsp;child labour in India? What is the present on ground situation? And, importantly, what can we do about it? These are some of the questions that we address here.<\/p>\n\n\n\n<p><strong>Section I: Child labour and the law<\/strong><\/p>\n\n\n\n<p><strong>1. What is the definition of child labour?<\/strong><\/p>\n\n\n\n<p>According to International Labour Organization (ILO), ‘child labour’ is often defined as work that deprives children of their childhood, their potential and their dignity, and that is harmful to physical and mental development. It refers to work that:<\/p>\n\n\n\n<ul><li>is mentally, physically, socially or morally dangerous and harmful to children; and\/or<\/li><li>interferes with their schooling by: depriving them of the opportunity to attend school; obliging them to leave school prematurely; or requiring them to attempt to combine school attendance with excessively long and heavy work.<\/li><\/ul>\n\n\n\n<p>UNICEF defines child labour as “work that exceeds a minimum number of hours, depending on the age of a child and on the type of work.” Such work is considered harmful to the child and should be eliminated:<\/p>\n\n\n\n<ul><li>Ages 5-11: At least one hour of economic work or 28 hours of domestic work per week.<\/li><li>Ages 12-14: At least 14 hours of economic work or 28 hours of domestic work per week.<\/li><li>Ages 15-17: At least 43 hours of economic or domestic work per week.”&nbsp;<em>(UNICEF. “Child Labour”. Retrieved June 17, 2011, from http:\/\/www.unicef.org\/protection\/index_childlabour.html)<\/em><\/li><\/ul>\n\n\n\n<p><strong>2. What is the name of the legislation in India that deals with Child Labour?<\/strong><\/p>\n\n\n\n<p>The Indian legislation is called the Child &amp; Adolescent Labour (Prohibition and Regulation) Act, 1986. It was initially formulated in 1986. It was recently amended in 2016.<\/p>\n\n\n\n<p><strong>3. How does the Child and Adolescent Labour (Prohibition and Regulation) Act, 1986 define children and their work?<\/strong><\/p>\n\n\n\n<p>The legislation doesn’t define ‘child labour’ as such but defines ‘child’ and working conditions. The law defines ‘child’ as anyone who has not completed 14 years of age and ‘adolescent’ as anyone who has completed his 14th year of age but is below 18 years. The legislation seeks to prohibit and regulate child labour as per the following criteria –<\/p>\n\n\n\n<p>– The Schedule to the Act enlists hazardous occupations and processes which are identified by the Technical Advisory Committee constituted under the Act.<\/p>\n\n\n\n<p>– All children as well as adolescents are prohibited from working or helping in any occupation or processes that is identified as hazardous.<\/p>\n\n\n\n<p>– Adolescents are permitted to work in occupations and processes that are outside of the hazardous list but within regulated conditions.<\/p>\n\n\n\n<p><strong>4. What do you mean by hazardous work under the child labour law in India?<\/strong><\/p>\n\n\n\n<p>The definition of hazardous process is largely drawn from another legislation known as the Factories Act, 1948. It refers to any activity or process involving the handling of raw materials, finished products, by-products, and wastes that can directly affect the health of the worker or the environment. Therefore, special care needs to be taken by workers engaged in these activities or processes.<\/p>\n\n\n\n<p>In the Child Labour legislation schedule, there are two parts, namely, PART A comprising of the 38 listed hazardous occupations and processes in which adolescents are prohibited to work, and PART B highlighting the list of 15 occupations and 54 processes where children are prohibited to help family and family enterprises (in addition to PART- A).<\/p>\n\n\n\n<p><strong>5. What are the exceptions in law and what are the regulations in place?<\/strong><\/p>\n\n\n\n<p><strong><u>For children under 14 years<\/u><\/strong><\/p>\n\n\n\n<p>No child under 14 can be employed or permitted to work in any occupation or processes (hazardous or otherwise). But it makes the following exemptions, where it allows a child to:<\/p>\n\n\n\n<p>1) ‘Help’ family or in family enterprises.<\/p>\n\n\n\n<p>2) Work as a child artist in the audio-visual entertainment industry including advertisement, films, television serials or any such other entertainment or sports activities except the circus.<\/p>\n\n\n\n<p><strong><u>For children between 15-18 years (Adolescents)<\/u><\/strong><\/p>\n\n\n\n<p>No adolescent is allowed or permitted to work in any of the hazardous occupation and processes but it does allow in the other categories with certain safeguards to regulate their work conditions like:<\/p>\n\n\n\n<p>– for maximum six hours per day with at least one hour of rest in between.<\/p>\n\n\n\n<p>– with one full day off, every week.<\/p>\n\n\n\n<p>– effective rules for the health and safety of the adolescent.<\/p>\n\n\n\n<p><strong>6. Who is a child artist?<\/strong><\/p>\n\n\n\n<p>The Law defines a ‘child artist’ as a child who performs or practices any work as a hobby or profession directly involving him as an actor, singer, sports person or in such other activity relating to the entertainment or sports activities.<\/p>\n\n\n\n<p><strong>7. What are the penalties under law?<\/strong><\/p>\n\n\n\n<p>Whoever employs any child up to the age of 14 years or permits any child to work is punishable with imprisonment for a term ranging from six months to 2 years or fine of twenty thousand rupees to fifty thousand rupees, or with both. Parents or guardians of such children are not punished unless they permit such child for commercial purposes.<\/p>\n\n\n\n<p><strong>8. What are the important government schemes are programmes that address child labour in India?<\/strong><\/p>\n\n\n\n<p>There are a number of government schemes and programmes that address child labour in India. Some of them are engaged in preventing and rehabilitation and other are primarily responsible for protection.<\/p>\n\n\n\n<p><strong>Schemes and laws responsible for preventing and rehabilitation:<\/strong><\/p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp; a) The National Child Labour Project (NCLP)<\/strong><\/p>\n\n\n\n<p>The objective of the National Child Labour Project is to ensure the rescue and rehabilitation of child labourers (5-14 years) as defined under the Child and Adolescent Labour (Prohibition and Regulation) Act, 1986. The children in the age group of 5-8 years are directly linked to the formal education system. Children in the age group of 9-14 years are enrolled into NCLP Special Training Centres, where they are provided with bridge education, vocational training, mid-day meal, stipend, health care etc. before being mainstreamed into formal education system. In the context of adolescents, the NCLP focuses on identification and withdrawal of all adolescent workers from hazardous occupations\/processes and provides opportunities for skill development and vocational training. The NCLP is also mandated to generate awareness on the child and adolescent labour law as well as create a system to track, monitor and report instances of child and adolescent labour. It does so through a portal called PENCIL – https:\/\/pencil.gov.in\/.<\/p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp; b) The Right to Education Act, 2009<\/strong><\/p>\n\n\n\n<p>Article 21-A in the Constitution of India has given the mandate that children in the age group of 6-14 years have the right to free and compulsory education till elementary school. This Act is extremely important in terms of prevention mechanism to child labour. However the Right to Education Act does not accommodate those who are beyond the age of 14, which is a matter of concern for above 14 years children and young adults.<\/p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp; c) The Trafficking of Persons (Prevention, Protection and Rehabilitation) Bill, 2018<\/strong><\/p>\n\n\n\n<p>The Bill provides for the establishment of a National Anti-Trafficking Bureau to investigate trafficking cases. The Bill also provides for the setting up of Anti-Trafficking Units (ATUs) at the district level. ATUs will deal with the prevention, rescue, and protection of victims and witnesses, and for the investigation and prosecution of trafficking offences. In districts where an ATU is not functional, this responsibility will be taken up by the local police station. The Bill requires the central or state government to set up Protection Homes. These would provide shelter, food, counselling, and medical services to victims. Further, the central or state government will maintain Rehabilitation Homes in each district, to provide long-term rehabilitation to the victims.<\/p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp; d) National Policy for Children<\/strong><\/p>\n\n\n\n<p>The policy clearly states that the state should ensure that all out of school children such as child laborers, migrant children, trafficked children, children of migrant labour, street children, child victims of alcohol, drug abuse, children in areas of civil unrest, orphan children with disability (mental and physical), children with chronic ailments, married children, manual scavengers, children of sex workers, children of prisoners, etc are tracked, rescued, rehabilitated and have access to their right to education.<\/p>\n\n\n\n<p><strong><u>Laws that are meant for the protection of Children:<\/u><\/strong><\/p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp; e) The Integrated Child Protection Scheme<\/strong><\/p>\n\n\n\n<p>The Integrated Child Protection Scheme seeks to provide a safety net for vulnerable children by identifying and mitigating child protection risks, responding to child protection violations and facilitating their rehabilitation. Child labour being an issue of child protection is one of the issues the ICPS deals with. It has structures at Village, Block, District and State level to prevent child labour, by identifying vulnerable children and linking them and their families to social security measures. They also provide support during rescue and the entire rehabilitation process of child labourers.<\/p>\n\n\n\n<p><strong>9. What are the international instruments which India has recently signed to address the issue of child labour?<\/strong><\/p>\n\n\n\n<p>India signed the following International Labour Organisation (ILO) Conventions:<\/p>\n\n\n\n<p><strong>1- Minimum Age for Admission to Employment Convention, 1973 (No. 138):<\/strong>&nbsp;The Convention allows ‘light work’ for children between 13-15 years of age, provided that the work is not likely to be harmful to health or development; and that does not compromise on school attendance and vocational education. The convention explicitly mentions that ratifying countries must make policies to progressively increase the minimum age of employment and that the minimum age of employment should be at least the age of 15 years and in line with the completion of compulsory schooling.<\/p>\n\n\n\n<p><strong>2- Worst Forms of Child Labour Convention, 1999 (No. 182):<\/strong>&nbsp;Along with ratifying ILO Convention 138, India also ratified Convention 182 in June 2017, which requires member countries to take immediate and effective measures to secure the prohibition and elimination of the worst forms of child labour as a matter of urgency. The worst forms of child labour include:<\/p>\n\n\n\n<p>a) all forms of slavery or practices similar to slavery, such as the sale and trafficking of children, debt bondage and serfdom and forced or compulsory labour, including forced or compulsory recruitment of children for use in armed conflict;<\/p>\n\n\n\n<p>b) the use, procuring or offering of a child for prostitution, for the production of pornography or for pornographic performances;<\/p>\n\n\n\n<p>c) the use, procuring or offering of a child for illicit activities, in particular for the production and trafficking of drugs as defined in the relevant international treaties;<\/p>\n\n\n\n<p>d) work which, by its nature or the circumstances in which it is carried out, is likely to harm the health, safety or morals of children.<\/p>\n\n\n\n<p><strong><u>Section II: Child labour situation analysis<\/u><\/strong><\/p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp;&nbsp; &nbsp; f )&nbsp; How many working children are there in India?<\/strong><\/p>\n\n\n\n<ol><li>The law defines working children into children and adolescents. There are 10.13 million child laborers between 5-14 years in India (Census 2011). 80% of child labour is found in rural areas and children between the ages of 10-14 years make up 75% of the working children in India. 43% of the total working children in India (5-14 years) consist of main workers. (Who works more than 6 months in a year). There are also 22 million working children between 15-18 years of age, categorized as adolescent labourers. Therefore the total number of working children in the country is 33 million (5-18 years of age). According to a report by Child Rights and You, 4% of children under the age of 14 and about 23% of the children in the age group of 15-18 are working.<\/li><li>There are approximately 12 lakhs children working in the hazardous occupations\/processes which are covered under the Child Labour (Prohibition &amp; Regulation) Act3.<\/li><\/ol>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1200\" height=\"500\" src=\"\/wp-content\/uploads\/Child-Labour.jpg\" alt=\"Child Labour\" class=\"wp-image-2069\"\/><\/figure>\n\n\n\n<ol><li><strong>g ) Which states do you find maximum child labour?<\/strong><\/li><\/ol>\n\n\n\n<p>Over 50% of the working children in India are in 5 states – Uttar Pradesh, Bihar, Rajasthan, Maharashtra and Madhya Pradesh.<\/p>\n\n\n\n<p><strong>10. What kind of employments\/work areas employs maximum child labourers?<\/strong><\/p>\n\n\n\n<ul><li>According to census 2011, 62% of child labourers between the ages of 5-14 years are concentrated in agriculture, forestry and fishing.<\/li><li><a href=\"https:\/\/www.cry.org\/pdf\/childescents-in-india-cry.pdf\">https:\/\/www.cry.org\/pdf\/childescents-in-india-cry.pdf<\/a><\/li><li><a href=\"https:\/\/www.cry.org\/blog\/understanding-and-addressing-child-labour-today#\">https:\/\/labour.gov.in\/sites\/default\/files\/FAQ_child_labour.pdf<\/a><\/li><\/ul>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"723\" height=\"491\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/chart.jpg\" alt=\"Classification of working children\" class=\"wp-image-2061\"\/><\/figure>\n\n\n\n<p>Note: R,S,T,U – Arts, Entertainment &amp; Recreation, Other Services &amp; Activities, Activities of Households as Employers: Undifferentiated Goods and Services, Activities of Extra Territorial Organisations and Bodies<\/p>\n\n\n\n<p><strong>11. Are there any negative consequences if children are allowed to help their families with work post school hours?<\/strong><\/p>\n\n\n\n<p>As per the law, any child who is less than 14 years of age should not be allowed to ‘work’ but only ‘help’ in family enterprises and entertainment\/sports. Children are only allowed to work after school hours or during vacations. However, no child is allowed to work between 7pm and 8am.<\/p>\n\n\n\n<p>Though some safeguards are mentioned, there is no way to monitor if these provisions are in fact being followed. It is very difficult for a child and her\/his family to balance work with education, especially during crucial times when the family has a chance to earn higher wages. In such situations, children tend to miss school for days\/weeks at a time. When these children try to go back to school after a long break, they are unable to catch up with their studies. Secondary data also suggests that when children combine work and education, and as they gradually progress to higher grades, their dropout rate increases. When the child engages in work it is important to note that it is at the cost of her\/his leisure, play, recreation and tutorials’ time which are important for their overall development.<\/p>\n\n\n\n<p>Thus, allowing children to work and study simultaneously not only deprives them of their right to play and leisure, but also lands up pushing them away from education.<\/p>\n\n\n\n<p><strong>12. Why child rights organisations are advocating for revisiting the list of ‘hazardous occupations and processes’ under Child labour law?<\/strong><\/p>\n\n\n\n<p>Adolescent children are legally permitted to engage in non-hazardous work under regulated conditions. However, from a child rights perspective, it is interfering with several of their rights and exposing them to risks which can have life-long consequences. As mentioned earlier, the list of hazardous occupations and processes draws from the understating of hazards from the Factories Act, 1948. This Act was framed from an adult perspective and to regulate labour in factories. It does not take into account the needs of children and adolescents. Therefore, what is termed as permissible or non-hazardous for children and adolescents by the law today, could actually pose several dangers to their overall physical, cognitive and social development. If the present child labour is to be made more ‘child-centric’, it would surely require refining its definition and understanding of hazardous occupations and processes and revision in its Schedule which provides this bifurcation of hazardous and non-hazardous occupation.<\/p>\n\n\n\n<p><strong><u>Section II: Effect of COVID and Child Labour<\/u><\/strong><\/p>\n\n\n\n<p><strong>13. How will the covid-19 pandemic affect child and adolescent labour in India?<\/strong><\/p>\n\n\n\n<p>The ILO estimates that globally, there are 152 million children in child labour, 72 million of which are in hazardous work. The Economic Survey Report 2019-20 shows that nearly 80% of the work force in India comes from the unorganised sector with limited access to social security measures and employment benefits.&nbsp; The COVID-19 pandemic has brought one of the major challenges of economic insecurity in households either due to death of earning members, loss of work and wages, or reduced employment opportunities, especially for vulnerable communities. The closure of schools only exacerbates the risk of increase in working children, either directly supporting their families, or caught in trafficking, begging, debt bondage and other indecent and exploitative work conditions.<\/p>\n\n\n\n<p>Census 2011 data suggests that there is an increase in the number of children working in urban areas. Between 2001 and 2011, the largest increase was seen in working children between 5-9 years in urban areas which was by 53%. Working children in rural areas have decreased by 29%. Recently, due to COVID-19, there are several states in India (including those with high prevalence of child and adolescent labour) which have made relaxations to their labour laws especially in their working conditions, including extending work hours from 8 hours to 12 hours per day, reduced wages, limited time for rest, relaxations in inspections and monitoring by authorities, restricted grievance redress mechanisms and collective bargaining through labour unions. Even though labour laws for children and women remain unchanged, the spill-over effect of adult workers are likely to have a negative impact, especially for adolescent workers. Thus the risk of engaging adolescent workers in exploitative work conditions will increase.<\/p>\n\n\n\n<p>Child labour in agriculture laborers is likely to increase due to school closures coupled with restrictions on movements and gatherings imposed as part of the national lockdown to prevent the spread of COVID-19. In the absence of helping hands, especially in the times of harvesting and marketing, children will be the fallback option to assist the parents in the fields.<\/p>\n\n\n\n<p><strong>14. Children earn so that they can help their families. What are the solutions to reduce child labour, especially during a humanitarian crisis like the COVID19?<\/strong><\/p>\n\n\n\n<p><a href=\"..\/\">Child Rights and You<\/a>&nbsp;as a national organization believes that every child must have the opportunity to complete 12 years of quality education, and has the right to play and leisure in a protective environment. Children do not enter the world of work by choice. They are often pushed into playing economic roles of adults either because of poverty or because of unemployment. And in a pandemic situation like this, there would be millions of children who would be pushed further into child labour, compelled to leave school and act as a “helping” hand out of compulsion. Therefore, provisions have to be put in place so that the security net of the children does not get compromised and they can exercise their rights in a non-obstructive fashion. There are a few recommendations that are given below, that could be helpful in preventing child labour, especially in the time of a pandemic:<\/p>\n\n\n\n<p>At the individual level, the following measures could be taken:<\/p>\n\n\n\n<ul><li>Making sure that we as empowered and educated individuals do not employ child labours.<\/li><li>Actively participating to strengthen the existing systems to prevent and rehabilitate Child Labour.<\/li><\/ul>\n\n\n\n<p>At the level of the society and civil society organization, the following measures could be taken:<\/p>\n\n\n\n<ul><li>Better awareness building on the issue of child labour at each level through various means.<\/li><li>Building resilience through social dialogue and advocacy efforts on the issue.<\/li><li>Creating a community of change makers to reach out to the last child and support him\/her so that they are not pushed to child labour.<\/li><li>Mobilising support to aid the children of the vulnerable communities &nbsp;with health care kit, learning kit, etc so that they are not detached from the learning process.<\/li><\/ul>\n\n\n\n<p>At the systemic level, the following measures could be useful:<\/p>\n\n\n\n<p>– Food grains through the Public Distribution System (PDS), affordable housing, and social security measures in terms of schemes must be made stronger. Anyway, the number of children engaged in child labour is very high, and with a pandemic situation.<\/p>\n\n\n\n<p>– Adult unemployment should be addressed especially for the most marginalised communities. As part of the COVID relief package, a few important measures have been announced recently, such as an increase in The Mahatma Gandhi National Rural Employment Guarantee Act, 2005 (MGNREGA4) wages, and additional allocations to this scheme. However, additional measures such as revoking the limit of providing work for only 100 days would help. Expansion of this scheme to urban areas would also help reduce household economic vulnerabilities in urban areas.&nbsp;<em>(4MGNREGA is an Indian labour law and social security measure that aims to guarantee the ‘right to work’. It aims to enhance livelihood security in rural areas by providing at least 100 days of wage employment in a financial year to every household whose adult members volunteer to do unskilled manual work)<\/em><\/p>\n\n\n\n<p>– Government should ensure that schooling is free, easily accessible and of good quality for all children up to higher secondary levels. Government-run care facilities for children below 6 years should be universalized, i.e. made available to all through provision of crèches\/day-care so that their older siblings get opportunities for schooling from the very beginning.<\/p>\n\n\n\n<p>– Promoting innovative technology during the crisis, especially for distance learning, training and monitoring, to make them systematic.<\/p>\n\n\n\n<p>– Strengthening of the public emergency programs so that each and every child irrespective of geographical stratification could be reached.<\/p>\n\n\n\n<p><strong><u>Section III – CRY’s work on addressing Child Labour<\/u><\/strong><\/p>\n\n\n\n<strong>15. What is CRY’s intervention with reference to addressing the issue of Child Labour?<\/strong>\n\n\n\n<p>Programming on Child Labour includes both interventions that are focused on prevention as well as response to the issue of child labour. As part of the prevention programme, we address issues of vulnerability at the household level by:<\/p>\n\n\n\n<p>– Linking families to various social protection schemes.<\/p>\n\n\n\n<p>– Ensuring that all children of school-going age are enrolled and attending full-time formal schools.<\/p>\n\n\n\n<p>–&nbsp; Model building to eliminate child labour in our intervention areas.<\/p>\n\n\n\n<p>The interventions focusing on response to child labour include:<\/p>\n\n\n\n<p>– Advocacy for effective implementation of legislations, provide information on child labour towards raid and rescue with a detailed roadmap for rehabilitation plans.<\/p>\n\n\n\n<p>– In the context of migration\/trafficking of children for labour purpose from one state to another, in our interventions focus on strengthening mechanisms towards the repatriation, rehabilitation and re-integration of such children. This works through help of various networks and alliances working across within and different states.<\/p>\n\n\n\n<p>– Strategically engage with NCLP system for mainstreaming child labourers into formal schooling system.<\/p>\n\n\n\n<p>– Capacity building of service providers, including the district labour officer, SJPU, CWC, DCPU, PRIs, village child protection committees etc will constitute an important component of our programme.<\/p>\n\n\n\n<p><strong><em>Along with this, CRY as an organization also believes,<\/em><\/strong><\/p>\n\n\n\n<p>– Child protection programming will be effective only when there is convergence amongst key departments of women and child development, education, labour, health and department of home. Therefore we will advocate for strong convergence mechanism at different level.<\/p>\n\n\n\n<p>– While all children are vulnerable to child protection failures, the children of different age groups experience vulnerability that is peculiar to that age. The children in the age group of 15-18 lack sufficient safety nets and are extremely vulnerable to exploitative situations. Through our intervention, now we focus on addressing this age group.<\/p>\n\n\n\n<p>– CRY also mobilizes communities to demand for basic services for ensuring the protection of children in their community.<\/p>\n\n\n\n<p>– Children collectives constitute an important component of our child protection programme. These collective serve as peer support group towards the protection of children in that community. It also serves as a platform for children to share and discuss issues that affect them as well as learn life skills.<\/p>\n\n\n\n<p><strong>16. What can I do if I see child labour?<\/strong><\/p>\n\n\n\n<p>If you find a working child, you could do any one of these –<\/p>\n\n\n\n<p>– Report the same to Childline by dialling 1098.<\/p>\n\n\n\n<p>– Contact the nearest police station.<\/p>\n\n\n\n<p>– Approach the concerned Child Welfare Committee (CWC).<\/p>\n\n\n\n<p>– Approach the District Collector\/District Magistrate.<\/p>\n\n\n\n<p><strong>17. What can I, in my personal capacity, do to reduce child labour in India?<\/strong><\/p>\n\n\n\n<p>– Do not employ a child for cash or for kind.<\/p>\n\n\n\n<p>– Raise an alarm yourself or through administration if you find your known person employing a child.<\/p>\n\n\n\n<p>– Raise awareness about the issue among family, peer, workspace.<\/p>\n\n\n\n<p>– Spread the word by using various forms of communication\/joining e-groups etc.<\/p>\n\n\n\n<p>– Take action by sensitizing your immediate community members about not employing child labour.<\/p>\n\n\n\n<p>– Pledge your support to help a child continue education.<\/p>\n\n\n\n<p>Child labour is not a social issue that can be eradicated swiftly. Despite decades worth of efforts by governments, NGOs and the society at large – the problem persists. However, by understanding the issue in depth and taking conscientious steps against child labour in our day-to-day lives, it is a challenge that we can overcome – together. You can do your bit by&nbsp;<a href=\"\/protect-children-from-child-labour-acld\/?utm_source=website&amp;utm_medium=blog&amp;utm_campaign=61115&amp;utm_content=blog-orgnc-faqs-child-labour\">donating to CRY<\/a>&nbsp;and helping several children lead happier and healthier childhoods.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Child labour has been a perennial problem in India – one that has tremendous short term as well as long term ramifications for the lives of underprivileged children. However, in order to face this challenge effectively, we must understand child labour in the present day context. What are the laws pertaining to&nbsp;child labour in India? [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[4],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2060"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=2060"}],"version-history":[{"count":16,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2060\/revisions"}],"predecessor-version":[{"id":6925,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2060\/revisions\/6925"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=2060"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=2060"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=2060"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}