{"id":2252,"date":"2020-09-29T18:57:23","date_gmt":"2020-09-29T13:27:23","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=2252"},"modified":"2022-07-18T12:44:54","modified_gmt":"2022-07-18T07:14:54","slug":"celebrate-international-literacy-day-by-supporting-childrens-education","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/celebrate-international-literacy-day-by-supporting-childrens-education\/","title":{"rendered":"Celebrate International Literacy Day By Supporting Children’s Education"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"1200\" height=\"628\" src=\"\/wp-content\/uploads\/celebrate-international-literacy-day-by-supporting-childrens-education.jpg\" alt=\"International Literacy Day\" class=\"wp-image-2254\"\/><\/figure>\n\n\n\n<p>The&nbsp;Coronavirus&nbsp;outbreak&nbsp;has been extremely challenging for people across the world. India is also&nbsp;struggling to&nbsp;handle&nbsp;the repercussions of the pandemic. The impact of COVID-19 is leaving a trail of destruction for India’s underprivileged children, especially in the context of&nbsp;their&nbsp;education. According to UNICEF, more than 247 million children enrolled in elementary and secondary&nbsp;schools&nbsp;and 28 million children who were attending pre-school in Anganwadi centers, have been impacted&nbsp;so far&nbsp;due to the closure of schools.<\/p>\n\n\n\n<p>Underprivileged children are not just experiencing an unexpected gap in their schooling, they are also struggling with a massive learning deficit. An estimated 46.24 million children, between 6-18 years of age, were&nbsp;already&nbsp;out of school in 2016 (DISE 2016-17 and RGI Census Population Projection 2016). Given the loss of livelihoods during the lockdown, the closure of schools and the severe lack of access to digital aids, this number is going to increase rapidly. Without stable internet access and the scarcity of digital learning devices, children across urban slums and villages shall continue to suffer from a lack of learning. Several families are facing extreme poverty which puts more underprivileged children at risk of discontinuing their education permanently in the aftermath of the on-going crisis.<\/p>\n\n\n\n<p>8th September is commemorated as International Literacy Day to promote the importance of education among all communities. This year, there is an urgent need to champion the cause of&nbsp;education&nbsp;in India to ensure&nbsp;that&nbsp;children from vulnerable families are protected from the vicious cycle of illiteracy and its&nbsp;long term&nbsp;consequences.<\/p>\n\n\n\n<p>At CRY, we are working tirelessly to help children continue their education by setting up digital learning centers and providing the essential digital aids to support both India’s teachers and underprivileged children. CRY, an&nbsp; <a href=\"\/blog\/non-profit-organization-that-helps-in-educating-underprivileged-children-in-india\">NGO for child education<\/a>, is working with communities to ensure that children continue learning even in these uncertain times. We’re creating awareness on the importance of education through IVRS, conducting teacher sensitization workshops on precautions to be followed before the opening of schools, and restoring the provisions of mid-day meals in schools.<\/p>\n\n\n\n<p>So far, we&nbsp;have distributed 3210 sets of workbooks and 30,528 sets of study material among underprivileged children&nbsp;in addition to conducting&nbsp;online classes on WhatsApp for children, holding&nbsp;peer-to-peer online learning sessions on academic subjects, arts and crafts, etc.,&nbsp;managing&nbsp;online summer camps and learning sessions and organizing&nbsp;virtual Q&amp;A sessions. We have also conducted online classes for children and adolescent girls on menstrual hygiene, making facemasks and hygiene protocols, tutored 50 children through home visits in tribal districts, enabled the functioning of Child Activity Centers to help children resume their studies, digitized the syllabus for 4th grade &amp; 5th grade to facilitate e-learning for students, and also created educational content in regional languages.<\/p>\n\n\n\n<p>We want to reach more children as they are the unseen victims of this crisis and their struggles are the invisible costs this pandemic will claim. Your help can make a big difference in ensuring that India’s underprivileged children survive and thrive in a COVID world. This Literacy Day, grab the opportunity to donate generously and support&nbsp;<a href=\"\/education-for-children-covid-resilience-recovery\/\">education for children<\/a>&nbsp;to ensure that they have a chance at a brighter future. Donate now!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The&nbsp;Coronavirus&nbsp;outbreak&nbsp;has been extremely challenging for people across the world. India is also&nbsp;struggling to&nbsp;handle&nbsp;the repercussions of the pandemic. The impact of COVID-19 is leaving a trail of destruction for India’s underprivileged children, especially in the context of&nbsp;their&nbsp;education. According to UNICEF, more than 247 million children enrolled in elementary and secondary&nbsp;schools&nbsp;and 28 million children who were attending [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2252"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=2252"}],"version-history":[{"count":7,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2252\/revisions"}],"predecessor-version":[{"id":3514,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2252\/revisions\/3514"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=2252"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=2252"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=2252"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}