{"id":2360,"date":"2020-10-08T13:18:08","date_gmt":"2020-10-08T07:48:08","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=2360"},"modified":"2022-07-18T12:44:43","modified_gmt":"2022-07-18T07:14:43","slug":"child-trafficking-abuse-must-be-addressed-in-india","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/child-trafficking-abuse-must-be-addressed-in-india\/","title":{"rendered":"Child Trafficking &#038; Child Abuse In India Must be Addressed"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img src=\"\/wp-content\/uploads\/child-trafficking.jpg\" alt=\"Child Trafficking in India\" class=\"wp-image-2363\"\/><\/figure>\n\n\n\n<p>Child trafficking is a horrifying reality across the globe and it is worsening in India. NCRB 2018 highlights that 51% of all trafficking victims were children, of which more than 80% were girls. This statistic is a stark reality of the escalating problem of&nbsp;<strong>child trafficking in India<\/strong>&nbsp;that must be acknowledged and addressed.<\/p>\n\n\n\n<p>Disadvantaged communities &#8211; Dalits, tribals, religious minorities &#8211; are most vulnerable to trafficking. Children from underserved families are subject to trafficking in the form of forced child labour and\/or sex trafficking. Several children are illegally employed in brick kilns, construction sites and agricultural fields.&nbsp;<strong>Child trafficking<\/strong>&nbsp;also takes form when children are forcefully engaged in begging rackets and other such activities. Many children are sold by their parents to work in factories and other industries that are highly dangerous with toxic environments. Apart from this, horrific stories emerge daily of young girls being forced into the sex trade. Parents of these children are either betrayed or lured due to their poor socio-economic conditions that eventually compel them to ‘send’ or ‘sell’ their children for ‘better livelihood options’. Most traffickers exploit their lack of awareness, especially when it comes to the uneducated and poor living in the slums and other backward regions in the country. Traffickers promise daily wages to parents of young children and transport them to big cities where they are often treated as commodities. Families in dire financial conditions are often approached by traffickers with an offer to buy their children and with no other escape from their pitiful conditions, parents comply.<\/p>\n\n\n\n<p>We, at CRY, work passionately towards a solution-oriented approach to this deep-rooted problem with &#8216;child protection&#8217; being one of the priorities for CRY. While the program focuses on the prevention of issues like child trafficking in the intervention areas, it also facilitates ‘rescue’, ‘restoration’, and ‘rehabilitation’ of the trafficked victims. <\/p>\n\n\n\n<p>Child trafficking denies children their basic rights to good health, nutrition, education, and freedom from violence and exploitation. All children have a right to care and protection, develop and grow to his\/her full potential, regardless of their social and economic situation.<\/p>\n\n\n\n<p>You can help stop&nbsp;child trafficking&nbsp;as it’s also a form of child abuse in India. Support CRY to protect India’s most vulnerable children.&nbsp; <a href=\"\/donation\/\">Donate now!<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Child trafficking is a horrifying reality across the globe and it is worsening in India. NCRB 2018 highlights that 51% of all trafficking victims were children, of which more than 80% were girls. This statistic is a stark reality of the escalating problem of&nbsp;child trafficking in India&nbsp;that must be acknowledged and addressed. Disadvantaged communities &#8211; [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2360"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=2360"}],"version-history":[{"count":12,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2360\/revisions"}],"predecessor-version":[{"id":11089,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2360\/revisions\/11089"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=2360"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=2360"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=2360"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}