{"id":2366,"date":"2020-10-08T15:11:24","date_gmt":"2020-10-08T09:41:24","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=2366"},"modified":"2022-07-18T12:44:32","modified_gmt":"2022-07-18T07:14:32","slug":"gender-inequality","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/gender-inequality\/","title":{"rendered":"Gender Inequality Continues To Affect The Lives Of Many Girls In India"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"799\" height=\"533\" src=\"\/wp-content\/uploads\/gender-inequality-continues-to-affect-the-lives-of-many-girls-in-india.jpg\" alt=\"Gender Inequality\" class=\"wp-image-2605\"\/><\/figure>\n\n\n\n<p>Gender inequality has been a crucial social issue in India for centuries. Census 2011 shows the child sex ratio among children of 0-6 years to be 918 girls for every 1000 boys in India. This statistic speaks for itself and demands urgent and efficient solutions to address the cause of gender inequality.&nbsp;<\/p>\n\n\n\n<p>The discrimination starts from even before the girl child is born. In many instances, she is prevented from being born. The girl child is considered a burden. She is often deprived of the basic rights and equal opportunities to lead a wholesome childhood and adult life. According to the Census 2011, from the total child population in India, girls account for 48%, many of whom are engaged in child labour, child trafficking and child marriage. The future of innumerable girls looks grim, as shown by the following statistics:<\/p>\n\n\n\n<ol style=\"margin-bottom: 10px;\"><li>12.15 million children are married in India &#8211; 8.9 million are girls; married girls are three times the boys. (Census 2011)<\/li><li>51% of all trafficking victims were children, of which more than 80% were girls. (NCRB 2018)<\/li><li>There are 223 million child brides in India; 102 million were married before turning 15. (UNICEF)<\/li><\/ol>\n\n\n\n<p>Patriarchal norms hold back many girls from striving for their dreams by receiving a quality education, medical facilities and overall awareness for their well-being. We, at CRY, have been working towards bridging the gap and ensuring that young girls across India receive essential resources that help improve their mental, physical, and emotional development. Discrimination issues in India are deep-rooted and practiced for generations, and that is why it requires long-term intervention, which we have been providing to underserved communities across India.<\/p>\n\n\n\n<p>CRY aims to create a world where the girl child is celebrated and has access to equal opportunities to study, to grow, and to prosper as her male counterpart.&nbsp;<\/p>\n\n\n\n<p>CRY’s efforts to bring about a change in this situation include:<\/p>\n\n\n\n<ul style=\"margin-bottom: 10px;\"><li>Education that helps create attitudinal shifts towards gender bias, and activities to spread awareness.<\/li><li>Continuous efforts toward breaking myths and stereotypes around gender.<\/li><li>Ensuring accountability of the State to implement various schemes, policies, laws, constitutional guarantees, and international commitments.<\/li><li>Institutionalizing gender-sensitive processes within various systems such as law and programs.<\/li><li>Encouraging community ownership in preventing violations based on gender discrimination.<\/li><\/ul>\n\n\n\n<p>Be it education, health, protection, or participation, all girls deserve equal opportunities and an empowering environment to thrive. You can help CRY reach out to more girls and help make a difference in their lives to ensure they lead happier and healthier childhoods.&nbsp;<a href=\"\/donation\" target=\"_blank\" aria-label=\"undefined (opens in a new tab)\" rel=\"noreferrer noopener\">Donate now<\/a>&nbsp;to help promote the rights of young girls and resolve gender inequality in India.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Gender inequality has been a crucial social issue in India for centuries. Census 2011 shows the child sex ratio among children of 0-6 years to be 918 girls for every 1000 boys in India. This statistic speaks for itself and demands urgent and efficient solutions to address the cause of gender inequality.&nbsp; The discrimination starts [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2366"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=2366"}],"version-history":[{"count":10,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2366\/revisions"}],"predecessor-version":[{"id":3033,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2366\/revisions\/3033"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=2366"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=2366"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=2366"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}