{"id":2409,"date":"2020-10-09T10:29:09","date_gmt":"2020-10-09T04:59:09","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=2409"},"modified":"2022-07-18T12:44:20","modified_gmt":"2022-07-18T07:14:20","slug":"poverty-in-india-affects-underserved-children-in-multiple-ways","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/poverty-in-india-affects-underserved-children-in-multiple-ways\/","title":{"rendered":"Poverty In India Affects Underserved Children In Multiple Ways"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img src=\"\/wp-content\/uploads\/children-are-powerful-agents-of-change.jpg\" alt=\"Poverty In India\" class=\"wp-image-2412\"\/><\/figure>\n\n\n\n<p>Poverty in India affects millions of people. Underprivileged children, in particular, are one of the worst-hit groups that suffer due to the repercussions of poverty &#8211; immediate as well as long-term. It is one of the reasons why several children are deprived of their basic rights and are unable to access resources that are crucial to lead a wholesome and healthy childhood. From infant\/child mortality to education, children lead a life that is impoverished in more ways than one. Read on to know how poverty affects the lives of children from underserved families in India:<\/p>\n\n\n\n<ol type=\"1\"><li>When basic needs are not met, education is one of the first areas in a child’s life that gets affected. Many children are either never enrolled in a school or drop out soon; never to be re-enrolled in most cases. An estimated 46.24 million children were out of school in 2016 (DISE 2016-17 and RGI Census Population Projection 2016). A number that will only get worse if the source, i.e. poverty, is not addressed. Many communities in India, still consider education to be a luxury. It is given lesser importance when compared to daily and minimum wages.<br \/><\/li><li>Health is another irrefutable area of a child’s life that gets ignored in poverty-ridden families. As NFHS 4 2016 shows, every 3rd child under 5 years of age in India is stunted\/severely malnourished. This is also due to a lack of awareness that leads to severe health issues early in life. Many children do not receive complete immunizations, adequate diet etc. that worsens their condition.<br \/><\/li><li>Poverty also gives rise to another major social issue in India that is multiplying at an alarming rate – child labour. According to the Census 2011, there are more than 10 million (under the age of 14) working children in India. Many families send off their children to do odd jobs (restaurants, shops, factories and other illegal activities) to bring in some money to feed the many starving bellies. For a child, working is mentally, physically, and emotionally traumatic during their impressionable years. It deprives him of a chance at a brighter future and keeps him stuck in the cycle of poverty.<\/li><\/ol>\n\n\n\n<p>There many more areas in the life of an at-risk child where the impact of poverty is destroying their potential and putting them in harm’s way. CRY has been working with multiple stakeholders – the government, marginalized families, panchayats etc. to help address the issue of poverty and protect children from its consequences.&nbsp;<a href=\"\/donation\" target=\"_blank\" aria-label=\"undefined (opens in a new tab)\" rel=\"noreferrer noopener\">Donate now<\/a>&nbsp;to help CRY provide the necessary tools to give underprivileged children of India a better future!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Poverty in India affects millions of people. Underprivileged children, in particular, are one of the worst-hit groups that suffer due to the repercussions of poverty &#8211; immediate as well as long-term. It is one of the reasons why several children are deprived of their basic rights and are unable to access resources that are crucial [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[4],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2409"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=2409"}],"version-history":[{"count":7,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2409\/revisions"}],"predecessor-version":[{"id":8473,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2409\/revisions\/8473"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=2409"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=2409"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=2409"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}