{"id":2707,"date":"2020-10-15T11:00:14","date_gmt":"2020-10-15T05:30:14","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=2707"},"modified":"2022-07-18T12:44:03","modified_gmt":"2022-07-18T07:14:03","slug":"celebrate-international-day-of-the-girl-child-with-cry","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/celebrate-international-day-of-the-girl-child-with-cry\/","title":{"rendered":"Celebrate International Day of the Girl Child With CRY"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"1200\" height=\"628\" src=\"\/wp-content\/uploads\/celebrate-international-day-of-the-girl-child-with-cry.jpg\" alt=\"International Day of the Girl Child\" class=\"wp-image-2708\"\/><\/figure>\n\n\n\n<p>The International Day of the Girl Child is celebrated on 11th October to bring attention to the challenges faced by young girls across the globe. The occasion also spreads awareness on how we can collectively help amplify their voices and fight for their future. In India, the empowerment of the girl child is of great importance as there are many young girls, especially from the underserved communities, who are deprived of their basic rights.<\/p>\n\n\n\n<p>There&nbsp;is a major disparity in the way girls are treated. Many girls are deprived of love and care, are considered as a burden, and often fall prey to abuse and exploitation. The child sex ratio further highlights the imbalance for there are 918 girls in the age group of 0-6 years for 1000 boys, according to the Census 2011.<\/p>\n\n\n\n<p>Education is one of the main areas of concern for girls in India as DISE 2016-17 shows that 30% of girls in the country finish class 12 age-appropriately; which&nbsp;leaves the majority of girls without access to quality education. This is also because many families in underserved communities expect girls to either sit at home and look after the household chores or earn minimum daily wages to make ends meet.<\/p>\n\n\n\n<p>Census 2011 data indicates that there are 13 million married adolescent girls between 10-19 years in India, a statistic that alarmingly pulls them further away from learning and building a prosperous future.&nbsp;<a href=\"\/blog\/importance-of-girl-child-education-in-india\/\">Education for the girl child<\/a>&nbsp;helps them step out of the cycle of generational poverty and broaden their horizon by developing a healthy world-view, strengthening their personality, and pursuing their dreams. But engaging in child labor or child marriage holds them back and affects their mental, physical, and emotional well-being.<\/p>\n\n\n\n<p>CRY&nbsp;is an Indian&nbsp;<a href=\"\/blog\/help-cry-ngo-educate-girls-in-india-for-a-brighter-future\/\">NGO&nbsp;that&nbsp;helps educate girls<\/a>&nbsp;and protect them in various ways, including spreading awareness among communities, creating dialogs with policymakers, extending resources to young girls across India etc.&nbsp;You&nbsp;can help make a difference to support them. The spirit of the International Day of the Girl Child lies in making an effort and your generous contribution to CRY is the first step in that direction. Do your bit and donate right away!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The International Day of the Girl Child is celebrated on 11th October to bring attention to the challenges faced by young girls across the globe. The occasion also spreads awareness on how we can collectively help amplify their voices and fight for their future. In India, the empowerment of the girl child is of great [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2707"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=2707"}],"version-history":[{"count":4,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2707\/revisions"}],"predecessor-version":[{"id":2859,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/2707\/revisions\/2859"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=2707"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=2707"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=2707"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}