{"id":3648,"date":"2020-11-25T17:53:07","date_gmt":"2020-11-25T12:23:07","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=3648"},"modified":"2022-07-18T12:43:50","modified_gmt":"2022-07-18T07:13:50","slug":"how-swift-action-helped-kavita-deliver-a-healthy-baby-against-all-odds","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/how-swift-action-helped-kavita-deliver-a-healthy-baby-against-all-odds\/","title":{"rendered":"How swift action helped Kavita deliver a healthy baby against all odds"},"content":{"rendered":"<figure class=\"wp-block-image size-large\"><img class=\"wp-image-1532\" src=\"\/wp-content\/uploads\/How-swift-action-helped-Kavita-deliver-a-healthy-baby-against-all-odds.jpeg\" alt=\"keep underprivileged children healtthy\"\/><\/figure>\n\n\n<p>The pandemic may be wreaking havoc but at CRY, we’re braving the odds to ensure underprivileged communities and their children stay safe.<\/p>\n\n\n\n<p>The story of 20-year-old Kavita Devi from East Champaran, Bihar comes to mind. With a baby on the way and financial scarcity, her husband found work in Haryana and left her in the care of her mother-in-law.<\/p>\n\n\n\n<p>When Kavita felt weak and noticed inflammation in her feet during her pregnancy, she brought it up with her mother-in-law who dismissed it and told her not to worry. CRY project CHARDS, while conducting home visits, suspected that she was anaemic and immediately escorted Kavita to the nearest Anganwadi Centre for a check-up. She was indeed diagnosed with severe anaemia and referred to a nearby hospital where she was given proper care. When she returned from the hospital, the Anganwadi worker and Auxiliary Nurse Midwife (ANM) along with our project staff continued keeping a tab on Kavita throughout her pregnancy to ensure that she and her baby were healthy.<\/p>\n\n\n\n<p>Things changed drastically when floods hit their locality in August. Their village got completely submerged, leaving the entire community to take shelter in a nearby elevated narrow strip of land. Heavily pregnant at the time, Kavita began feeling labour pains and it seemed to her mother-in-law that the only way ahead was a home delivery.<\/p>\n\n\n\n<p>But when CRY was notified of Kavita’s situation, the project staff began thinking of alternatives to get her to the district hospital. They were cut off from all modes of transportation as well as communication but managed to get a boat that ferried her to the hospital.<\/p>\n\n\n\n<p>Reaching just in time, Kavita gave birth to a girl. While she was underweight at birth, CRY project CHARDS ensured proper nutrition counselling and helped the newborn reach a healthy weight within a week!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The pandemic may be wreaking havoc but at CRY, we’re braving the odds to ensure underprivileged communities and their children stay safe. The story of 20-year-old Kavita Devi from East Champaran, Bihar comes to mind. With a baby on the way and financial scarcity, her husband found work in Haryana and left her in the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[15],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/3648"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=3648"}],"version-history":[{"count":4,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/3648\/revisions"}],"predecessor-version":[{"id":3694,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/3648\/revisions\/3694"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=3648"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=3648"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=3648"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}