{"id":3655,"date":"2020-11-25T18:08:55","date_gmt":"2020-11-25T12:38:55","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=3655"},"modified":"2022-07-18T12:43:36","modified_gmt":"2022-07-18T07:13:36","slug":"beating-child-marriage-to-chase-her-dreams-even-in-covid-times","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/beating-child-marriage-to-chase-her-dreams-even-in-covid-times\/","title":{"rendered":"Beating child marriage to chase her dreams even in COVID times"},"content":{"rendered":"<figure class=\"wp-block-image size-large\"><img class=\"wp-image-1532\" src=\"\/wp-content\/uploads\/Beating-child-marriage-to-chase-her-dreams-even-in-COVID-times.jpg\" alt=\"child marriage in india\"\/><\/figure>\n\n\n<p>Children are bearing the brunt of the on-going pandemic in so many ways but at CRY, we’re not backing down!<\/p>\n\n\n\n<p>Take the case of 17-year-old Sabita* from a fisherman community in Samastipur, Bihar. A fishmonger at the local market, her father is the only breadwinner in their large family with 6 children – 5 of whom are girls.<\/p>\n\n\n\n<p>To ease their financial burden, the father got all 4 of Sabita’s older sisters married as soon as he could. When Sabita turned 15, her family began searching for a groom for her too, just like they had done for her sisters. What was different in Sabita’s case was that she was an active member of CRY’s children’s group that conducted sessions on child rights, including child marriage and its ill effects.<\/p>\n\n\n\n<p>Empowered by the sessions at the children’s group, Sabita stood up for herself and told her family that she wanted to continue studying instead of getting married. She also notified CRY project JJBVK that counselled the parents and ensured that Sabita was admitted in school.<\/p>\n\n\n\n<p>Everything seemed to be going well for Sabita but with the outbreak of COVID-19 and the subsequent lockdown, her parents again decided to get her married. To them, she was in 11th grade now and it was already past the right time to get her married. Having the wedding during the lockdown would also save them a lot of expenditure.<\/p>\n\n\n\n<p>When Sabita got to know about this, she immediately got in touch with one of her peers in the CRY adolescent group that she was now a part of. Her friend got in touch with CRY who in turn contacted all the key stakeholders including the Anganwadi workers and local government officials. Each of these people visited the family individually and spoke to them about the concerns around Sabita getting married early.<\/p>\n\n\n\n<p>Multiple rounds of discussions and meetings paid off when the family finally agreed that they would not get Sabita married till she completed her education – leaving her elated at the thought of being able to continue pursuing her dreams!<\/p>\n\n\n\n<p>*Name changed to protect child’s identity<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Children are bearing the brunt of the on-going pandemic in so many ways but at CRY, we’re not backing down! Take the case of 17-year-old Sabita* from a fisherman community in Samastipur, Bihar. A fishmonger at the local market, her father is the only breadwinner in their large family with 6 children – 5 of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/3655"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=3655"}],"version-history":[{"count":3,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/3655\/revisions"}],"predecessor-version":[{"id":3692,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/3655\/revisions\/3692"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=3655"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=3655"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=3655"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}