{"id":3909,"date":"2021-01-25T10:18:22","date_gmt":"2021-01-25T04:48:22","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=3909"},"modified":"2022-07-18T12:42:24","modified_gmt":"2022-07-18T07:12:24","slug":"support-the-education-of-children-and-avail-a-50-tax-benefit","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/support-the-education-of-children-and-avail-a-50-tax-benefit\/","title":{"rendered":"Support The Education Of Children And Avail A 50% Tax Benefit"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"799\" height=\"533\" src=\"\/wp-content\/uploads\/Education-Of-Children.jpg\" alt=\"ngo for child education\" class=\"wp-image-3910\"\/><\/figure>\n\n\n\n<p>The pandemic has been difficult for many communities in India, especially underprivileged children. The trail of destruction caused by the pandemic has left an immediate as well as a long-term impact on the lives of children. According to UNICEF, more than 247 million children in India have been impacted due to the closure of schools so far.<\/p>\n\n\n\n<p>Underprivileged children are not just experiencing an unexpected gap in their schooling; they are also struggling with a massive learning deficit. Without any form of digital access or a stable internet connection, children across urban slums and villages are unable to continue learning. India already had&nbsp;an estimated 46 million children between 6-18 years of age who are not in school. Given the loss of livelihoods during the lockdown, the closure of schools and the severe lack of access to digital aids, this number is going to increase rapidly. The ripple effects of the pandemic have been far-reaching and education must be&nbsp;made&nbsp;a priority to help control any further damage to their learning curve..<\/p>\n\n\n\n<p>Education helps break the cycle of poverty as children get the opportunity to complete their studies and earn a&nbsp;better&nbsp;living&nbsp;through enhanced job opportunities as adults. It reduces the likelihood of child labour and child marriage and helps&nbsp;children get to hone their potential and chase their dreams of leading a happy, healthy and prosperous adult life.<\/p>\n\n\n\n<p>There are innumerable reasons why all children must receive regular and quality education and that is why we, at CRY, strive to&nbsp;ensure that&nbsp;underprivileged children across India&nbsp;are able to complete their education.<\/p>\n\n\n\n<p>To help prevent children from discontinuing their education permanently during the on-going crisis, please generously donate to CRY – we’re an <a href=\"\/\">NGO that works for children’s education<\/a> in addition to their health, nutrition and protection. Your contribution can give India’s underprivileged children a chance at a brighter future even in a COVID world and help you avail a 50% income tax exemption on your donation to us under Section 80G of the Income Tax Act. So give India’s children a chance at a brighter future while claiming tax benefits. Donate now!<\/p>\n\n\n\n<div class=\"wp-container-1 wp-block-group\"><div class=\"wp-block-group__inner-container\"><\/div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>The pandemic has been difficult for many communities in India, especially underprivileged children. The trail of destruction caused by the pandemic has left an immediate as well as a long-term impact on the lives of children. According to UNICEF, more than 247 million children in India have been impacted due to the closure of schools [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3,19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/3909"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=3909"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/3909\/revisions"}],"predecessor-version":[{"id":11087,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/3909\/revisions\/11087"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=3909"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=3909"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=3909"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}