{"id":3917,"date":"2021-01-28T09:57:29","date_gmt":"2021-01-28T04:27:29","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=3917"},"modified":"2022-07-18T12:42:15","modified_gmt":"2022-07-18T07:12:15","slug":"gift-a-brighter-future-to-young-girls-on-national-girl-child-day","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/gift-a-brighter-future-to-young-girls-on-national-girl-child-day\/","title":{"rendered":"Gift A Brighter Future to Young Girls On National Girl Child Day"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img src=\"\/wp-content\/uploads\/gift-a-brighter-future-to-young-girls-on-national-girl-child-day.jpg\" alt=\"National Girl Child Day\" class=\"wp-image-3910\"\/><\/figure>\n\n\n\n<p>Every year, National Girl Child Day is celebrated in India on 24th January. This day was marked by the Ministry of Women and Child Development and the Government of India in 2008, with the purpose of spreading awareness among people regarding the many inequalities that most girls face in India.<\/p>\n\n\n\n<p>Initiatives like National Girl Child Day help throw light on the plight of young girls where many of them are deprived of their basic rights. Census 2011 shows that the girl child population in India is 224.6 million – be it education, healthcare facilities or growth opportunities, several girls are neglected solely based on their gender, irrespective of the capabilities that they may have. Several glaring issues surround girls in various belts of India – from child marriage and gender discrimination to bearing children at an early age and becoming victims of child labour; there are many areas where urgent intervention is required to support young girls.<\/p>\n\n\n\n<p>Child marriage in India continues to be rampant. While the legal age for girls in India to get married is 18 years, our country still has the highest number of child brides in the world. According to a recent report, 1 in every 3 child brides in the world are from India*(*Source – UNICEF 2014) and as per NCRB 2018, 51% of all trafficking victims were children where more than 80% were girls. This stark reality is harsh and needs to be addressed.<\/p>\n\n\n\n<p>Awareness drives that emphasise the rights of the girl child help in encouraging the community to take ownership of protecting its girls. Education also helps in breaking stereotypes and myths surrounding gender inequality. Girls who complete their schooling have a better chance of achieving their dreams and even becoming community leaders. Girl child rights need to be aggressively advocated by various stakeholders, including individuals, government organisations, policymakers and NGOs.<\/p>\n\n\n\n<p>CRY <a href=\"\/blog\/help-cry-ngo-educate-girls-in-india-for-a-brighter-future\/\">NGO helps educate girls<\/a> and extend resources for their overall well-being and protection. It is imperative that girls are treated equally with the same opportunities, celebrated for their achievements, and nurtured to go on and succeed in life. You can donate to CRY to commemorate National Girl Child Day and help us make a difference in the lives of millions of girls!<\/p>\n\n\n\n<div class=\"wp-container-1 wp-block-group\"><div class=\"wp-block-group__inner-container\"><\/div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Every year, National Girl Child Day is celebrated in India on 24th January. This day was marked by the Ministry of Women and Child Development and the Government of India in 2008, with the purpose of spreading awareness among people regarding the many inequalities that most girls face in India. Initiatives like National Girl Child [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[12],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/3917"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=3917"}],"version-history":[{"count":4,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/3917\/revisions"}],"predecessor-version":[{"id":11086,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/3917\/revisions\/11086"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=3917"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=3917"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=3917"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}