{"id":4183,"date":"2021-04-07T09:47:07","date_gmt":"2021-04-07T04:17:07","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=4183"},"modified":"2022-07-18T12:41:38","modified_gmt":"2022-07-18T07:11:38","slug":"this-world-health-day-join-hands-to-protect-underprivileged-children","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/this-world-health-day-join-hands-to-protect-underprivileged-children\/","title":{"rendered":"This World Health Day, Join Hands To Protect Underprivileged Children"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"628\" src=\"\/wp-content\/uploads\/this-world-health-day-join-hands-to-protect-underprivileged-children.jpg\" alt=\"World Health Day\" class=\"wp-image-4185\"\/><\/figure>\n\n\n\n<p>The pandemic has hit many communities in India, especially underprivileged children. The long-term damage of the coronavirus outbreak has made matters worse, and further overwhelmed issues like discontinuation of education and <a href=\"https:\/\/www.cry.org\/blog\/celebrate-world-health-day-and-help-prevent-malnutrition-in-children\/\">malnutrition in India<\/a>. The closure of government healthcare centres, suspension of the school midday meal scheme, loss of family income etc have affected children across the country. The struggle to provide for the family is causing unbearable hunger, health issues, child abuse etc. But children must not suffer as they deserve proper monitoring and care, timely immunizations, adequate nutrition etc.<\/p>\n\n\n\n<p>On the occasion of World Health Day on 7th April, it is essential to throw light on the plight of underprivileged children who require proper aid and assistance. We, at CRY, are working tirelessly to help immunize India’s children against life-threatening diseases. This is even more urgent because, in India, 2 out of every 5 children do not receive complete immunizations (NFHS 4 2016). The children are vulnerable to preventable diseases like measles, polio and tetanus but a lack of quality healthcare often result in severe physical and neurological defects and in extreme cases, even death. We have been providing timely care to lactating and pregnant mothers and addressing menstrual hygiene and anaemia amongst adolescent girls. We are also tackling the severe issue of malnutrition to help reduce the rate of infant\/child mortality. A lowered immunity caused due to a shortage of hygiene supplies, food, and other necessary utilities put many children at risk and so we are addressing the same by ensuring children get proper nutrition.<\/p>\n\n\n\n<p>Due to a lack of awareness, many children miss necessary vaccinations. UNICEF 2018 shows that 2.9 million children in India have missed their measles vaccinations. CRY, the <a href=\"https:\/\/www.cry.org\/\">best NGO in India<\/a>, is working to ensure that underserved children receive timely vaccinations and immunization so that they get a chance to lead healthier and happier childhoods. Ever since the pandemic started affecting the nation, we jumped into action to ensure that more communities, especially children, receive the integral resources they need to stay protected.This World Health Day, join hands with CRY and help us reach more children in need. Donate now!<\/p>\n\n\n\n<div class=\"wp-container-1 wp-block-group\"><div class=\"wp-block-group__inner-container\"><\/div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>The pandemic has hit many communities in India, especially underprivileged children. The long-term damage of the coronavirus outbreak has made matters worse, and further overwhelmed issues like discontinuation of education and malnutrition in India. The closure of government healthcare centres, suspension of the school midday meal scheme, loss of family income etc have affected children [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[11],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/4183"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=4183"}],"version-history":[{"count":7,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/4183\/revisions"}],"predecessor-version":[{"id":11083,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/4183\/revisions\/11083"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=4183"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=4183"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=4183"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}