{"id":6395,"date":"2021-05-21T18:01:06","date_gmt":"2021-05-21T12:31:06","guid":{"rendered":"https:\/\/www.cry.org\/?p=6395"},"modified":"2022-07-18T11:19:00","modified_gmt":"2022-07-18T05:49:00","slug":"help-indias-children-survive-the-second-wave-of-covid-19","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/help-indias-children-survive-the-second-wave-of-covid-19\/","title":{"rendered":"Help India’s Children Survive The Second Wave Of COVID-19"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"1200\" height=\"628\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/help-indias-children.jpg\" alt=\"\" class=\"wp-image-6623\"\/><\/figure>\n\n\n\n<p>The second wave of the pandemic is raging across India and taking a toll on the citizens, especially those hailing from underprivileged communities. Also, with the recent news stories about Black Fungus being called an epidemic in certain states, we need all the help we can get to recover from the devastation caused by the second wave. The resources have been depleting at a faster pace and the quality of life of the underserved is only worsening. The second wave has also seen an increase in the number of children being victims of COVID-19. Before this becomes a child rights crisis in the long term, this alarming situation needs to be controlled.<\/p>\n\n\n\n<p>To support the plight of underprivileged children, we, at CRY, have created a Resilience &amp; Recovery plan that focuses on:<\/p>\n\n\n\n<p><strong>Pandemic Preparedness &amp; Management:<\/strong><\/p>\n\n\n\n<p>Safety measures, testing and vaccinations need to be rigorously discussed to help understand the many queries and worries regarding protection from COVID-19. The apprehensions need to be constantly addressed to ensure that the communities stay informed and aware. To battle the second wave, it is integral to sensitise communities about taking safety precautions and even bust the many myths associated with infections, tests and vaccinations.<\/p>\n\n\n\n<ul style=\"margin-bottom: 30px;\"><li>Awareness is an important aspect of dealing with the pandemic, especially regarding medical aid like vital medicines and oxygen supply. CRY has been organising awareness sessions for essential resources, highlighting how one can manage COVID-19 illness at home, and ways to prevent it from spreading further.<\/li><li>We have also been giving due importance to the psychosocial needs of children by helping them cope with the distress caused by the closure of schools for over a year now.<\/li><\/ul>\n\n\n\n<p><strong>Health &amp; Nutrition:<\/strong><\/p>\n\n\n\n<p>One of the other reasons why children’s health must be given more importance is because many underserved familieshave lost their livelihoods. Due to the closure of government mechanisms like primary healthcare centres and the school midday meal scheme, children are not fed properly. Without healthy food, children’s health has been getting severely affected. They’re unable to get proper nutrition, timely immunization or proper healthcare and thus, we’ll focus on:<\/p>\n\n\n\n<ul style=\"margin-bottom: 30px;\"><li>Ensuring children are given regular vaccinations to avoid susceptibility to other deadly diseases that must not be deprioritized<\/li><li>Providing timely care to lactating and pregnant mothers<\/li><li>Addressing the grave issue of malnutrition to reduce infant\/child mortality<\/li><li>Ensuring awareness and support in the case of menstrual hygiene<\/li><\/ul>\n\n\n\n<p><strong>Safety &amp; Protection:<\/strong><\/p>\n\n\n\n<p>The first wave of COVID-19 saw a significant rise in the cases of child labour, child marriage and trafficking in all the states. With the situation getting worse across India during the second wave, this number is at the risk of rising exponentially. To ensure children stay protected from abuse and exploitation, we’ll focus on:<\/p>\n\n\n\n<ul style=\"margin-bottom: 30px;\"><li>Ensuring that cases, where children are forced into child labour or pushed to become child brides, are identified and carefully handled. There are many reasons why children are subjected to this type of abuse but typically, it occurs to reduce the financial pressure on the family<\/li><li>Strengthening child protection mechanisms at the village as well as district levels<\/li><li>Raising awareness on the negative impact of child labour and child marriage on children’s future<\/li><\/ul>\n\n\n\n<p><strong>Education:<\/strong><\/p>\n\n\n\n<p>Children’s education has been affected by the closure of schools for over a year and the severe lack of digital access has led to a learning deficit. This gap in children’s education needs to be addressed to ensure this situation doesn’t become a permanent one. For the same, we’ll focus on:<\/p>\n\n\n\n<ul style=\"margin-bottom: 30px;\"><li>Providing worksheets, guides and digital support to help children continue studying and cover the lagging period<\/li><li>Conducting community-based study sessions for children in smaller groups using online mediums like WhatsApp to ensure they continue receiving quality and regular education, and are connected with their peers<\/li><\/ul>\n\n\n\n<p><strong>Ensuring urgent care for children without parental supervision:<\/strong><\/p>\n\n\n\n<p>One of the terrible realities of the second wave has been the loss of one or two parents of children due to the disease. Ramifications of this type have brought to the fore various heart-breaking stories of children without parental supervision and care as their parents are in the hospital or under medical care. Several such underprivileged children are even more vulnerable and CRY will ensure that they are provided with care and protection during the unprecedented second wave of COVID-19.<\/p>\n\n\n\n<p>You can donate to&nbsp;<a href=\"https:\/\/www.cry.org\/help-children-survive-covid-second-wave\/\" target=\"_blank\" rel=\"noreferrer noopener\">help India’s children<\/a>, the unseen victims of this pandemic, and help them survive and thrive in and after the second wave of COVID-19. Your donation will help safeguard the future of children and also allow you to avail an <a href=\"https:\/\/www.cry.org\/taxburden-donation\/\" target=\"_blank\" rel=\"noreferrer noopener\">income tax exemption<\/a>. So support CRY’s efforts right away. Donate now!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The second wave of the pandemic is raging across India and taking a toll on the citizens, especially those hailing from underprivileged communities. Also, with the recent news stories about Black Fungus being called an epidemic in certain states, we need all the help we can get to recover from the devastation caused by the [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[15],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/6395"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=6395"}],"version-history":[{"count":10,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/6395\/revisions"}],"predecessor-version":[{"id":6709,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/6395\/revisions\/6709"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=6395"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=6395"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=6395"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}