{"id":6915,"date":"2021-06-09T09:48:56","date_gmt":"2021-06-09T04:18:56","guid":{"rendered":"https:\/\/www.cry.org\/?p=6915"},"modified":"2022-07-18T11:19:02","modified_gmt":"2022-07-18T05:49:02","slug":"this-world-day-against-child-labour-help-protect-underprivileged-children-in-india","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/this-world-day-against-child-labour-help-protect-underprivileged-children-in-india\/","title":{"rendered":"This World Day Against Child Labour Help Protect Underprivileged Children in India"},"content":{"rendered":"<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img width=\"799\" height=\"559\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/World-Day-Against-Child-Labour.jpg\" alt=\"\" class=\"wp-image-6916\"\/><\/figure><\/div>\n\n\n<p>12th June is marked as World Day Against Child Labour across the globe.&nbsp;It aims to raise awareness and prevent child labour. The commemoration of this social cause is extremely important as in India itself, there are more than 10 million working children under the age of 14 (Census 2011). This occasion throws light on the need to take collective actions to help&nbsp;<a href=\"https:\/\/www.cry.org\/blog\/reality-of-the-practice-of-child-labor-in-india\/\" target=\"_blank\" rel=\"noreferrer noopener\">stop child labour<\/a><strong>&nbsp;<\/strong>and implement child rights with more urgency.<\/p>\n\n\n\n<p>There are 472 million children in India which accounts for 40% of the country&#8217;s population. Their rights must be protected at all times. This includes regular education, safety and protection, quality healthcare, and an opportunity for child participation. These fundamental rights are recognized by the government to help safeguard the overall well-being of children, including their physical, emotional, mental and social development.&nbsp;<\/p>\n\n\n\n<p>Unfortunately, the reality shows that according to Census 2011, there are 33 million working children in India between 0-18 years. In many poor families, children are required to take on economic roles to run the house and fend for the family members from an early age. The situation has gotten worse since the coronavirus outbreak last year as many underprivileged families have been falling deeper into the traps of poverty and illness. With limited access to employment opportunities or the loss of jobs of the main breadwinners of the family, children are being pushed into labour work at a more alarming rate.&nbsp;&nbsp;<\/p>\n\n\n\n<p>Engaging children in child labour robs them of their childhood as well as dignity. The impact of child labour is long-term and many times irreversible. Children who work in those impressionable years spend many hours in hazardous working conditions. Such environments (farms, factories, offices etc) are not safe for children. They are also more vulnerable to abuse and exploitation and are deprived of opportunities to learn and play. Such children are unable to nurture their skills and true potential. This leads to a cycle of poverty that includes daily wages and minimum or no quality job opportunities in the future.<\/p>\n\n\n\n<p>We, at CRY, are working hard towards&nbsp;<a href=\"https:\/\/www.cry.org\/why-children\/\" target=\"_blank\" rel=\"noreferrer noopener\">protecting child rights<\/a>&nbsp;and implementing effective methods to help make a difference. We are joining hands with integral stakeholders like community members to eliminate the practice at the village level. During these uncertain and overwhelming times of the pandemic, we are working toensure that children participate in online classes while the schools are shut and attend regular schooling post the lockdown. We are conducting awareness drives with parents on the negative impact of child labour. We continue to identify cases of child labour to help resolve each one of them and ensure that it is in the best interest of children at all costs. We are also connecting underserved families to livelihood schemes to help reduce the financial burden that often compels them to put their children to work.<\/p>\n\n\n\n<p>This World Day Against Child Labour, you can also join hands with CRY to help stop child labour and ensure that underprivileged children across the country have happier childhoods. <a href=\"https:\/\/www.cry.org\/protect-children-from-child-labour-acld\/\">Donate now<\/a>!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>12th June is marked as World Day Against Child Labour across the globe.&nbsp;It aims to raise awareness and prevent child labour. The commemoration of this social cause is extremely important as in India itself, there are more than 10 million working children under the age of 14 (Census 2011). This occasion throws light on the [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[4],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/6915"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=6915"}],"version-history":[{"count":6,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/6915\/revisions"}],"predecessor-version":[{"id":11080,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/6915\/revisions\/11080"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=6915"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=6915"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=6915"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}