{"id":7665,"date":"2021-07-30T12:34:18","date_gmt":"2021-07-30T07:04:18","guid":{"rendered":"https:\/\/www.cry.org\/?p=7665"},"modified":"2022-07-18T11:18:28","modified_gmt":"2022-07-18T05:48:28","slug":"stories-of-covid-warriors-from-crys-on-ground-team","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/stories-of-covid-warriors-from-crys-on-ground-team\/","title":{"rendered":"Stories of COVID Warriors from CRY’s On-Ground Team"},"content":{"rendered":"<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img src=\"https:\/\/www.cry.org\/wp-content\/uploads\/covid-warriors-from-crys-on-ground-team.jpg\" alt=\"Covid Warriors from Crys on Ground Team\" class=\"wp-image-7675\"\/><\/figure><\/div>\n\n\n<p>Amidst the fear of a potential third wave increasing every day because of the new variant, we wanted to draw your attention to a few stories of hope that keep all of us at CRY going, even in these difficult times. Here are a few of many stories of our on-ground partners and volunteers, our very own warriors, who have been fearlessly putting their own lives at risk to protect India’s most vulnerable.<\/p>\n\n\n\n<p><strong>Sara &#8211; A CRY volunteer in Indore who educated people about the importance of vaccination and got them vaccinated.<\/strong><\/p>\n\n\n\n<p>Vaccinations are so vital at times like these that we are not only battling the direst humanitarian crisis, we are also educating everyone about how important they are. It&#8217;s an honour to tell the story of Sara who&#8217;s doing her part to help her local community.<br \/><br \/>While it is extremely scary to step outside during these horrific times, Sara has been going door-to-door educating people about the importance of vaccinations. She volunteers for one of CRY&#8217;s projects in Madhya Pradesh. Her efforts have led her to visit over 1000 homes and spread the message about vaccinations being crucial to combating this unprecedented public health crisis.<br \/><br \/>The community also benefitted from Sara&#8217;s help in clarifying doubts about vaccinations and debunking the myths and misconceptions surrounding them. The work she did certainly paid off and she is credited with vaccinating 250 people in the neighbourhood so far. Sara, not one to give up, keeps encouraging others to get vaccinated in an effort to spread the word and protect everyone, including children.<\/p>\n\n\n\n<p><strong>Fulkumari Devi &#8211; A Ward Panchayat Member of a village in Bihar who educated people about COVID preventive measures.<\/strong><\/p>\n\n\n\n<p>Fulkumari Devi represents the Mushahar community as a Ward Panchayat member for the last five years. She has emerged as a leader in the CRY intervention area as she was an active member of the village level child protection committee. Additionally, she is the chairperson of the school management committee (SMC) in her village. She regularly attends the meetings of the SMC and speaks up about pertinent issues\/concerns as well as participating in other CRY programs at district or state levels.<br \/><br \/>In April, when COVID cases increased, she and her husband noticed that no one around them followed basic COVID protocols. Their solution was to model leadership and to go door-to-door showing people how to follow all COVID preventive measures with masks.<br \/><br \/>Although she worked to protect the community, she was afflicted with COVID -19. She had to confine and isolate herself for some time. Although she was stigmatized by the community, she did not give in. She returned to work full force after her recovery and counselled 12 people about getting vaccinated. Over a hundred people have registered for vaccinations in her ward because of her involvement in awareness programs. The resilience and dedication of Fulkumari Devi to help her community is inspiring.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img width=\"1200\" height=\"628\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/crys-covid-warriors.jpg\" alt=\"\" class=\"wp-image-7667\"\/><\/figure><\/div>\n\n\n<p><strong>Ruby Kumari &#8211; A trainer nurse and CRY project staff in Uttar Pradesh who saved pregnant women and ensured safe delivery of children.<\/strong><\/p>\n\n\n\n<p>Ruby Kumari is a CRY project staff in Uttar Pradesh who is a trained nurse and works in areas with high instances of infant, child, and neonatal mortality rates. The second wave of COVID-19 has led to severe disruptions in health services; this is true especially for remote locations of the country where Asha and Anganwadi workers are not able to provide reproductive health support as they are mostly involved in COVID duty.<br \/><br \/>In a situation like this, without fearing the consequences, Ruby came forward to extend her support to two high-risk pregnant (HRP) mothers. Her valiant efforts saved the mother’s lives and ensured the safe delivery of their children. Likewise, she has helped over 150 pregnant and lactating mothers across 21 villages. CRY, <a href=\"https:\/\/www.cry.org\">India’s top NGO<\/a>, salutes her selfless efforts in keeping children and communities safe even during these testing times.<\/p>\n\n\n\n<p><strong>Jeetender &#8211; A CRY project coordinator who distributed nutrition and hygiene kits to many families and children.<\/strong><\/p>\n\n\n\n<p>Jeetender is a CRY project coordinator in Delhi who came to the aid of many underserved families and their children when everything seemed hopeless. The access to resources and infrastructure during the second wave of COVID-19 was scarce, affecting underprivileged communities the most.<br \/><br \/>Undeterred by the threats posed by the second wave of the pandemic, Jeetender and his team have been continuously serving the underserved families and their children. Till now, they have provided ration kits to 415 families, hygiene kits to 215 families and 400 children have been supported with nutrition and hygiene kits. They facilitated collaboration with a local hospital and helped form a team of doctors who’re providing emergency support and giving free consultation to everyone in need.<\/p>\n\n\n\n<p>Just like our warriors, generous donors like you are also the powerful force behind everything we do. With your support, we can ensure that children stay protected so they can survive and thrive even in the aftermath of the second wave. <a href=\"https:\/\/www.cry.org\/help-children-survive-covid-second-wave\/\">Donate for children<\/a> by supporting CRY’s work.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Amidst the fear of a potential third wave increasing every day because of the new variant, we wanted to draw your attention to a few stories of hope that keep all of us at CRY going, even in these difficult times. Here are a few of many stories of our on-ground partners and volunteers, our [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[16],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/7665"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=7665"}],"version-history":[{"count":6,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/7665\/revisions"}],"predecessor-version":[{"id":11079,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/7665\/revisions\/11079"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=7665"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=7665"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=7665"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}