{"id":7742,"date":"2021-08-06T15:23:41","date_gmt":"2021-08-06T09:53:41","guid":{"rendered":"https:\/\/www.cry.org\/?p=7742"},"modified":"2022-08-09T15:18:11","modified_gmt":"2022-08-09T09:48:11","slug":"a-snapshot-of-crys-covid-19-second-wave-response","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/a-snapshot-of-crys-covid-19-second-wave-response\/","title":{"rendered":"A Snapshot of CRY&#8217;s COVID-19 Second Wave Response"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img src=\"https:\/\/www.cry.org\/wp-content\/uploads\/crys-covid-19-second-wave-response.jpg\" alt=\"Cry Covid-19 Second Wave Response\" class=\"wp-image-7743\"\/><\/figure>\n\n\n\n<p>The second wave of the pandemic has left many underserved communities vulnerable, especially underprivileged children. To help them in these unprecedented and overwhelming times, we, at CRY, have jumped into action. We are working hard to ensure that children and their families are safe and proactive in fighting the spread of coronavirus with awareness, preventive measures, and medical facilities.<\/p>\n\n\n\n<p>The implementation of Covid Relief Phase II by CRY has covered 44 project areas in 19 states through direct implementations and in-kind donations. We have reached 2,364 households and covered 66 health centres covering 172 AAA workers. We have also provided educational support to 8,844 board students, and distributed health kits to 1,085 communities and sanitary kits to 10,939 adolescent girls.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img src=\"https:\/\/www.cry.org\/wp-content\/uploads\/image.png\" alt=\"\" class=\"wp-image-8076\" width=\"816\" height=\"446\"\/><\/figure><\/div>\n\n\n<p><strong>COVID-19 Second Wave Direct Relief<\/strong><\/p>\n\n\n\n<p>Along with our project partners, we have assessed the situation and created an emergency plan to address the immediate protection, health, nutrition and safety needs of children and their families.&nbsp;<\/p>\n\n\n\n<p><strong>Distribution of Oxygen Cylinders under CRY Collaborative efforts<\/strong><\/p>\n\n\n\n<ul><li>GIVE has extended its support in terms of Covid Relief to our partners by distributing oxygen cylinders.&nbsp;<\/li><li>Efforts have been made by the CRY partners to ensure the receipt of the oxygen cylinders to the designated hospitals.<\/li><li>827 (East-183, North-482, South-132, West-30) oxygen cylinders have been distributed till date which covered 295 hospitals throughout CRY intervention areas.<br \/><\/li><\/ul>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img src=\"https:\/\/www.cry.org\/wp-content\/uploads\/image-1.png\" alt=\"\" class=\"wp-image-8077\" width=\"839\" height=\"459\"\/><\/figure>\n\n\n\n<p><br \/><strong>Covid Preventive Awareness &#8211; Innovative Measures<\/strong><br \/><br \/>The pandemic has given rise to several apprehensions and questions regarding the safety measures, testing and vaccinations that need to be addressed immediately. At CRY, we have been working on spreading awareness on pandemic preparedness and preventive measures as the only way to battle the second wave is to ensure communities stay informed and aware.<\/p>\n\n\n\n<p><strong>Awareness through Posters, Loudspeakers, Wall Paintings, Calendars and IEC Materials<\/strong><\/p>\n\n\n\n<ul><li>CRY team held awareness campaigns through communities utilizing innovative means like posters, loudspeakers, etc. IEC materials were distributed in villages including posters and calendars with information related to Covid-19.<\/li><li>We also spread awareness about the Covid–19 protocols through wall paintings and posters which have been displayed on walls and electronic media.<\/li><li>Children and adolescent groups have been playing a vital role in spreading the prevention message in the community. In Jharkhand, a WhatsApp group has been created among the children collectives to share the IEC materials in terms of cartoons, posters, videos etc. related to Covid prevention.<\/li><li>Online sessions were organized through WhatsApp with the children&#8217;s group, adolescents’ group and women&#8217;s group about the new variant of the COVID 19.<\/li><li>We also organized classes on the psycho-social wellbeing of children across the intervention areas.<\/li><\/ul>\n\n\n\n<p><strong>Awareness through Gram Vani<\/strong><\/p>\n\n\n\n<ul><li>The Gram Vani initiative in Odisha has reached 1000 households by generating awareness through running interviews of doctors and songs played on preventive measures of Covid &#8211; 19.<\/li><\/ul>\n\n\n\n<p><strong>Awareness Generation through Oath-Taking Programs<\/strong><\/p>\n\n\n\n<ul><li>The on-ground team at CRY organized oath-taking and awareness generation programs with adolescents in Odisha wherein they took an oath that they will work to ensure communities safety-nets and will provide all possible supports. Anganwadi workers and helpers were also present during these oath-taking ceremonies.<\/li><\/ul>\n\n\n\n<p><strong>Covid Preventive Awareness through Online Sessions<\/strong><\/p>\n\n\n\n<ul><li>We provided online sessions to Covid Support Groups on generating awareness and strategizing activities for community awareness. Members who participated include village support groups members (AWW,ASHA), doctors, psychiatrists from district hospitals and PHCs.<\/li><li>Our project partners in Karnataka also conducted an online session on the protection of children in the 3<sup>rd<\/sup> wave of the Covid pandemic.<\/li><li>CRY project team, DIKSHA (West Bengal), hosted an online community program, the theme of which was “Covid and I”. The event dealt with the situation of a child during the Covid pandemic, its challenges, and how he\/she has dealt with the situation. Children from Kalighat, Khidirpur and Munshiganj performed plays, dances, songs, paintings, and comics on this awareness program on Covid Prevention.<\/li><\/ul>\n\n\n\n<p><strong>Awareness through Religious Bodies<\/strong><\/p>\n\n\n\n<ul><li>The on-ground team also carried out the dissemination of information through mosques in Jammu and Kashmir to emphasize, in a religious way, regarding the necessity of prevention.<\/li><li>We alerted the communities on the various mythsrelated to Covid through temple and churches in Andhra Pradesh and Telangana.<\/li><li>Awareness campaigns were done through communities utilizing innovative means like posters, loudspeakers, etc. for the safe commemoration of Muharram.&nbsp;<\/li><\/ul>\n\n\n\n<p><strong>Stage Performances by Children<\/strong><\/p>\n\n\n\n<ul><li>Awareness were generated by children of Mandi Sahjana II and Rajpur villages in Rajasthan wherein they made paper caps and presented a performance (Drama) related to the prevention of COVID-19.<\/li><\/ul>\n\n\n\n<p><strong>Posters by Adolescent Groups<\/strong><\/p>\n\n\n\n<ul><li>Posters were created and displayed by adolescent groups in villages. COVID prevention information was given to people who participated. Awareness were generated through video shows and slogans.&nbsp;&nbsp;<\/li><li>Posters have been put up at public places including Panchayat and Anganwadi across project villages for Covid awareness on importance of Covid vaccine.<\/li><li>They are also collaborating with PRI members and CBO leaders in the villages.<\/li><\/ul>\n\n\n\n<p><strong>Awareness through Covid Hotspot Creation<\/strong><\/p>\n\n\n\n<ul><li>We also created COVID-19 prevention hotspot in South Delhi (Matrisudha intervention area) for community members with symptoms of Covid having immediate access to the Anganwadi centres.<\/li><\/ul>\n\n\n\n<p><strong>Awareness through Home Counselling Sessions<\/strong><\/p>\n\n\n\n<ul><li>Home visits were done by ASHA and AWW, our projects partners,in the villages and households. The community was sensitized on Covid Appropriate Behaviour, hand hygiene, how to wear mask properly and physical distancing to prevent onset of the third wave.&nbsp;More community members were sent to PHC for getting Covid test done.<\/li><li>The on-ground team also carried out home counselling for all the lactating and pregnant mothers in Odisha.<\/li><li>We created awareness among children, adolescent groups by drawing and playing games like Snakes and Ladders.<\/li><\/ul>\n\n\n\n<p><strong>Village Level Awareness Generation and Collaborative Efforts<\/strong><\/p>\n\n\n\n<ul><li>CRY held a village-level awareness generation program for pension-holding senior citizens in which they were provided knowledge regarding Covid prevention guidelines and myths related to the pandemic.(Odisha)<\/li><li>The folk artists\/cultural workers are facing severe economic challenges due to the pandemic as all the cultural programs have been stopped by the authority. Palli Alok Pathagar (Odisha), in collaboration with JuharParibar Bangalore, distributed dry ration kits to the local folk artists of Agalpur block of Balangir district.<\/li><li>We collaborated with the village sarpanch and opinion leaders for their support to ensure the spread of right messaging related to Covid Appropriate Behaviour across villages. (Maharashtra)<\/li><li>The on-ground team spread awareness about the third wave and Covid safety precautions were reiterated to the families &#8211; to properly wear a mask, to regularly sanitize\/wash their hands and maintain proper physical distance even if vaccinated.<\/li><li>Precautionary measures were undertaken with the help of the government stakeholders to protect the children from Covid third wave.<\/li><\/ul>\n\n\n\n<p><strong>Awareness Generation against Covid <\/strong><a href=\"https:\/\/www.cry.org\/help-protect-indias-underserved-communities\/\"><strong>Vaccine Hesitancy<\/strong><\/a><strong><\/strong><\/p>\n\n\n\n<p>It is undeniably critical that everyone gets access to both doses of vaccines to stay protected from a potential third wave. However, in a country like ours, plagued by illiteracy, poverty and lack of access to resources, it could create a digital divide and consequently, the underprivileged communities may be left out of the vaccination drive. This could be further compounded by&nbsp;the lack of awareness and superstition associated with vaccines and could threaten mass vaccination initiatives. Hence vaccine hesitancy is a big fight that we need to fight.&nbsp;That’s we worked on multiple mediums to help improve the situation, including:<\/p>\n\n\n\n<p><strong>Online Medium<\/strong><\/p>\n\n\n\n<ul><li>We conducted a webinar on the importance of vaccination and Covid prevention across the state of Karnataka.<\/li><li>Online sessions in the Marathi language was conducted to raise awareness among the community in Latur and Nanded district of Maharashtra.<\/li><li>We also conducted one-to-one counselling over the phone in Haryana with the community members who are hesitant to get vaccinated.<\/li><li>IVR programs have been running through Mobile Vaani in Odisha, wherein interview speeches from government hospitals are aired.<\/li><\/ul>\n\n\n\n<p><strong>Door-to-Door Visits<\/strong><\/p>\n\n\n\n<ul><li>The CRY team organized door-to-door campaigns to generate awareness for vaccination and dispel myths. As a result, pregnant women and lactating mothers were also made aware and received their dose of vaccine.<\/li><li>We carried out awareness generation and sensitization in the communities regarding the Covid-19 vaccines and build confidence among the community to come forward for the vaccines- through wall writings, small group meetings, and door-to-door visits in all the states.<\/li><li>CRY conducted awareness campaigns at the Gram Panchayat level with the ANM, Sahiya, PoshanSakhi, Sevika, teachers etc. We also encouraged the panchayat members and other village workers to get vaccinated to set examples for the community.<\/li><li>The on-ground team oriented the youth groups and children groups on the FAQs regarding vaccination who in turn visited door-to-door to motivate people to get vaccinated.<\/li><\/ul>\n\n\n\n<p><strong>Vaccination Camps<\/strong><\/p>\n\n\n\n<ul><li>The project partners organized vaccination camps at the Panchayat level where, along with providing vaccines, the team have also been spreading Covid awareness. The camps were held in collaboration with the district health departments.<\/li><\/ul>\n\n\n\n<p><strong>Scientific Demonstration<\/strong><\/p>\n\n\n\n<ul><li>Adolescent children were informed on scientific procedure of invention of vaccines and its physiology of effective prevention of particular disease by animated video clippings on YouTube. They made video clip for vaccine awareness.&nbsp;<\/li><\/ul>\n\n\n\n<p><strong>Audio visuals &amp; IEC materials<\/strong><strong><\/strong><\/p>\n\n\n\n<ul><li>Creative materials, audio\/video visuals were developed to encourage people to take vaccination. They are sharing the IEC materials with the people through meetings and WhatsApp.&nbsp;<\/li><\/ul>\n\n\n\n<p><strong>Vaccine MitraCampaign&nbsp;&nbsp;&nbsp;<\/strong><\/p>\n\n\n\n<ul><li>Vaccine Mitra Campaign has enabled the partners generate awareness against Covid vaccine hesitancy through Posters, IEC materials and pamphlets.<\/li><li>The organizations took up the campaign with communities, district and block level administration to reach the grass root level.<\/li><li>Video clips were created by the Government stakeholders in order to provide message to the community regarding vaccination.<\/li><\/ul>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img src=\"https:\/\/www.cry.org\/wp-content\/uploads\/image-2.png\" alt=\"\" class=\"wp-image-8078\" width=\"838\" height=\"458\"\/><\/figure>\n\n\n\n<p><strong>Creating Help Desk<\/strong><\/p>\n\n\n\n<ul><li>We created Help Desks at various points in the community to share knowledge about vaccination and ensure vaccination within the community.<\/li><li>CRY’s project partner, JKASW in Jammu &amp; Kashmir, created help desks in Asha Kiran Centres for disseminating information related to vaccination.<\/li><\/ul>\n\n\n\n<p><strong>Covid Help Booth&nbsp;&nbsp;&nbsp; <\/strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/p>\n\n\n\n<ul><li>CRY’s partners in the intervention areas created Covid Help Booths to guide the villagers on the vaccination process.<\/li><li>We also helped the community members get registered on the COWIN App.<\/li><\/ul>\n\n\n\n<p><strong>Covid Support Groups<\/strong><\/p>\n\n\n\n<ul><li>Community vaccination drives were initiated by the Covid Support Groups to improve the confidence among the people on administering the vaccines to fight against Covid and increase the number of vaccinations among the rural community.<\/li><li>CRY teams conducted meetings with children and adolescent collectives as they have been an integral part of the whole campaign against Covid and have encouraged their families to go for vaccination.<\/li><li>Swati team along with the people of Tigri community in Delhi conducted an awareness campaign regarding vaccination. People were made aware through posters, slogans and paintings. It was observed that the people of Tigri community realized how the dangerous effects of Covid 19 and that vaccination is the only way to themselves. The community is now getting more and more vaccinated. Adolescent groups and youth groups are helping people in the community to register or refer people to vaccine centres. The Swati team is helping the community to identify the vaccine centre and sending people for vaccination.<\/li><\/ul>\n\n\n\n<p><strong>Mobile Van<\/strong><\/p>\n\n\n\n<ul><li>Mobile Van has been established in collaboration with Gaon Kalyan Samitee\/NHM&nbsp; and it is&nbsp; running in 19 villages of Bargarah district (Odisha). The purpose is tracking vaccination updates, doing small group discussions, doing joint meetings with CHC\/PHC and organizing vaccination drives too in three Gram Panchayat of project areas.<\/li><li>Partners across UP are also&nbsp;participating in mobile van vaccination drive&nbsp; with the support of Health officers.<\/li><\/ul>\n\n\n\n<p><strong>Religious Bodie<\/strong><strong>s<\/strong><\/p>\n\n\n\n<ul><li>The partners made references with the community members of religious and notable figures who attested to the veracity of the efficacy of Covid vaccination.<\/li><li>Awareness took place through Imam Baras and Masjids in Jammu and Kashmir to motivate the community to undergo vaccination.<\/li><li>Mr. Zameer Ali, 35, is the sole bread earner of his family belonging to the Shia community in Pattan district in J&amp;K. Before Muharram he was not vaccinated which made him vulnerable to Covid 19. However, before the start of Muharram, vaccination awareness was carried out at Imam Bara and he was motivated by the program implementing team to undergo vaccination. Consequently, he along with his wife and mother were vaccinated before Muharram.&nbsp; His ailing mother was thus vaccinated against any vulnerability arising from Covid 19.<\/li><\/ul>\n\n\n\n<p><strong>Highlights of Persistent Efforts in Minimising Covid Vaccine Hesitancy<\/strong><\/p>\n\n\n\n<ul><li>Jhengnadihi village under Bhengrajpur Panchayat is 12 km from Paikmal block and 105 km from district headquarter Bargarh district in Odisha. Most of the marginal community resides there and rely on agriculture and daily wages. The vaccination turn up percentage was completely nil due to fear and stigma regarding Covid-19.&nbsp;<br \/><br \/>CRY project workers intervened in the situation and carried out several home visits along with ANM, AWW, ASHA and convinced people for vaccination. They also organized village meetings in Jhengnadihi and explained details against the stigma and myths related to the Covid-19 vaccination to the community with the help of various IECs.<br \/><br \/>Currently more than 75% people are vaccinated (out of total vaccination age groups) in this village and remaining 25% will be vaccinated in the next few days.<\/li><\/ul>\n\n\n\n<ul><li>The adolescent groups from TamodarRanda in Latur district took a path-breaking initiative to undergo vaccination awareness and curb the myths surrounding it within their community. They conducted one-to-one interviews with parents and neighbors to understand the reasons for apprehension for not administering vaccination. Once they understood the issue, they started visiting the households of those who have taken the vaccination, these people along with the girls interacted with other community members and raised awareness for vaccination. They made them understand that the vaccination will increase their resistance and develop immunity in the body against Covid. Slowly but steadily, these girls met more and more adults in the community and their persistent efforts in driving for vaccination led to their village being highlighted as the most vaccinated village in their area.<\/li><\/ul>\n\n\n\n<p><strong>Breaking the Covid Vaccination Myth<\/strong><strong><\/strong><\/p>\n\n\n\n<ul><li>Zoona Begum, 56, resides in Gund Ibrahim, Pattan with her four children and husband. One of her neighbors, belonging in the same age group, had contracted Coronavirus this year and faced severe health complications that were nearly fatal. Sensing the gravity of the situation and the threat imposed by the pandemic, she wanted her family to be vaccinated but could not afford the costs of paid vaccination -her husband being a daily wage laborer. The vaccination campaign started through the advocacy of JKASW in Pattanthat benefitted many underprivileged families, including Zoonaand her family. She was vaccinated in the first week of July after being counselled by the program implementation team of JKASW. Today, she and her family are vaccinated with less vulnerability for Covid-19.<br \/><br \/><\/li><li>Mrs.Endrapati Sowmya, aged 26, is a resident of Chinnapuram, blessed with two children. Her husband is an agricultural labour who believed in the myths surrounding Covid vaccine. He didn’t get vaccinated and was not allowing his wife to get vaccinated, even though Sowmya was interested in taking the vaccine. He even threatened his wife not to vaccinate due to fear and gossips that he heard. This matter was brought to the notice of the ICDS teacher who then visited Sowmya’s house. She counselled her husband and motivated both of them to take vaccines and busted the myths surrounding it. Finally she was able to convince them and both the husband and wife&nbsp; got vaccinated during the Covid mega vaccination drive in CRASA intervention area (Andhra Pradesh).<\/li><\/ul>\n\n\n\n<p><strong>Looking into Psycho-Social Well-Being Post Covid<\/strong><\/p>\n\n\n\n<ul><li>A 15 week life skill module has been introduced for the&nbsp; psychosocial well-being for children\/adolescents in the intervention across all states in East to ensure overall mental well-being of children and to cope up with the new normal post covid situation.<\/li><li>#Porashunodarabeyna \/ # shikshyaNahiRukegi &#8211; An online education to deprived children of the slums of the Kolkata in collaboration with CRY, Kolkata Police and Airtel was launched. Children were provided Tabs that will benefit them in continuing with their education.<\/li><\/ul>\n\n\n\n<p><strong>Impact of Covid Vaccination Awareness<\/strong><\/p>\n\n\n\n<ul><li>1,17,401people vaccinated till August (1st Dose).<\/li><li>52,141 people vaccinated till August (2nd Dose).<\/li><li>72,348 families covered through vaccination till date (at least one member having at least one dose of vaccine).<\/li><\/ul>\n\n\n\n<p><strong>Engagement with the Government Stakeholders<\/strong><\/p>\n\n\n\n<p>CRY has been working to ensure children and their families are safe by engaging with key stakeholders in the government, acting as a mediator to address immediate needs of the underserved.<\/p>\n\n\n\n<ul><li>CRY identified BPL families in Odisha who needed support with ration due to the Covid situation and linked them with the government department and other sources.<\/li><li>We submitted data to the WCD department of all the identified families who have lost their family members due to Covid. These children were linked with the CM Covid Relief scheme available in the respective states.<\/li><li>The on-ground team is carrying out community sanitization with the support of the Panchayath Raj department in Andhra Pradesh and Telangana.<\/li><li>The CRY team used the VHND platform to build capacities of capacity of ASHAs, AWWs, PRI, CBOs and Teachers on COVID-19 Protocol Compliances and raise awareness about Covid-19 vaccinations.<\/li><li>We distributed oxygen cylinders and concentrators in various district hospitals with the help of CRY collaborative efforts.<\/li><li>CRY’s project partner, Koshish, being a part of NGO-Govt. coordination group, has made referrals to mitigate the need for oxygen cylinders and concentrators in Budgam District (J&amp;K).<\/li><li>We have submitted data to the WCD department of all identified families who have lost their family members due to Covid. These children shall be linked with the CM Covid Relief scheme in Madhya Pradesh and Maharashtra.<\/li><li>The on-ground team carried out mass scale Covid testing with the help of local government representatives, village child protection committee and village authority in Bhubaneswar and Manipur.<\/li><li>We are conducting home visits throughout all the intervention states for awareness and providing handhold support to the government department for vaccination.<\/li><li>Living guard masks were procured and distributed among front line workers, police staff and DCPU in others in the districts of Chhattisgarh, Maharashtra and Gujarat.<\/li><\/ul>\n\n\n\n<p><strong>An Appeal For Help<\/strong><\/p>\n\n\n\n<p>It’s going to be a long road ahead as the recovery and rehabilitation of underserved people requires collective efforts. Your donation can help us fight this battle against the outbreak to ensure this doesn’t become a child rights crisis. Contribute to the larger solution that could give underprivileged children a brighter future. Join the movement and donate to CRY, the&nbsp;<a href=\"https:\/\/www.cry.org\" target=\"_blank\" rel=\"noreferrer noopener\">best NGO in India<\/a>&nbsp;today.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The second wave of the pandemic has left many underserved communities vulnerable, especially underprivileged children. To help them in these unprecedented and overwhelming times, we, at CRY, have jumped into action. We are working hard to ensure that children and their families are safe and proactive in fighting the spread of coronavirus with awareness, preventive [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[17,2],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/7742"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=7742"}],"version-history":[{"count":10,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/7742\/revisions"}],"predecessor-version":[{"id":11230,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/7742\/revisions\/11230"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=7742"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=7742"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=7742"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}