{"id":7922,"date":"2021-09-08T16:58:52","date_gmt":"2021-09-08T11:28:52","guid":{"rendered":"https:\/\/www.cry.org\/?p=7922"},"modified":"2022-07-18T11:16:51","modified_gmt":"2022-07-18T05:46:51","slug":"this-international-literacy-day-ensure-children-have-access-to-education","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/this-international-literacy-day-ensure-children-have-access-to-education\/","title":{"rendered":"This International Literacy Day, Ensure Children Have Access To Education"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"799\" height=\"533\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/35034829836_749861be85_c1.jpg\" alt=\"International Literacy Day\" class=\"wp-image-7923\"\/><\/figure>\n\n\n\n<p>8th September is commemorated as the International Literacy Day to raise awareness on the importance of literacy, especially as a human right. Education is an integral part of life, particularly for children during those impressionable years. In context to the current situation, where there has been a closure of 1.5 million schools due to the pandemic, this day is all the more integral for people in India. The lockdown has resulted in 247 million children, who were enrolled in elementary and secondary schools in India, face disruption of education in the last 18 months, according to UNICEF.<\/p>\n\n\n\n<p>Due to the pandemic,&nbsp;<a href=\"https:\/\/www.cry.org\/blog\/non-profit-organization-that-helps-in-educating-underprivileged-children-in-india\/\">children’s education in India<\/a>&nbsp;is getting affected. This gap has also put them at risk of discontinuing their education, and other issues like lack of structured learning, susceptibility to economic exploitation, sexual abuse, physical violence, trafficking, and early marriage.<\/p>\n\n\n\n<p>We, at CRY, are working tirelessly to protect children and ensure they are ready to go back to school once they reopen. We are focusing on addressing the long academic gap with bridge schools as many children are losing touch with their school subjects. We are also ensuring that the number of school dropouts does not increase by providing bridge classes for children from VI to XII grade who are more likely to drop out of the school system; also ensuring teachers have access to digital aids.<\/p>\n\n\n\n<p>The CRY team is also providing psychosocial support to children as there are several issues that may affect them in more ways than one, given the restricted movement during the lockdown. We are focusing on protecting children from facing issues of stress, violence, abuse, and neglect to help safeguard their mental health. The confidence and thinking abilities of children must continue to grow. This is why we are focusing on building knowledge and expanding their minds with exposure to relevant and useful skills, and content through a digital platform.<\/p>\n\n\n\n<p>We are also promoting well-being and confidence among children by focussing on their personal development that has been neglected during the pandemic. This is the time to intervene and help children get back to a proper schedule so that they can continue their education and explore their true potential.<\/p>\n\n\n\n<p>To make a real difference this International Literacy Day, support CRY’s work to protect children’s future in these unpredictable and overwhelming times. Your contribution can help us improve the lives of more underprivileged children and ensure they continue their education during the pandemic.&nbsp;<a href=\"https:\/\/www.cry.org\/education-for-children\/\">Donate for children’s education<\/a>!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>8th September is commemorated as the International Literacy Day to raise awareness on the importance of literacy, especially as a human right. Education is an integral part of life, particularly for children during those impressionable years. In context to the current situation, where there has been a closure of 1.5 million schools due to the [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/7922"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=7922"}],"version-history":[{"count":1,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/7922\/revisions"}],"predecessor-version":[{"id":7924,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/7922\/revisions\/7924"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=7922"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=7922"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=7922"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}