{"id":7990,"date":"2021-09-24T10:11:22","date_gmt":"2021-09-24T04:41:22","guid":{"rendered":"https:\/\/www.cry.org\/?p=7990"},"modified":"2022-07-18T11:16:31","modified_gmt":"2022-07-18T05:46:31","slug":"help-cry-address-covid-19-vaccine-hesitancy-and-ensure-vaccination-for-the-underserved-communities","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/help-cry-address-covid-19-vaccine-hesitancy-and-ensure-vaccination-for-the-underserved-communities\/","title":{"rendered":"Help CRY address COVID-19 vaccine hesitancy and ensure vaccination for the underserved communities"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"799\" height=\"533\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/35070295365_4d173924b4_c.jpg\" alt=\"\" class=\"wp-image-7991\"\/><\/figure>\n\n\n\n<p>The coronavirus pandemic has impacted everyone in some or another way especially the marginalised sections of society. While the second wave caused huge destruction, overcoming COVID-19 vaccine hesitancy and ensuring vaccination is the only way to keep the anticipated third wave at bay. Among everyone, the underserved communities are the ones who bear the brunt of accessibility barriers. One of the major reasons for the slower uptake of vaccines in these communities is vaccine hesitancy. Lack of awareness around the vaccines, the digital divide, and the myths about the vaccine, are making them more susceptible and vulnerable to the virus.<strong>&nbsp;<\/strong><\/p>\n\n\n\n<p>When we talk about the vulnerabilities of the underserved communities, keeping children safe from the virus should be our priority and this is possible when everyone is fully vaccinated. CRY has taken a step ahead to address the issue of vaccine hesitancy among the communities and ensure vaccination for them. The major focus areas our team is working on are &#8211;&nbsp;<\/p>\n\n\n\n<p><strong>Overcoming vaccine hesitancy<\/strong><br \/>While the government&#8217;s vaccination programme relies on a digital gateway for vaccination, owing to the existing digital divide, adoption has been poor among underserved communities. Lack of education, as well as gender disparity, have resulted in low vaccination uptake in these marginalised areas, according to CRY&#8217;s on-the-ground experience. This step includes a combination of public-led activities from busting myths around vaccines among the communities to ensuring the availability of vaccines for everyone. We also make sure to promote inclusivity through local door-to-door vaccine registrations on the CoWIN platform and its uptake at the local public healthcare centres.<\/p>\n\n\n\n<p><strong>Vaccine awareness drive<\/strong><br \/>To make sure the message reaches the masses, we work with ASHA workers to create awareness and the advantages of taking vaccines along with other information like CAB (COVID appropriate behaviour).<\/p>\n\n\n\n<p><strong>Transportation and tracking of fully vaccinated individuals<\/strong><br \/>One of the major reasons for the lesser uptake of COVID-19 vaccines is the lack of availability of vaccination centres in the proximity. To address this issue, CRY ensures transportation and household visits to check on the post-vaccination status of the individuals.&nbsp;<\/p>\n\n\n\n<p>CRY is committed to the safety of children and providing support to their families. Right now our main focus is to ensure the safety of underserved communities against the anticipated third wave so that children are safe because no one is safe until everyone is safe.&nbsp;While India is setting a benchmark in the fight against COVID-19, with more than 188 million* citizens vaccinated under the largest vaccination drive but our struggle is not over yet. Your support can help us multiply our efforts to address <strong>COVID-19 <\/strong><a href=\"https:\/\/www.cry.org\/help-protect-indias-underserved-communities\/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>vaccine hesitancy<\/strong><\/a> and <a href=\"https:\/\/www.cry.org\/ensure-vaccination-of-underserved-communities-nhvd\/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>ensure vaccination<\/strong><\/a> for India’s most vulnerable.&nbsp;<\/p>\n\n\n\n<p>(Source: *Govt of India, Sep17, 2021 update)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The coronavirus pandemic has impacted everyone in some or another way especially the marginalised sections of society. While the second wave caused huge destruction, overcoming COVID-19 vaccine hesitancy and ensuring vaccination is the only way to keep the anticipated third wave at bay. Among everyone, the underserved communities are the ones who bear the brunt [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[17,11],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/7990"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=7990"}],"version-history":[{"count":2,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/7990\/revisions"}],"predecessor-version":[{"id":11077,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/7990\/revisions\/11077"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=7990"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=7990"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=7990"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}