{"id":8570,"date":"2021-12-27T10:30:09","date_gmt":"2021-12-27T05:00:09","guid":{"rendered":"https:\/\/www.cry.org\/?p=8570"},"modified":"2022-07-18T11:15:15","modified_gmt":"2022-07-18T05:45:15","slug":"this-new-years-protect-girls-from-being-forced-into-child-marriage","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/this-new-years-protect-girls-from-being-forced-into-child-marriage\/","title":{"rendered":"This New Year&#8217;s, Protect Girls From Being Forced Into Child Marriage"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img src=\"https:\/\/www.cry.org\/wp-content\/uploads\/protect-girls-from-being-forced-into-child-marriage.jpg\" alt=\"Protect Girls from Being Forced into Child Marriage\" class=\"wp-image-8573\"\/><\/figure>\n\n\n\n<p>31st December is an occasion that is celebrated with much excitement. After all, it is the eve of New Year’s – the end of a wholesome year and the beginning of a promising new year. A new year brings along many aspirations for a more positive and productive time ahead. Unfortunately, such is not the case for young girls in India. According to Census 2011, India has over 12 million married children, out of which 70% are girls. <a href=\"https:\/\/www.cry.org\/blog\/beating-child-marriage-in-covid-times\/\">Child marriage in India<\/a> has been prevalent for many centuries. It is a deep-rooted issue that is still practiced in several communities in rural as well as urban belts. Children engaged in child marriage are deprived of their basic rights, including health and nutrition, regular education, and freedom from violence and exploitation. It is a blatant violation of their rights which is why immediate intervention is a must.<\/p>\n\n\n\n<p>Even though this social evil is a crime, it has been relentlessly thriving for many generations. The issues of child marriage and early motherhood hold back many underprivileged girls from realizing their dreams. It’s a long-lasting and unimaginable loss of not only their childhood but also future opportunities. The effects of child marriage include irreversible effects on their health, education, and life opportunities. Many children also face violence and poverty traps which severely impairs their overall development. This is a phenomenon that has chronic intergenerational effects that make not only the direct victims vulnerable but also the future generations.<\/p>\n\n\n\n<p>We, at CRY, have been working hard to contribute towards a sustainable solution to help India’s daughters. The endeavor has been to work with the community, the leaders as well as respective families, to eliminate the practice at the village level while also ensuring that girls attend school instead of becoming child brides and shouldering early motherhood.<\/p>\n\n\n\n<p>This New Year’s, celebrate along with underprivileged children and gift them a brighter and safer future. <a href=\"https:\/\/www.cry.org\/donation\/\">Donate<\/a> to CRY, the top NGO in India to help protect underprivileged girls from child marriage. Your smallest contribution will make a big difference to the lives of children who are waiting to expand their potential and prosper in the world. You can also avail of a tax deduction under Section <a href=\"https:\/\/www.cry.org\/blog\/donate-and-avail-deduction-under-section-80g-of-income-tax-act\/\">80G of the Income Tax<\/a> Act. Donate to CRY now!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>31st December is an occasion that is celebrated with much excitement. After all, it is the eve of New Year’s – the end of a wholesome year and the beginning of a promising new year. A new year brings along many aspirations for a more positive and productive time ahead. Unfortunately, such is not the [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/8570"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=8570"}],"version-history":[{"count":4,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/8570\/revisions"}],"predecessor-version":[{"id":8605,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/8570\/revisions\/8605"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=8570"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=8570"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=8570"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}