{"id":8597,"date":"2021-12-31T09:11:54","date_gmt":"2021-12-31T03:41:54","guid":{"rendered":"https:\/\/www.cry.org\/?p=8597"},"modified":"2022-07-18T11:15:03","modified_gmt":"2022-07-18T05:45:03","slug":"heres-how-your-support-helped-girls-from-taratala-win-state-level-kickboxing-championship","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/heres-how-your-support-helped-girls-from-taratala-win-state-level-kickboxing-championship\/","title":{"rendered":"Here’s How Your Support Helped Girls from Taratala Win State-Level Kickboxing Championship!"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img src=\"https:\/\/www.cry.org\/wp-content\/uploads\/girls-win-state-level-kickboxing-championship.jpg\" alt=\"\" class=\"wp-image-8599\"\/><\/figure>\n\n\n\n<p>With immense joy and pride, we are super thrilled to share this story about our amazing girls from Taratala, Kolkata who are reaching new heights by winning accolades at the state-level kickboxing and karate tournaments. 11-year-old Rupali with other girls Laxmi and Puja won gold and silver medals at the West Bengal state kickboxing championship held at Jalpaiguri and are now all set to represent the state at the National level championship.&nbsp;<\/p>\n\n\n\n<p>About a year ago a lot of girls at Taratala were forced to discontinue their education due to the ongoing pandemic and lost parental support for education. They ended up doing household chores or other labour. Many girls faced confidence issues and were scared to step out of home alone. Through CRY’s intervention in January 2021,&nbsp;under the <a href=\"https:\/\/www.cry.org\/blog\/importance-of-girl-child-education-in-india\/\" target=\"_blank\" rel=\"noreferrer noopener\">Girl Child Education<\/a> project,&nbsp;a total of 50 girls along with Rupali took up self-defence classes. Here they were taking karate and kick-boxing lessons. These self-defence training sessions are a part of a larger program to support girls education and empower them with wholesome personality development through extra-curricular activities like music and sports. For these girls, the journey of winning gold and silver medals was a difficult one as they come from an underprivileged community in Taratala district, born to parents who are daily wage workers and live in make-shift homes.<\/p>\n\n\n\n<p>11-year-old Rupali was the youngest among the 50 girls who took training for the self-defence classes. Despite her petite frame, she was able to give a powerful punch to the competitor who was twice her tiny frame. During the training, she would stand at the back and watch others train and admire the ability to punch the opponent in this sport. Another girl Puja, who also won a gold medal at the tournament joined the training to have fun with her sister Laxmi, but the training soon became serious and gave them both the determination to win.<\/p>\n\n\n\n<p>A total of 13 girls from the group took part in the state-level championship. They had a lot of amazing experiences along with their first train ride to Jalpaigudi where they stayed at the Woodridge International School, which hosted the competition. “We were very excited for our first train journey”, says Puja who won a gold medal at the tournament and can’t wait to share the stories with her friends. Rupali and Laxmi, after winning are now preparing for the national levels and putting in four hours of training on Sunday mornings and two hours on weekdays. Laxmi is now a black belt in karate and enjoys a ring fight, while Rupali now dreams of becoming a professional boxer.<\/p>\n\n\n\n<p>We are hopeful that extra-curricular activities apart from studies will help more girls overcome their latent fears, contribute to the process of holistic learning and empower them to face any challenge that lies in their way.&nbsp;<\/p>\n\n\n\n<p>While our team at CRY work tirelessly to ensure brighter futures for our girls, your continuous support can help us reach more girls who have the potential to achieve big in life. Make a <a href=\"https:\/\/www.cry.org\/donation\/\" target=\"_blank\" rel=\"noreferrer noopener\">donation<\/a> to CRY today to help India’s daughter shine and save tax.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With immense joy and pride, we are super thrilled to share this story about our amazing girls from Taratala, Kolkata who are reaching new heights by winning accolades at the state-level kickboxing and karate tournaments. 11-year-old Rupali with other girls Laxmi and Puja won gold and silver medals at the West Bengal state kickboxing championship [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[12],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/8597"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=8597"}],"version-history":[{"count":3,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/8597\/revisions"}],"predecessor-version":[{"id":9151,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/8597\/revisions\/9151"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=8597"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=8597"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=8597"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}