{"id":884,"date":"2020-08-12T09:41:31","date_gmt":"2020-08-12T09:41:31","guid":{"rendered":"http:\/\/cry.local\/?p=759"},"modified":"2022-07-18T12:51:40","modified_gmt":"2022-07-18T07:21:40","slug":"cry-is-recognized-as-one-of-the-100-sparksofhope-by-the-elders","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/cry-is-recognized-as-one-of-the-100-sparksofhope-by-the-elders\/","title":{"rendered":"CRY is recognized as one of the 100 #SparksOfHope by The Elders"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img src=\"\/wp-content\/uploads\/2020\/08\/cover-elders.jpg\" alt=\"Sparks Of Hope\" class=\"wp-image-760\"\/><\/figure>\n\n\n\n<p>It is said that hope makes the world go round – and it often takes a spark to ignite lasting change. Child Rights and You (CRY) has been endeavouring to be that spark, to be that hope, for millions of underprivileged children in India. Our dedication towards taking children out of child labour and placing them back in school has received global recognition by one of the most respected and esteemed organizations in the world – The Elders.<\/p>\n\n\n\n<p>Founded in 2007 by Nelson Mandela, The Elders is an autonomous group of global leaders dedicated to promoting human rights, justice and peace across the world. To commemorate the tenth year of their founding, The Elders initiated the 100 #SparksOfHope campaign – a movement to identify the top hundred NGOs from across the world dedicated to equality, justice, health and peace – principles that Nelson Mandela stood firmly by all his life.<\/p>\n\n\n\n<p>CRY was selected as one of these 100 #SparksofHope for working day in and day out for the rights of India’s children. Our work towards helping child labourers to go back to school so they can have a brighter future was particularly noted by The Elders, in addition to its work in the fields of child education, protection, nutrition and healthcare.<\/p>\n\n\n\n<p>“Being engaged in work leaves these children with no time to study, play or explore other opportunities to realise their potential. When a child goes to school, he\/she has the opportunity and the premise to break away from the cycle of poverty. A child engaged in labour is the very death of that possibility. Every single child in school is one less child labourer in the making. Every child labourer thus rescued, is an opportunity waiting to blossom,” says Puja Marwaha (CEO, CRY).<\/p>\n\n\n\n<p>As The Elders noted, in a country as large and diverse as India, protecting child rights and constantly working to eliminate discrimination based on class, caste, gender, religion, and ethnicity can be a mammoth task. However, our rights-based approach acts as a bridge between supporters of child rights from the world over and grassroots workers. By providing smaller NGOs with the funding and skills they need, the impact created is far reaching.<\/p>\n\n\n\n<p>We&#8217;re honoured to be one of the 100 #SparksOfHope in this world and with the support of our donors and partners, hope to continue working towards bringing happier childhoods to India’s children.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It is said that hope makes the world go round – and it often takes a spark to ignite lasting change. Child Rights and You (CRY) has been endeavouring to be that spark, to be that hope, for millions of underprivileged children in India. Our dedication towards taking children out of child labour and placing [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[13],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/884"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=884"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/884\/revisions"}],"predecessor-version":[{"id":3013,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/884\/revisions\/3013"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=884"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=884"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=884"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}