{"id":885,"date":"2020-08-12T09:44:23","date_gmt":"2020-08-12T09:44:23","guid":{"rendered":"http:\/\/cry.local\/?p=762"},"modified":"2022-07-18T12:51:30","modified_gmt":"2022-07-18T07:21:30","slug":"puja-marwaha-ceo-cry-awarded-the-olga-alexeeva-memorial-prize-2018","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/puja-marwaha-ceo-cry-awarded-the-olga-alexeeva-memorial-prize-2018\/","title":{"rendered":"Puja Marwaha, CEO &#8211; CRY, awarded the Olga Alexeeva Memorial Prize 2018"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img src=\"\/wp-content\/uploads\/2020\/08\/olga.jpg\" alt=\"CRY CEO Puja Marwaha\" class=\"wp-image-763\"\/><\/figure>\n\n\n\n<p>The Fifth Olga Alexeeva Memorial Prize 2018 was awarded to Puja Marwaha for leading CRY’s efforts on mobilizing collective action and encouraging community philanthropy.<\/p>\n\n\n\n<p>The prize seeks to recognize remarkable leadership, creativity and results in developing philanthropy for progressive social change in an emerging market country. It was presented to Puja at the ‘Investing in Philanthropy Development‘ WINGS International Meeting held in March 2018 in Barcelona, Spain. The judges reviewed the finalists, taking into account their achievements, the work of their institutions and the context in which they operate.<\/p>\n\n\n\n<p>“Puja Marwaha illustrates some of the key elements critical for moving philanthropy. A driven leader who sets the tone and gives confidence that it is possible to mobilize resources. Her local fundraising efforts not only bring resources to her work but also bring credibility to the local organizations working on the same issues with the added benefit of using indigenous resources&#8221;, remarked the judges. &#8220;At the same time, her institution (CRY), which she has worked with for many years, has created a solid ground for the necessary structures to grow and be nurtured. CRY has been a leader in India in building the philanthropic field. They have been probably the first and the most successful to build all their work with Indian philanthropy, even when the majority of civil society organizations working in the rights and justice space were dependent on foreign funds. Importantly, they have been extremely comprehensive in their approach by looking at individual donors, corporate philanthropy and regular middle class givers. Over the years, they have also supported some very difficult work, tackling root causes of social injustice and inequity.”<\/p>\n\n\n\n<p>The Olga Alexeeva Memorial Prize is supported by the Charities Aid Foundation, Charles Stewart Mott Foundation, Philanthropy for Social Justice and Peace and the Vladimir Potanin Foundation.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Fifth Olga Alexeeva Memorial Prize 2018 was awarded to Puja Marwaha for leading CRY’s efforts on mobilizing collective action and encouraging community philanthropy. The prize seeks to recognize remarkable leadership, creativity and results in developing philanthropy for progressive social change in an emerging market country. It was presented to Puja at the ‘Investing in [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[13],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/885"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=885"}],"version-history":[{"count":7,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/885\/revisions"}],"predecessor-version":[{"id":3014,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/885\/revisions\/3014"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=885"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=885"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=885"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}