{"id":955,"date":"2020-08-19T05:54:31","date_gmt":"2020-08-19T05:54:31","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=955"},"modified":"2022-07-18T12:43:53","modified_gmt":"2022-07-18T07:13:53","slug":"jaideep-hardikar-the-ncrrf-fellow-who-studied-the-impact-of-agrarian-distress-on-children","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/jaideep-hardikar-the-ncrrf-fellow-who-studied-the-impact-of-agrarian-distress-on-children\/","title":{"rendered":"Jaideep Hardikar &#8211; The NCRRF Fellow who studied the impact of agrarian distress on children"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"566\" src=\"\/wp-content\/uploads\/2020\/08\/fellow-1.jpg\" alt=\"Story of Jaideep Hardikar\" class=\"wp-image-818\"\/><\/figure>\n\n\n\n<p>A journalist who originally hailed from a small town called Chandrapur in Maharashtra, Jaideep was drawn to the issue of displaced migrants at an early age &#8211; when he saw people migrating by the hordes to Nagpur after being displaced by the construction of a dam close to the town.<\/p>\n\n\n\n<p>The migrant population, who used to gather every year in front of Vidhan Bhavan protesting for their rights, caught his attention and he felt a calling to understand their lives. He decided to become a journalist to write about the issues he felt strongly about and started by joining Lokmat Times, an English Daily from the Lokmat Group in 1996. In 2000, Jaideep received a Fellowship from the K.K Birla Foundation which enabled him to travel around the country and investigate the issues of people displaced by development projects. He looked at several types of development projects &#8211; dams, thermal power plants etc., seeking to answer the simple question &#8211; what happens to people who are displaced by these ambitious projects? Post the Narmada Bachao Andolan, the issue of development-induced displacement had gained limelight and his work was very relevant at that time. When the Integrated Road Development Project in Nagpur was being implemented, Jaideep traveled back with the migrant labor from Odisha, Chhattisgarh, MP, and Andhra to their villages to understand their situation back home and what led them to seek employment in cities. Most of the laborers came from marginal agricultural backgrounds, and he realized that the agriculture they undertook back home was unremunerative &#8211; forcing people out of the villages.<\/p>\n\n\n\n<p>It was during this time that the cotton crisis was building in India, led by the farmer suicides in Vidarbha. At that time, he was keenly following Dr. P. Sainath’s work, the veteran development sector journalist, with whom he has been associated for the last 20 years. It was during this time that he learned to look at the processes and not just the outcomes. While investigating an issue, he always explored drivers &#8211; social, political, and economic. In 2009, he was selected to be an Alfred Friendly Press Fellow, which led him to deep-dive into the subsidies offered by the West to their farmers and he realized that India had a long way to go. He then began to look at agrarian issues\/transformations and its economics more structurally.<\/p>\n\n\n\n<p>The NCRRF Fellowship was an opportune project at that time since he was able to explore the impact of agrarian distresses on children and how they are shaped by it. The Fellowship taught him the academic methods to thoroughly research an issue and put him in touch with child rights researchers who helped him understand the debates\/discourses around children’s issues. The NCRRF Fellowship also led him to connect with children whose lives he has tracked for more than 15 years. In particular, a young boy who lost his farmer father to debt-led suicide when he was 13 and was pitchforked as an adult to take care of the family. Jaideep was deeply touched when the boy told him that he liked to work on the field since it made him feel closer to his deceased father.<\/p>\n\n\n\n<p>Jaideep says that the biggest challenge he faced in his professional life was to get media space, especially in print media, to throw light on these issues. This challenge remains even today but the People’s Archive of Rural India (PARI) founded by Dr. Sainath is one of the notable responses to this challenge. Today, Jaideep is a core member of PARI who also writes for several publications. He is also a Fellow at the Mumbai School of Economics and Public Policy, working on a social action research project on Water Commons. He has penned his experiences from his 2001 travels into a book published by Penguin India in 2013 titled “A Village Awaits Doomsday”, and his second book on farmer suicides is expected to be published later this year.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A journalist who originally hailed from a small town called Chandrapur in Maharashtra, Jaideep was drawn to the issue of displaced migrants at an early age &#8211; when he saw people migrating by the hordes to Nagpur after being displaced by the construction of a dam close to the town. The migrant population, who used [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[13],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/955"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=955"}],"version-history":[{"count":6,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/955\/revisions"}],"predecessor-version":[{"id":11090,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/955\/revisions\/11090"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=955"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=955"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=955"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}