{"id":957,"date":"2020-08-19T05:56:34","date_gmt":"2020-08-19T05:56:34","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=957"},"modified":"2022-07-18T13:05:37","modified_gmt":"2022-07-18T07:35:37","slug":"ponnambily-jobin-the-ncrrf-fellow-who-studied-dowry-harassment-and-child-abuse","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/ponnambily-jobin-the-ncrrf-fellow-who-studied-dowry-harassment-and-child-abuse\/","title":{"rendered":"Ponnambily Jobin &#8211; The NCRRF Fellow who studied dowry harassment and child abuse"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"566\" src=\"\/wp-content\/uploads\/2020\/08\/fellow-2.jpg\" alt=\"Story of Ponnambily Jobin\" class=\"wp-image-819\"\/><\/figure>\n\n\n\n<p>“When I was 10 years old, I learned that one of my friends was a victim of child sexual abuse,” says Ponnambily Jobin, who hails from Kottayam, Kerala. “When my friend described the incident to me, I felt very strongly affected, as if it was happening to me,” she recalls.<\/p>\n\n\n\n<p>Her friend discontinued her schooling as a result of her experience but she and her trauma stayed with Ponnambily, who decided that she would fight against it. At that time, she hadn’t figured out how to go about it, and post-schooling, she enrolled for a Bachelors in Nursing. During her graduation days and in her subsequent work, she witnessed enough instances and stories narrated by her peers to realize that dowry harassment and sexual abuse were two very oft-committed atrocities faced by women and she decided to work against them. At that time, she realized that a good educational degree from an institution of repute would help her in her professional goals. She, therefore, applied for a post-graduation in Community Health Nursing from Christian Medical College, Vellore, and managed to get a seat.<\/p>\n\n\n\n<p>“I chose Community Health Nursing since I need not restrict my area of work. Under this specialty, I could take any community-related issue as a part of my research. At this time, one of the biggest insights I had was that no matter how much I spoke against these topics or wrote articles or stories about them, it wouldn’t work unless I propose a solution. I then heard about the NCRRF opportunity and applied for the Fellowship. Although my areas of interest were dowry harassment and CSA, I proposed a study in adolescent malnutrition. My main aim was to explore interdisciplinary topics and build my capacities in social research through the Fellowship. The Fellowship gave me a strong base of knowledge and the rigorous methodologies that I learned enabled me to undertake good quality research into the topics I am passionate about,” she says.<\/p>\n\n\n\n<p>Ponnambily then undertook multiple studies relating to dowry harassment and child sexual abuse and her studies were able to propose well-researched solutions through suggestive changes in the relevant Indian Laws (POCSO Act, Dowry Prohibition Act). She has made multiple submissions to the National Authorities who are well-placed to address these issues through changes in the laws.<\/p>\n\n\n\n<p>Ponnambily feels that one of her biggest challenges is the word “Nurse”, which has a negative connotation, especially in academic circles. She feels there is a lot of attitude adjustment required from the medical fraternity towards nurses, who are considered not-so-technical and care-givers, especially in India. “The NCRRF Fellowship helped me mitigate this to an extent and gave me a lot of credibility and standing. It helped me gain acceptance in many academic spaces,” she recalls. “Humility, trust, and dedication – these are the principles that guide my work, and I will always maintain them,” says Ponnambily who is currently aspiring for a Ph.D. in National Consortium, Indian Nursing Council.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“When I was 10 years old, I learned that one of my friends was a victim of child sexual abuse,” says Ponnambily Jobin, who hails from Kottayam, Kerala. “When my friend described the incident to me, I felt very strongly affected, as if it was happening to me,” she recalls. Her friend discontinued her schooling [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[13],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/957"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=957"}],"version-history":[{"count":5,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/957\/revisions"}],"predecessor-version":[{"id":2851,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/957\/revisions\/2851"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=957"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=957"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=957"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}