{"id":960,"date":"2020-08-19T05:59:00","date_gmt":"2020-08-19T05:59:00","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?p=960"},"modified":"2022-07-18T13:05:21","modified_gmt":"2022-07-18T07:35:21","slug":"digambar-narzary-the-ncrrf-fellow-who-studied-the-state-of-children-in-relief-camps","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/digambar-narzary-the-ncrrf-fellow-who-studied-the-state-of-children-in-relief-camps\/","title":{"rendered":"Digambar Narzary &#8211; The NCRRF Fellow who studied the state of children in relief camps"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"715\" height=\"566\" src=\"\/wp-content\/uploads\/2020\/08\/fellow-3.jpg\" alt=\"Digambar Narzary\" class=\"wp-image-822\"\/><\/figure>\n\n\n\n<p>Digambar Narzary hails from Kokrajhar district of Bodoland Territorial Council, Assam. The conflict was a part of his childhood as it was all around him. After completing his Master’s in Social Work from Tata Institute of Social Sciences, Mumbai, he returned to his hometown and decided to work for the conflict-affected population in 2003. He began by visiting relief camps, where he made a startling realization that there were no adolescent girls and boys in these camps.<\/p>\n\n\n\n<p>Digambar, along with a friend who had graduated from JNU, Delhi founded Nedan Foundation, with the sole intention of collectivizing and bringing back adolescent children to the relief camps. At that time, they did not realize that the adolescent children had been trafficked out of the camps. They just knew that children tended to disappear from the camps after a certain age, and no one seemed to know where they went. With no resources except for some personal savings, they invested all they had into the foundation and began their work. They used to hold public hearings with more than 300+ parents who had lost their children to figure out where these children went and how they could be contacted. They brought this issue to the attention of the local administration and the Government and began the anti-human trafficking initiative which went on to become the core of the foundation.<\/p>\n\n\n\n<p>“At that time, there was no civil society organization working in that area for this cause, even though almost 2 decades of conflict had passed”, recalls Digambar. “We kept on mobilizing the community and writing about the missing children. We made history by tracing the girls to red light areas of Kolkata and Mumbai, and succeeded in bringing back nearly 200 girls”.<\/p>\n\n\n\n<p>The core mission of the Nedan Foundation was to counter child trafficking, and one of their main approaches was to make the systems of the relief camps strong – education, health and protection. “This way, people won’t be tempted to send their children away for better education, training, vocations or any of the other ruses used by traffickers,” says Narzary.<br \/>Narzary was awarded the NCRRF Fellowship in 2008, and this accorded him an opportunity to do rigorous research into the topic of his passion – how children coped with the distresses and the sub-human conditions in relief camps. “My NCRRF research became huge news at the state as well as the national level,” recalls Digambar. The study made this issue accessible at various platforms and gained widespread donor interest as well. It was in 2010 that the government allowed us to access funds from international donors which also threw a lot of light on the issue”.<\/p>\n\n\n\n<p>The Nedan Foundation filed a Public Interest Litigation in Guwahati High Court to ensure that the anti-human trafficking unit of the police should be operationalized. This went on to become a movement for prevention, rescue and rehabilitation of trafficked children, especially girls. The foundation also runs a children’s home for girls who don’t have families, and the girls are supported until their graduation. They are also offered jobs with the foundation if they show interest in becoming community mobilizers.<\/p>\n\n\n\n<p>Making child protection systems institutionalized in relief camps was the biggest challenge faced by the foundation in their endeavor. Only relentless advocacy was a strategy that worked. “It took nearly 10 years to mobilize compensation for trafficked victims,” he says. “We are also mobilizing for every district to have a children’s home funded by the state”.<br \/>Today, Nedan Foundation is a well-reputed child protection organization, that works in more than 600+ villages against child trafficking, mostly displaced forest villages of tribal communities. “The NCRRF Fellowship gave our work a massive push,” says Digambar.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Digambar Narzary hails from Kokrajhar district of Bodoland Territorial Council, Assam. The conflict was a part of his childhood as it was all around him. After completing his Master’s in Social Work from Tata Institute of Social Sciences, Mumbai, he returned to his hometown and decided to work for the conflict-affected population in 2003. He [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[13],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/960"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=960"}],"version-history":[{"count":8,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/960\/revisions"}],"predecessor-version":[{"id":3017,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/960\/revisions\/3017"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=960"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=960"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=960"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}