{"id":9678,"date":"2022-01-25T11:22:00","date_gmt":"2022-01-25T05:52:00","guid":{"rendered":"https:\/\/www.cry.org\/?p=9678"},"modified":"2022-01-25T12:57:26","modified_gmt":"2022-01-25T07:27:26","slug":"a-shackled-existence-from-the-rusty-lanes-of-madhya-pradesh","status":"publish","type":"post","link":"https:\/\/www.cry.org\/blog\/a-shackled-existence-from-the-rusty-lanes-of-madhya-pradesh\/","title":{"rendered":"A Shackled Existence – From the Rusty Lanes of Madhya Pradesh"},"content":{"rendered":"\n<p>“Didi, do you know what is my favourite past time? I love learning the names of medicines. That is why, I often run away to this medical shop in our village. I keep observing people whenever they come to buy medicines and ask a lot of questions to doctor uncle. You know what, by now I have learnt the names of a lot of medicines. After all, if I want to become a doctor, I will have to start from now.But most girls in our village have never seen school. And the ones who did, mostly never went past 8<sup>th<\/sup> standard. We have only one school in our village,which offers education only till 8<sup>th<\/sup> standard. The secondary school is far away and girls are not encouraged to pursue education. I do not fear any one because if you have to live your dreams, you have to fight the fear. I will become a doctor one day, even if it means walking miles to complete my education”.<\/p>\n\n\n\n<p>My heart leapt with pride hearing 12 year old Durga share about her dreams. In my 25 years of work in the non-profit sector, I have been to remotest villages of India, the ones where basic amenities are still making their way and met people no one wants to know about. My heart lights up with hope every time I meet children from disadvantaged communities like Durga basking in the strength of their dreams. Durga hails from Bedia community from one of the villages in the periphery of Bhopal, Madhya Pradesh. This travelogue gives a sneak peek into the lives of Bedia community and their hardships during my recent visit to Bhopal (as part of CRY intervention with Bedia children).<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1600\" height=\"1200\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/bedia-community.jpeg\" alt=\"Bedia community\" class=\"wp-image-9780\"\/><\/figure>\n\n\n\n<p>In India, where the birth of a girl child is still mourned, it is a completely different scenario for the Bedia community.Birth of girls is much awaited in the community and once girls are born; the community rejoices and celebrates.<\/p>\n\n\n\n<p>At the surface, this situation is likely to make us overjoyed,instilling a ray of hope but as we go deeper, a rather murkier side unearths.<\/p>\n\n\n\n<p>As soon as Bedia girls reaches puberty, they are pushed into prostitution, which is an intergenerational practice. The Bedia girls turn into the sole earner and their entire family feeds on the income generated from the intergenerational prostitution. Trapped in a vicious cycle of exploitation, the girls remain uneducated, thereby shutting their window to access better life and livelihood opportunities forever.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1600\" height=\"720\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/3.jpeg\" alt=\"Bedia community in MP\" class=\"wp-image-9680\"\/><\/figure>\n\n\n\n<p>Intergenerational prostitution has been an age old practice and source of livelihood for Bedia communities. Though there are manifold reasons for the community to be engaged in this profession, but the primary one is economic as it significantly impacts their standard of living. The starkness could be observed in the visible poverty of families who are not engaged in this form of livelihood as against families with improved living conditions who are following this practise.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1280\" height=\"850\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/6.jpeg\" alt=\"Bedia girls\" class=\"wp-image-9681\"\/><\/figure>\n\n\n\n<p>Most Bedia girls are subjected to a life of exploitation and deprivation once they are pushed into intergenerational prostitution. However, they aspire that their children are not forced into this profession and instead pursue <a href=\"https:\/\/www.cry.org\/blog\/non-profit-organization-that-helps-in-educating-underprivileged-children-in-india\/\">education<\/a> in the quest for a better life.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"768\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/12.jpeg\" alt=\"Bedia society\" class=\"wp-image-9682\"\/><\/figure>\n\n\n\n<p>Patriarchy is deeply embedded in the Bedia community. And like all male dominated societies, the Bedia girls and women also have no agency of their own. Their lives have been perennially under the veil with suppressed voices.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"863\" height=\"919\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/11.jpeg\" alt=\"purposeless life of Bedia community\" class=\"wp-image-9683\"\/><\/figure>\n\n\n\n<p>The boys and men of the Bedia community live a purposeless life without any ambition. They live off the earning of the girls and women of the household. Most of these boys and men act as pimps, ensuring that this practice of intergenerational prostitution continues.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"960\" height=\"1280\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/7.jpeg\" alt=\"environment of Bedia community\" class=\"wp-image-9684\"\/><\/figure>\n\n\n\n<p>Children in Bedia community grow up in an unhealthy environment wherein they are exposed to the practice of prostitution undertaken by families for survival since childhood. This in turn affects their mental health, deprives them of emotional nourishment and impacts their life choices.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"768\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/5.jpeg\" alt=\"nourishment for Bedia community\" class=\"wp-image-9685\"\/><\/figure>\n\n\n\n<p>In collaboration with partner organisation Samvedna, CRY is working in few villages spread across six districts of Madhya Pradesh. Samvedna works to combat caste based commercial sexual exploitation and human sex trafficking specifically in the Bedia community by working with both state and non state actors.&nbsp;&nbsp;<\/p>\n\n\n\n<p>The primary focus of our intervention is to encourage children to pursue education, motivate families to send their children to school instead of pushing them into intergenerational prostitution and give them an opportunity towards seeking a better quality of life.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1040\" height=\"585\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/13.jpeg\" alt=\"education for bedia girls \" class=\"wp-image-9686\"\/><\/figure>\n\n\n\n<p>Inter-generational exploitation of girls by pushing them into prostitution could be brought to an end by imparting education, giving a chance to the young girls to weave dreams and pursue them with all might and vigour.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"780\" height=\"1040\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/1.jpeg\" alt=\"education for Bedia children\" class=\"wp-image-9687\"\/><\/figure>\n\n\n\n<p>While the local school operates irregularly with minimum number of teachers, CRY through the Child Activity Centre ensures that children’s learning is not disrupted and they continue to gain knowledge, seek and grow.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"768\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/10.jpeg\" alt=\"education intervention\" class=\"wp-image-9688\"\/><\/figure>\n\n\n\n<p>Through our education intervention, we are making constant efforts in bridging the education gap of the Bedia children and connecting them to mainstream education. We believe in joyful education and impart the children learning through art, sports, theatre etc. and also invest in digital literacy classes. Life skills training is an integral part of the curriculum as we are working towards enhancing leadership skills of the children and help them become self-reliant.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"768\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/4.jpeg\" alt=\"Life for Bedia children\" class=\"wp-image-9689\"\/><\/figure>\n\n\n\n<p>Life for Bedia children is a harsh one. Either they are subjected to or witness emotional abuse from early childhood. Born in extreme poverty and living amongst deprivation, they are also raised in houses and neighbourhood wherein prostitution is not only a source of livelihood but also a way of life. Atop that, without having anyone to share their feelings, the deprivation and abuse is likely to deeply impact the minds of children and affect their mental well-being. Thus, emotional nurturing is an important and integral part of CRY intervention with Bedia children. Our teachers and community partners create an enabling environment for the children to share and discuss about their thoughts and feelings. Any kind of distress or emotional concerns faced by children are addressed with utmost care and sensitivity, which also positively impacts the overall development of children.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"585\" height=\"1040\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/9.png\" alt=\"hostel in Bhopal\" class=\"wp-image-9690\"\/><\/figure>\n\n\n\n<p>We help Bedia children get enrolled in hostels in Bhopal to avail better education facilities by linking them to Government welfare schemes and scholarship opportunities. The broader idea is to help the Bedia children to engage with children from other communities and change their perspective towards life. The effort is to break the cycle of intergenerational prostitution, through peer interactions, inspire children to focus on career growth and help them progress in the path of living a dignified life. We are also working with the same purpose in villages too since all children cannot be enrolled in hostels.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1280\" height=\"960\" src=\"https:\/\/www.cry.org\/wp-content\/uploads\/8.jpeg\" alt=\"street of Bedia community\" class=\"wp-image-9691\"\/><\/figure>\n\n\n\n<p>As part of our intervention with the Bedia community, we have observed that once children complete education till 12<sup>th<\/sup> standard, they usually go on to pursue higher education. Though there is a long road ahead, but we believe that through the power of education, we will be able to end this vicious cycle of exploitation and ensure that the Bedia children live a happy and healthy childhood.<\/p>\n\n\n\n<p><em>Written By: Ms.Soha Moitra, Regional Director,CRY<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>“Didi, do you know what is my favourite past time? I love learning the names of medicines. That is why, I often run away to this medical shop in our village. I keep observing people whenever they come to buy medicines and ask a lot of questions to doctor uncle. You know what, by now [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/9678"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=9678"}],"version-history":[{"count":8,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/9678\/revisions"}],"predecessor-version":[{"id":9784,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/posts\/9678\/revisions\/9784"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=9678"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/categories?post=9678"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/tags?post=9678"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}