{"id":859,"date":"2020-08-17T06:08:31","date_gmt":"2020-08-17T06:08:31","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?page_id=859"},"modified":"2021-07-08T12:23:36","modified_gmt":"2021-07-08T06:53:36","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/www.cry.org\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\n<div class=\"approach-hero-wrapper blog-article-main misc-tc-wrapper\">\n<div class=\"about-hero-caption about-hero-caption-wide\">\n<h1 class=\"hero-title\" style=\"font-size:45px;\">Privacy Policy<\/h1>\n<ol>\n<li>1. Child Rights and You (“CRY”) which was known as Child Relief and You before April 1, 2006, committed to the ethical collection, retention and use of information that you provide to us about yourself (“Personal Information”) on this site&nbsp;<a href=\"https:\/\/www.cry.org\/\">https:\/\/www.cry.org\/<\/a>&nbsp;(“Site”)<\/li>\n<li>Your Personal Information may comprise the following:\n<ol>\n<li>your name<\/li>\n<li>your age<\/li>\n<li>your occupation<\/li>\n<li>a user ID and password of your choice<\/li>\n<li>your email and mailing address<\/li>\n<li>your telephone number<\/li>\n<li>your payment processing details<\/li>\n<li>limited personal details<\/li>\n<li>Any other data as CRY may require<\/li>\n<\/ol>\n<\/li>\n<li>The following Privacy Policy sets forth our understanding with you on the collection, use and protection of your Personal Information. Please read the entire Privacy Policy.<\/li>\n<li>YOUR USE OF THE WEBSITE CONSTITUTES YOUR CONSENT TO THE ALL THE TERMS AND CONDITIONS CONTAINED IN THIS PRIVACY POLICY (AS AMENDED FROM TIME TO TIME) AND YOU SHALL BE BOUND BY THE SAME.<\/li>\n<li>Collection of Information\n<ol>\n<li>Site Browsing: You browse the Site anonymously. We do not require you to identify yourself or reveal any Personal Information while browsing through the Site. However, you may not be able to access certain sections of the Site or interact with us without supplying us with Personal Information. For instance, you would not be able to transact at the Site or make any donations at the Site, without providing the Site with Personal Information. If you desire to register yourself at the Site, you would be required to provide your Personal Information.<\/li>\n<li>While you are browsing through the Site, the Site’s operating system may automatically record some general information (“General Information”) about your visit such as:\n<ol>\n<li>(i) the date and time you visit the Site, along with the address of the previous website your were visiting, if you linked to us from another website<\/li>\n<li>(ii) the type of browser you are using (such as Internet Explorer version ‘X’)<\/li>\n<li>(iii) which ‘hit’ it is on the Site<\/li>\n<\/ol>\n<\/li>\n<li>The General Information is not Personal Information. CRY’s tracking system does not record personal information about individuals or link this information to any Personal Information collected from you.<\/li>\n<li>The General Information is used by CRY for statistical analysis, for tracking overall traffic patterns on the Site and to gauge the public interest in CRY and the Site. Such General Information may be shared by CRY with any person, at CRY’s discretion.<\/li>\n<li>Cookies:\n<ol>\n<li>“Cookies” are small amounts of data that a website can send to a web browser on a visitor’s computer. The cookie is stored on a visitor’s computer. A cookie may enable the site holder to track how a visitor navigates through its site and the areas in which they show interest. This is similar to a traffic report: it tracks trends and behaviors, but does not identify individuals. Information gathered may include date and time of visits, pages viewed, time spent at the site, and the site visited just before and just after the CRY site.<\/li>\n<li>Types of Cookies\n<ol>\n<li>Cookies can be set to expire: on a specified date after a specific period of time when a transaction has been completed or when a user turns off his\/her browser.<\/li>\n<li>A cookie that is erased from memory when a visitor’s browser closes is called a “session” cookie. Cookies that expire based on a time set by the Web server are called “persistent” cookies.<\/li>\n<li>Persistent cookies may be used in some cases, for example, to recognize when a visitor returns to a website. The web browser will send the cookie information from the initial visit back to the website. This is useful to the visitor if he or she has established a password at a particular website and wants to be identified by that site to perform a function or transaction.<\/li>\n<\/ol>\n<\/li>\n<li>To browse anonymously, you may set your browser to disable cookies or delete cookies. Please note that disabling cookies for some services will impact ability to use that service.&nbsp;<\/li>\n<li>Refusing Cookies on CRY’s Website<\/li>\n<li>Customers may choose not to accept cookies. Your web browser may alert and permit you to refuse cookies. When you receive an alert, you may choose at that time to refuse that cookie. If the use of cookies is a concern to you, then please make sure your browser has this capability, and that you set your browser to alert you accordingly.<\/li>\n<li>Newer browser versions allow you to be alerted or to automatically refuse cookies. You may need to download a more current version of your web browser from your service provider in order to obtain this option.<\/li>\n<li>Note: Some product features and services provided by CRY require you to accept a cookie in order to be able to use the particular functionality or service. These cookies are used to establish a link between the user and the application server. The cookies contain unique session IDs, and no customer data is stored on the cookies.<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>Usage of Information\n<ol>\n<li>Personal information will be used by CRY for internal purposes including the following:\n<ol>\n<li>(i) sending you inter alia emails, features, promotional material, surveys, brochures, catalogues, CRY Annual Report, CRY-in -Action, reminders for donations, regular updates on the utilisation of donations by CRY and other updates.<\/li>\n<li>(ii) processing your donations to CRY and purchases of CRY products on the Site.<\/li>\n<li>(iii) delivering the CRY products you have purchased on the Site \/Receipt for donations made by you to CRY.<\/li>\n<li>(iv) maintaining an internal confidential database of all the Personal Information collected from visitors to the Site<\/li>\n<li>(v) evaluating and administering the Site and CRY’s activities, responding to any problems that may arise and gauging visitor trends on the Site.<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>Disclosure of Personal Information by CRY\n<ol>\n<li>Within CRY, access to Personal Information collected by CRY will be given only to those persons who are authorised by CRY and third parties hired by CRY to perform administrative services. CRY will provide access to third parties for inter alia entering and managing Personal Information in CRY’s Database, processing your orders or donations preparing address labels, sending emails, which require such third parties to have access to your Personal Information. CRY cannot guarantee that such parties will keep your Personal Information confidential and CRY will not be liable in any manner for any loss of confidentiality attributable to such third parties.<\/li>\n<li>CRY may share Personal Information with any of persons who are associated with CRY, including companies and non-governmental organisations affiliated with CRY in any manner. CRY will retain ownership rights over such information and will share only such portions of the Personal Information as it deems fit.<\/li>\n<li>CRY is not liable in any manner whatsoever for the loss, damage(whether direct, indirect, consequential or incidental) or harm caused to you by the misuse of your Personal Information by a third party who is not an employee of CRY.<\/li>\n<li>Notwithstanding anything contained herein or any other contract between you and CRY, CRY reserves the right to disclose any Personal Information about you without notice or consent as needed to satisfy any requirement of law, regulation, legal request or legal investigation, to conduct investigations of breaches of law, to protect the Site, to protect CRY and it’s property, to fufill your requests, to protect our visitors and other persons and if required by the policy of CRY.<\/li>\n<\/ol>\n<\/li>\n<li>Security\n<ol>\n<li>CRY endevours to use up-to-date security measures to protect your Personal Information.The Site is a VERISIGN approved site.<\/li>\n<li>CRY however does not make any express or implied warranty with respect to the security measures that it may employ from time to time for the protection of the Personal Information.<\/li>\n<\/ol>\n<\/li>\n<li>Links to other Websites\n<ol>\n<li>The Site contains links to other websites for the benefit of it’s visitors. This Privacy Policy does not apply to such other websites. CRY is not expressly or impliedly responsible for, or liable to any loss or damage caused to you by the collection, use and retention of Personal Information by such website in any manner whatsoever. It is important that you review the privacy policies of all websites you visit before you disclose any information to such websites.<\/li>\n<\/ol>\n<\/li>\n<li>&nbsp;Variation of the Privacy Policy\n<ol>\n<li>CRY shall be absolutely entitled at its sole discretion from time to time add to, alter, delete or modify any of the terms and conditions contained herein. Such changes, additions, alterations, deletions or modifications shall be binding on you once you visit the Site after the Privacy Policy has been so amended.<\/li>\n<\/ol>\n<\/li>\n<li>Copyright Protection\n<ol>\n<li>All content on this Site including graphics, text, icons, interfaces, audio clips, logos, images and software is the property of CRY and\/or its content suppliers and is protected by Indian and international copyright laws. The arrangement and compilation (meaning the collection, arrangement, and assembly) of all content on this Site is the exclusive property of CRY and protected by Indian and international copyright laws. Permission is given to use the resources of this Site only for the purposes of making enquiries, making a donation or placing an order for the purchase of CRY products. Any other use, including the reproduction, modification, distribution, transmission, republication, display or performance, of the content on this Site can only be made with the express permission of CRY. All other trademarks, brands and copyrights other than those belonging to CRY belong to their respective owners and are their property.<\/li>\n<\/ol>\n<\/li>\n<li>CRY Donation Refund Policy\n<ol>\n<li>CRY takes the utmost care to process donations as per the instructions given by our donors, online and offline. However, in case of an unlikely event of an erroneous donation or if the donor would like to cancel his donation, CRY will respond to the donor within 7 working days of receiving a valid request for refund from the donor. The timely refund of the donation will depend upon the type of credit card\/banking instrument used during the transaction. The donor will have to send CRY a written request for a refund within 2 days of making the donation to CRY’s&nbsp;<a href=\"https:\/\/www.cry.org\/contact-us\/\" class=\"shortlink shortlink-397\" rel=\"\">official address<\/a>&nbsp;or email&nbsp;<a href=\"mailto:donorservice@crymail.org\">donorservice@crymail.org<\/a>&nbsp;along with-<br \/>1. Proof of the deduction of the donation amount.<br \/>2. In cases where the donation receipt has already been issued to the donor, the donor will have to return the original receipt to us at our office addresses.<br \/>3. If the tax exemption certificate is already issued, then we are sorry but we will not be able to refund the donation. However, in case of a valid refund request due to any error on CRY’s part, CRY will refund the donation and bear the costs of the same.<br \/>4. International donations will need minimum 10 days for the refund process.<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/div><\/div>\n\n\n\n\n","protected":false},"excerpt":{"rendered":"<p>Privacy Policy 1. Child Rights and You (“CRY”) which was known as Child Relief and You before April 1, 2006, committed to the ethical collection, retention and use of information that you provide to us about yourself (“Personal Information”) on this site&nbsp;https:\/\/www.cry.org\/&nbsp;(“Site”) Your Personal Information may comprise the following: your name your age your occupation [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"gen-page.php","meta":{"_mi_skip_tracking":false},"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/pages\/859"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=859"}],"version-history":[{"count":16,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/pages\/859\/revisions"}],"predecessor-version":[{"id":4703,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/pages\/859\/revisions\/4703"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=859"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}