{"id":871,"date":"2020-08-17T06:30:58","date_gmt":"2020-08-17T06:30:58","guid":{"rendered":"https:\/\/testsitestaging.cry.org\/?page_id=871"},"modified":"2021-07-08T13:17:18","modified_gmt":"2021-07-08T07:47:18","slug":"terms-conditions","status":"publish","type":"page","link":"https:\/\/www.cry.org\/terms-conditions\/","title":{"rendered":"Terms &#038; Conditions"},"content":{"rendered":"<div class=\"approach-hero-wrapper blog-article-main misc-tc-wrapper\">\n<div class=\"about-hero-caption about-hero-caption-wide\">\n<h1 class=\"hero-title\" style=\"font-size: 45px;\">Terms &amp; Conditions<\/h1>\n<div style=\"line-height: 1.5;\">Your access to and use of this website (<a href=\"https:\/\/www.cry.org\/\">www.cry.org<\/a>) referred to as “Site” is subject to the following terms and conditions and all applicable laws. By accessing and browsing this Site, you accept, without limitation or qualification, these Terms and Conditions and acknowledge that any other agreements between you and CRY – Child Rights and You (Child Relief and You before April 1, 2006)referred to as “CRY” are superseded and of no force or effect.<\/div>\n<ul>\n \t<li>You may download, display or print information from this Site (the “Information”) solely for non-commercial personal use.<\/li>\n \t<li>You must retain and reproduce each and every copyright notice or other proprietary rights notice contained in any Information you download. You may not, however, distribute, modify, transmit, reuse, repost, or use the content of the Site for public or commercial purposes, including the text, images, graphics, audio, and video without written permission of CRY. You should assume that everything you see or read on this Site is copyrighted unless otherwise noted and may not be used except as provided in these Terms and Conditions or in the text on the Site without the written permission of CRY. CRY neither warrants nor represents that your use of materials displayed on the Site will not infringe rights of third parties not owned by or affiliated with CRY.<\/li>\n \t<li>With the exception of the foregoing limited authorisation, no license to or right in any copyright of CRY or of any other party is granted or conferred to you.<\/li>\n \t<li>CRY site may contain or reference trademarks, patents, proprietary information, technologies, products, processes or other proprietary rights of CRY and\/or other parties. No license to or right in any such trademarks, patents, trade secrets, technologies, products, processes and other proprietary rights of CRY and\/or other parties is granted to or conferred upon you.<\/li>\n \t<li>While CRY uses reasonable efforts to include accurate and up to date information in the Site, CRY makes no warranties or representations with respect to the content of the Site, which is provided “as is”.CRY accepts no responsibility or liability whatsoever arising from or in any way connected with the use of this Site or its content. In particular, CRY will not be liable for the accuracy, completeness, adequacy, timeliness, or comprehensiveness of the information contained on the Site. Some jurisdictions do not allow the exclusion of implied warranties, so the above exclusion may not apply to you.CRY also assumes no responsibility, and shall not be liable for, any damages to, or viruses that may infect, your computer equipment or other property on account of your access to, use of, or browsing in the Site or your downloading of any materials, data, text, images, video, or audio from the Site.<\/li>\n \t<li>CRY reserves the right to interrupt or discontinue any or all of the functionality of its Site. CRY who is controlling this Site accepts no responsibility or liability whatsoever for any interruption or discontinuance of any or all functionality of its Site, whether the result of actions or omissions of an entity of CRY or a third party.<\/li>\n \t<li>Any communication or material you transmit to the Site by electronic mail or otherwise, including any data, questions, feedback, ideas, queries, comments, suggestions or the like is, and will be treated as, non-confidential and non-proprietary. Anything you transmit or post becomes the property of CRY or its affiliates and may be used for any purpose, including, but not limited to, reproduction, disclosure, transmission, publication, broadcast and posting.\nFurthermore, CRY is free to use any ideas, concepts, know-how, or techniques contained in any communication you send to the Site for any purpose whatsoever including, but not limited to, developing, manufacturing and marketing products using such information.<\/li>\n \t<li>The information may contain technical inaccuracies or typographical errors. CRY reserves the right to make changes, corrections and\/or improvements to the Information, and to the products and programmes described in such information, at any time without notice.<\/li>\n \t<li>The CRY site contains information on its products and services, not all of which are available in every location. A reference to a CRY product or service on the Site does not imply that such product or service is or will be available in your location.<\/li>\n \t<li>Because CRY has no control over and does not endorse any of the sites to which the Site is linked and because CRY has not reviewed any or all of the sites to which the Site is linked, you acknowledge that CRY is not responsible for the content of any off-Site pages or any other sites linked to the Site. Your linking to the Site, off-Site pages or other sites is at your own risk and without the permission of CRY.<\/li>\n \t<li>Although CRY may from time to time monitor or review postings, transmissions, bulletin boards, and the like on the Site,\nCRY is under no obligation to do so and assumes no responsibility or liability arising from the content of any such locations nor for any error, defamation, libel, slander, omission, falsehood, obscenity, pornography, profanity, danger, or inaccuracy contained in any information within such locations on the Site. You are prohibited from posting or transmitting any unlawful, threatening, libelous, defamatory, obscene, scandalous, inflammatory, pornographic, or profane material or any material that could constitute or encourage conduct that would be considered a criminal offense, give rise to civil liability, or otherwise violate any law.<\/li>\n \t<li>CRY will fully cooperate with any law enforcement authorities or court order requesting or directing CRY to disclose the identity of anyone posting any such information or materials.<\/li>\n \t<li>CRY may at any time revise these Terms and Conditions by updating this posting. You are bound by any such revisions and should therefore periodically visit this page to review the then current Terms and Conditions to which you are bound.<\/li>\n \t<li>Framing of this Site by sites or site elements of parties not part of the CRY is not permitted. In-line linking or any other manner of incorporating parts of this Site in sites of parties not part of CRY is equally prohibited.<\/li>\n \t<li>To best view this Web site, please consider the following recommendations. This site is best viewed with a resolution of 1024×768 (or higher) and supports Microsoft Internet Explorer 8.0+, Google Chrome 7.0+, Firefox 1.0+, and Safari 1.2+.&nbsp; We also recommend that you enable JavaScript and Pop-ups for this site in your browser’s settings. Please visit the links below to download and install the latest version of your browser.\n<ul>\n \t<li><a href=\"https:\/\/www.microsoft.com\/en-in\/windows\/\" target=\"_blank\" rel=\"noopener noreferrer\">Microsoft Internet Explorer<\/a><\/li>\n \t<li><a href=\"https:\/\/www.google.com\/intl\/en\/chrome\/browser\/\" target=\"_blank\" rel=\"noopener noreferrer\">Google Chrome<\/a><\/li>\n \t<li><a href=\"http:\/\/www.mozilla.org\/en-US\/firefox\/new\/\" target=\"_blank\" rel=\"noopener noreferrer\">Firefox<\/a><\/li>\n \t<li><a href=\"http:\/\/www.apple.com\/safari\/\" target=\"_blank\" rel=\"noopener noreferrer\">Safari<\/a><\/li>\n<\/ul>\n<\/li>\n \t<li>Some of the content on www.cry.org is presented in the Adobe Acrobat portable document format (PDF). You will need the free Adobe Acrobat Reader version 9.0 or later to view these documents. Please visit the link below to download and install the latest version of the Reader.\n–&nbsp;<a href=\"http:\/\/www.adobe.com\/products\/acrobat\/readermain.html\" target=\"_blank\" rel=\"noopener noreferrer\">Adobe Acrobat Reader<\/a>\nThe multimedia files on www.cry.org may also require the following free browser plug-in:\n–&nbsp;<a href=\"http:\/\/www.adobe.com\/products\/flashplayer\/\" target=\"_blank\" rel=\"noopener noreferrer\">Macromedia Flash Player<\/a><\/li>\n<\/ul>\n<\/div>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Terms &amp; Conditions Your access to and use of this website (www.cry.org) referred to as “Site” is subject to the following terms and conditions and all applicable laws. By accessing and browsing this Site, you accept, without limitation or qualification, these Terms and Conditions and acknowledge that any other agreements between you and CRY – [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"gen-page.php","meta":{"_mi_skip_tracking":false},"acf":[],"_links":{"self":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/pages\/871"}],"collection":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/comments?post=871"}],"version-history":[{"count":17,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/pages\/871\/revisions"}],"predecessor-version":[{"id":3779,"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/pages\/871\/revisions\/3779"}],"wp:attachment":[{"href":"https:\/\/www.cry.org\/wp-json\/wp\/v2\/media?parent=871"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}